zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
/*
 * Copyright (c) 2009-2018 ARM Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     cw32l011.h
 * @brief    CMSIS HeaderFile
 * @version  1.2
 * @date     24. July 2024
 * @note     Generated by SVDConv V3.3.25 on Wednesday, 24.07.2024 18:59:35
 *           from File 'cw32l011.svd',
 *           last modified on Wednesday, 24.07.2024 10:59:28
 */

/** @addtogroup Wuhan Xinyuan Semiconductor Co.Ltd
 * @{
 */

/** @addtogroup cw32l011
 * @{
 */

#ifndef __CW32L011_H
#define __CW32L011_H

#ifdef __cplusplus
extern "C"
{
#endif

  /** @addtogroup Configuration_of_CMSIS
   * @{
   */

  /* =========================================================================================================================== */
  /* ================                                Interrupt Number Definition                                ================ */
  /* =========================================================================================================================== */

  typedef enum
  {
    /* =======================================  ARM Cortex-M0+ Specific Interrupt Numbers  ======================================= */
    Reset_IRQn = -15,          /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
    NonMaskableInt_IRQn = -14, /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
    HardFault_IRQn = -13,      /*!< -13  Hard Fault, all classes of Fault                                     */
    SVCall_IRQn = -5,          /*!< -5 System Service Call via SVC instruction                                */
    PendSV_IRQn = -2,          /*!< -2 Pendable request for system service                                    */
    SysTick_IRQn = -1,         /*!< -1 System Tick Timer                                                      */
                               /* ==========================================  cw32l011 Specific Interrupt Numbers  ========================================== */
    WDT_IRQn = 0,              /*!< 0  Watch Dog Timer Interrupt                                              */
    LVD_IRQn = 1,              /*!< 1  Low Voltage Detect Interrupt                                           */
    RTC_IRQn = 2,              /*!< 2  Real Time Clock Interrupt                                              */
    FLASHRAM_IRQn = 3,         /*!< 3  Flash/RAM Interrupt                                                    */
    SYSCTRL_IRQn = 4,          /*!< 4  SYSCTRL Interupt                                                       */
    GPIOA_IRQn = 5,            /*!< 5  GPIOA Interrupt                                                        */
    GPIOB_IRQn = 6,            /*!< 6  GPIOB Interrupt                                                        */
    GPIOC_IRQn = 7,            /*!< 7  GPIOC Interrupt                                                        */
    ADC_IRQn = 12,             /*!< 12 ADC Interrupt                                                          */
    ATIM_IRQn = 13,            /*!< 13 Advanced Timer Interrupt                                               */
    VC1_IRQn = 14,             /*!< 14 Voltage Comparator 1 Interrupt                                         */
    VC2_IRQn = 15,             /*!< 15 Voltage Comparator 2 Interrupt                                         */
    GTIM1_IRQn = 16,           /*!< 16 General Timer1 Interrupt                                               */
    GTIM2_IRQn = 17,           /*!< 17 General Timer1 Interrupt                                               */
    LPTIM_IRQn = 19,           /*!< 19 LPTIM Interrupt                                                        */
    BTIM1_IRQn = 20,           /*!< 20 Base Timer1 Interrupt                                                  */
    BTIM2_IRQn = 21,           /*!< 21 Base Timer2 Interrupt                                                  */
    BTIM3_IRQn = 22,           /*!< 22 Base Timer3 Interrupt                                                  */
    I2C_IRQn = 23,             /*!< 23 I2C Interrupt                                                         */
    SPI_IRQn = 25,             /*!< 25 SPI Interrupt                                                          */
    UART1_IRQn = 27,           /*!< 27 UART1 Interrupt                                                        */
    UART2_IRQn = 28,           /*!< 28 UART2 Interrupt                                                        */
    UART3_IRQn = 29,           /*!< 29 UART3 Interrupt                                                        */
    CLKFAULT_IRQn = 31         /*!< 31 Clock Fault Interrupt                                                  */
  } IRQn_Type;

/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ==========================  Configuration of the ARM Cortex-M0+ Processor and Core Peripherals  =========================== */
#define __CM0PLUS_REV 0x0001U    /*!< CM0PLUS Core Revision                                                     */
#define __NVIC_PRIO_BITS 2       /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig 0 /*!< Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT 1         /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
#define __MPU_PRESENT 0          /*!< MPU present                                                               */
#define __FPU_PRESENT 0          /*!< FPU present                                                               */

  /** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0plus.h"    /*!< ARM Cortex-M0+ processor and core peripherals                             */
#include "system_cw32l011.h" /*!< cw32l011 System                                                           */

#ifndef __IM /*!< Fallback for older CMSIS versions                                         */
#define __IM __I
#endif
#ifndef __OM /*!< Fallback for older CMSIS versions                                         */
#define __OM __O
#endif
#ifndef __IOM /*!< Fallback for older CMSIS versions                                         */
#define __IOM __IO
#endif

/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined(__CC_ARM)
#pragma push
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language = extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
#pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
#pragma warning 586
#elif defined(__CSMC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

  /* =========================================================================================================================== */
  /* ================                            Device Specific Peripheral Section                             ================ */
  /* =========================================================================================================================== */

  /** @addtogroup Device_Peripheral_peripherals
   * @{
   */

  /* =========================================================================================================================== */
  /* ================                                            ADC                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc ADC (ADC)
   */

  typedef struct
  { /*!< (@ 0x40000000) ADC Structure                                              */

    union
    {
      __IOM uint32_t CR; /*!< (@ 0x00000000) desc CR                                                    */

      struct
      {
        __IOM uint32_t EN : 1;    /*!< [0..0] desc EN                                                            */
        __IOM uint32_t BGREN : 1; /*!< [1..1] desc BGREN                                                         */
        __IOM uint32_t TSEN : 1;  /*!< [2..2] desc TSEN                                                          */
        __IOM uint32_t CONT : 1;  /*!< [3..3] desc CONT                                                          */
        __IOM uint32_t CLK : 2;   /*!< [5..4] desc CLK                                                           */
        __IOM uint32_t ENS : 3;   /*!< [8..6] desc ENS                                                           */
      } CR_f;
    };
    __IM uint32_t RESERVED;

    union
    {
      __IOM uint32_t START; /*!< (@ 0x00000008) desc START                                                 */

      struct
      {
        __IOM uint32_t START : 1; /*!< [0..0] desc START                                                         */
      } START_f;
    };
    __IM uint32_t RESERVED1;

    union
    {
      __IOM uint32_t AWDTR; /*!< (@ 0x00000010) desc AWDTR                                                 */

      struct
      {
        __IOM uint32_t VTL : 12; /*!< [11..0] desc VTL                                                          */
        __IM uint32_t : 4;
        __IOM uint32_t VTH : 12; /*!< [27..16] desc VTH                                                         */
      } AWDTR_f;
    };
    __IM uint32_t RESERVED2;

    union
    {
      __IOM uint32_t TRIGGER; /*!< (@ 0x00000018) desc TRIGGER                                               */

      struct
      {
        __IOM uint32_t ATIMTRGO : 1;  /*!< [0..0] desc ATIMTRGO                                                      */
        __IOM uint32_t ATIMTRGO2 : 1; /*!< [1..1] desc ATIMTRGO2                                                     */
        __IOM uint32_t ATIMCC1 : 1;   /*!< [2..2] desc ATIMCC1                                                       */
        __IOM uint32_t ATIMCC2 : 1;   /*!< [3..3] desc ATIMCC2                                                       */
        __IOM uint32_t ATIMCC3 : 1;   /*!< [4..4] desc ATIMCC3                                                       */
        __IOM uint32_t ATIMCC4 : 1;   /*!< [5..5] desc ATIMCC4                                                       */
        __IOM uint32_t ATIMCC5 : 1;   /*!< [6..6] desc ATIMCC5                                                       */
        __IOM uint32_t ATIMCC6 : 1;   /*!< [7..7] desc ATIMCC6                                                       */
        __IOM uint32_t GTIM1TRGO : 1; /*!< [8..8] desc GTIM1TRGO                                                     */
        __IOM uint32_t GTIM1CC1 : 1;  /*!< [9..9] desc GTIM1CC1                                                      */
        __IOM uint32_t GTIM1CC2 : 1;  /*!< [10..10] desc GTIM1CC2                                                    */
        __IOM uint32_t GTIM1CC3 : 1;  /*!< [11..11] desc GTIM1CC3                                                    */
        __IOM uint32_t GTIM1CC4 : 1;  /*!< [12..12] desc GTIM1CC4                                                    */
        __IOM uint32_t BTIM1TRGO : 1; /*!< [13..13] desc BTIM1TRGO                                                   */
        __IOM uint32_t BTIM2TRGO : 1; /*!< [14..14] desc BTIM2TRGO                                                   */
        __IOM uint32_t BTIM3TRGO : 1; /*!< [15..15] desc BTIM3TRGO                                                   */
        __IOM uint32_t SPI1 : 1;      /*!< [16..16] desc SPI1                                                        */
        __IOM uint32_t UART1 : 1;     /*!< [17..17] desc UART1                                                       */
        __IOM uint32_t UART2 : 1;     /*!< [18..18] desc UART2                                                       */
        __IOM uint32_t UART3 : 1;     /*!< [19..19] desc UART3                                                       */
        __IOM uint32_t GTIM2TRGO : 1; /*!< [20..20] desc GTIM2TRGO                                                   */
        __IOM uint32_t GTIM2CC1 : 1;  /*!< [21..21] desc GTIM2CC1                                                    */
        __IOM uint32_t GTIM2CC2 : 1;  /*!< [22..22] desc GTIM2CC2                                                    */
        __IOM uint32_t GTIM2CC3 : 1;  /*!< [23..23] desc GTIM2CC3                                                    */
        __IOM uint32_t GTIM2CC4 : 1;  /*!< [24..24] desc GTIM2CC4                                                    */
      } TRIGGER_f;
    };
    __IM uint32_t RESERVED3;

    union
    {
      __IOM uint32_t AWDCR; /*!< (@ 0x00000020) desc AWDCR                                                 */

      struct
      {
        __IOM uint32_t IN0 : 1;  /*!< [0..0] desc IN0                                                           */
        __IOM uint32_t IN1 : 1;  /*!< [1..1] desc IN1                                                           */
        __IOM uint32_t IN2 : 1;  /*!< [2..2] desc IN2                                                           */
        __IOM uint32_t IN3 : 1;  /*!< [3..3] desc IN3                                                           */
        __IOM uint32_t IN4 : 1;  /*!< [4..4] desc IN4                                                           */
        __IOM uint32_t IN5 : 1;  /*!< [5..5] desc IN5                                                           */
        __IOM uint32_t IN6 : 1;  /*!< [6..6] desc IN6                                                           */
        __IOM uint32_t IN7 : 1;  /*!< [7..7] desc IN7                                                           */
        __IOM uint32_t IN8 : 1;  /*!< [8..8] desc IN8                                                           */
        __IOM uint32_t IN9 : 1;  /*!< [9..9] desc IN9                                                           */
        __IOM uint32_t IN10 : 1; /*!< [10..10] desc IN10                                                        */
        __IOM uint32_t IN11 : 1; /*!< [11..11] desc IN11                                                        */
        __IOM uint32_t IN12 : 1; /*!< [12..12] desc IN12                                                        */
        __IOM uint32_t IN13 : 1; /*!< [13..13] desc IN13                                                        */
        __IOM uint32_t IN14 : 1; /*!< [14..14] desc IN14                                                        */
        __IOM uint32_t IN15 : 1; /*!< [15..15] desc IN15                                                        */
      } AWDCR_f;
    };
    __IM uint32_t RESERVED4;

    union
    {
      __IOM uint32_t SAMPLE; /*!< (@ 0x00000028) desc SAMPLE                                                */

      struct
      {
        __IOM uint32_t SQRCH0 : 4; /*!< [3..0] desc SQRCH0                                                        */
        __IOM uint32_t SQRCH1 : 4; /*!< [7..4] desc SQRCH1                                                        */
        __IOM uint32_t SQRCH2 : 4; /*!< [11..8] desc SQRCH2                                                       */
        __IOM uint32_t SQRCH3 : 4; /*!< [15..12] desc SQRCH3                                                      */
        __IOM uint32_t SQRCH4 : 4; /*!< [19..16] desc SQRCH4                                                      */
        __IOM uint32_t SQRCH5 : 4; /*!< [23..20] desc SQRCH5                                                      */
        __IOM uint32_t SQRCH6 : 4; /*!< [27..24] desc SQRCH6                                                      */
        __IOM uint32_t SQRCH7 : 4; /*!< [31..28] desc SQRCH7                                                      */
      } SAMPLE_f;
    };

    union
    {
      __IOM uint32_t SQRCFR; /*!< (@ 0x0000002C) desc SQRCFR                                                */

      struct
      {
        __IOM uint32_t SQRCH0 : 4; /*!< [3..0] desc SQRCH0                                                        */
        __IOM uint32_t SQRCH1 : 4; /*!< [7..4] desc SQRCH1                                                        */
        __IOM uint32_t SQRCH2 : 4; /*!< [11..8] desc SQRCH2                                                       */
        __IOM uint32_t SQRCH3 : 4; /*!< [15..12] desc SQRCH3                                                      */
        __IOM uint32_t SQRCH4 : 4; /*!< [19..16] desc SQRCH4                                                      */
        __IOM uint32_t SQRCH5 : 4; /*!< [23..20] desc SQRCH5                                                      */
        __IOM uint32_t SQRCH6 : 4; /*!< [27..24] desc SQRCH6                                                      */
        __IOM uint32_t SQRCH7 : 4; /*!< [31..28] desc SQRCH7                                                      */
      } SQRCFR_f;
    };
    __IM uint32_t RESERVED5[4];

    union
    {
      __IM uint32_t RESULT0; /*!< (@ 0x00000040) desc RESULT0                                               */

      struct
      {
        __IM uint32_t RESULT : 16; /*!< [15..0] desc RESULT                                                       */
      } RESULT0_f;
    };

    union
    {
      __IM uint32_t RESULT1; /*!< (@ 0x00000044) desc RESULT1                                               */

      struct
      {
        __IM uint32_t RESULT : 16; /*!< [15..0] desc RESULT                                                       */
      } RESULT1_f;
    };

    union
    {
      __IM uint32_t RESULT2; /*!< (@ 0x00000048) desc RESULT2                                               */

      struct
      {
        __IM uint32_t RESULT : 16; /*!< [15..0] desc RESULT                                                       */
      } RESULT2_f;
    };

    union
    {
      __IM uint32_t RESULT3; /*!< (@ 0x0000004C) desc RESULT3                                               */

      struct
      {
        __IM uint32_t RESULT : 16; /*!< [15..0] desc RESULT                                                       */
      } RESULT3_f;
    };

    union
    {
      __IM uint32_t RESULT4; /*!< (@ 0x00000050) desc RESULT4                                               */

      struct
      {
        __IM uint32_t RESULT : 16; /*!< [15..0] desc RESULT                                                       */
      } RESULT4_f;
    };

    union
    {
      __IM uint32_t RESULT5; /*!< (@ 0x00000054) desc RESULT5                                               */

      struct
      {
        __IM uint32_t RESULT : 16; /*!< [15..0] desc RESULT                                                       */
      } RESULT5_f;
    };

    union
    {
      __IM uint32_t RESULT6; /*!< (@ 0x00000058) desc RESULT6                                               */

      struct
      {
        __IM uint32_t RESULT : 16; /*!< [15..0] desc RESULT                                                       */
      } RESULT6_f;
    };

    union
    {
      __IM uint32_t RESULT7; /*!< (@ 0x0000005C) desc RESULT7                                               */

      struct
      {
        __IM uint32_t RESULT : 16; /*!< [15..0] desc RESULT                                                       */
      } RESULT7_f;
    };
    __IM uint32_t RESERVED6[5];

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000074) desc IER                                                   */

      struct
      {
        __IOM uint32_t EOC : 1;  /*!< [0..0] desc EOC                                                           */
        __IOM uint32_t EOS : 1;  /*!< [1..1] desc EOS                                                           */
        __IOM uint32_t AWDL : 1; /*!< [2..2] desc AWDL                                                          */
        __IOM uint32_t AWDH : 1; /*!< [3..3] desc AWDH                                                          */
      } IER_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000078) desc ICR                                                   */

      struct
      {
        __IOM uint32_t EOC : 1;  /*!< [0..0] desc EOC                                                           */
        __IOM uint32_t EOS : 1;  /*!< [1..1] desc EOS                                                           */
        __IOM uint32_t AWDL : 1; /*!< [2..2] desc AWDL                                                          */
        __IOM uint32_t AWDH : 1; /*!< [3..3] desc AWDH                                                          */
      } ICR_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x0000007C) desc ISR                                                   */

      struct
      {
        __IM uint32_t EOC : 1;  /*!< [0..0] desc EOC                                                           */
        __IM uint32_t EOS : 1;  /*!< [1..1] desc EOS                                                           */
        __IM uint32_t AWDL : 1; /*!< [2..2] desc AWDL                                                          */
        __IM uint32_t AWDH : 1; /*!< [3..3] desc AWDH                                                          */
      } ISR_f;
    };
  } ADC_TypeDef; /*!< Size = 128 (0x80)                                                         */

  /* =========================================================================================================================== */
  /* ================                                           ATIM                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc ATIM (ATIM)
   */

  typedef struct
  { /*!< (@ 0x40001400) ATIM Structure                                             */

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000000) Control Register1                                          */

