zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
      struct
      {
        __IOM uint32_t CEN : 1;  /*!< [0..0] desc CEN                                                           */
        __IOM uint32_t UDIS : 1; /*!< [1..1] desc UDIS                                                          */
        __IOM uint32_t URS : 1;  /*!< [2..2] desc URS                                                           */
        __IOM uint32_t OPM : 1;  /*!< [3..3] desc OPM                                                           */
        __IOM uint32_t DIR : 1;  /*!< [4..4] desc DIR                                                           */
        __IOM uint32_t CMS : 2;  /*!< [6..5] desc CMS                                                           */
        __IOM uint32_t ARPE : 1; /*!< [7..7] desc ARPE                                                          */
        __IOM uint32_t CKD : 2;  /*!< [9..8] desc CKD                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t UIFREMAP : 1; /*!< [11..11] desc UIFREMAP                                                    */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x00000004) Control Register2                                          */

      struct
      {
        __IOM uint32_t CCPC : 1; /*!< [0..0] desc CCPC                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t CCUS : 1; /*!< [2..2] desc CCUS                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t MMS : 3;   /*!< [6..4] desc MMS                                                           */
        __IOM uint32_t TI1S : 1;  /*!< [7..7] desc TI1S                                                          */
        __IOM uint32_t OIS1 : 1;  /*!< [8..8] desc OIS1                                                          */
        __IOM uint32_t OIS1N : 1; /*!< [9..9] desc OIS1N                                                         */
        __IOM uint32_t OIS2 : 1;  /*!< [10..10] desc OIS2                                                        */
        __IOM uint32_t OIS2N : 1; /*!< [11..11] desc OIS2N                                                       */
        __IOM uint32_t OIS3 : 1;  /*!< [12..12] desc OIS3                                                        */
        __IOM uint32_t OIS3N : 1; /*!< [13..13] desc OIS3N                                                       */
        __IOM uint32_t OIS4 : 1;  /*!< [14..14] desc OIS4                                                        */
        __IOM uint32_t OIS4N : 1; /*!< [15..15] desc OIS4N                                                       */
        __IOM uint32_t OIS5 : 1;  /*!< [16..16] desc OIS5                                                        */
        __IOM uint32_t OIS5N : 1; /*!< [17..17] desc OIS5N                                                       */
        __IOM uint32_t OIS6 : 1;  /*!< [18..18] desc OIS6                                                        */
        __IOM uint32_t OIS6N : 1; /*!< [19..19] desc OIS6N                                                       */
        __IOM uint32_t MMS2 : 5;  /*!< [24..20] desc MMS2                                                        */
        __IOM uint32_t MMSH : 2;  /*!< [26..25] desc MMSH                                                        */
      } CR2_f;
    };

    union
    {
      __IOM uint32_t SMCR; /*!< (@ 0x00000008) Slave Mode Control Register                                */

      struct
      {
        __IOM uint32_t SMS : 3;  /*!< [2..0] desc SMS                                                           */
        __IOM uint32_t OCCS : 1; /*!< [3..3] desc OCCS                                                          */
        __IOM uint32_t TS : 3;   /*!< [6..4] desc TS                                                            */
        __IOM uint32_t MSM : 1;  /*!< [7..7] desc MSM                                                           */
        __IOM uint32_t ETF : 4;  /*!< [11..8] desc ETF                                                          */
        __IOM uint32_t ETPS : 2; /*!< [13..12] desc ETPS                                                        */
        __IOM uint32_t ECE : 1;  /*!< [14..14] desc ECE                                                         */
        __IOM uint32_t ETP : 1;  /*!< [15..15] desc ETP                                                         */
        __IOM uint32_t SMSH : 1; /*!< [16..16] desc SMSH                                                        */
        __IM uint32_t : 3;
        __IOM uint32_t TSH : 2; /*!< [21..20] desc TSH                                                         */
        __IM uint32_t : 2;
        __IOM uint32_t SMSPE : 1; /*!< [24..24] desc SMSPE                                                       */
        __IOM uint32_t SMSPS : 1; /*!< [25..25] desc SMSPS                                                       */
      } SMCR_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x0000000C) Interrupt Enable Register                                  */

      struct
      {
        __IOM uint32_t UIE : 1;   /*!< [0..0] desc UIE                                                           */
        __IOM uint32_t CC1IE : 1; /*!< [1..1] desc CC1IE                                                         */
        __IOM uint32_t CC2IE : 1; /*!< [2..2] desc CC2IE                                                         */
        __IOM uint32_t CC3IE : 1; /*!< [3..3] desc CC3IE                                                         */
        __IOM uint32_t CC4IE : 1; /*!< [4..4] desc CC4IE                                                         */
        __IOM uint32_t COMIE : 1; /*!< [5..5] desc COMIE                                                         */
        __IOM uint32_t TIE : 1;   /*!< [6..6] desc TIE                                                           */
        __IOM uint32_t BIE : 1;   /*!< [7..7] desc BIE                                                           */
        __IM uint32_t : 8;
        __IOM uint32_t CC5IE : 1; /*!< [16..16] desc CC5IE                                                       */
        __IOM uint32_t CC6IE : 1; /*!< [17..17] desc CC6IE                                                       */
        __IM uint32_t : 2;
        __IOM uint32_t IDXIE : 1;  /*!< [20..20] desc IDXIE                                                       */
        __IOM uint32_t DIRIE : 1;  /*!< [21..21] desc DIRIE                                                       */
        __IOM uint32_t IERRIE : 1; /*!< [22..22] desc IERRIE                                                      */
        __IOM uint32_t TERRIE : 1; /*!< [23..23] desc TERRIE                                                      */
      } IER_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000010) Interrupt status register                                  */

      struct
      {
        __IM uint32_t UIF : 1;   /*!< [0..0] desc UIF                                                           */
        __IM uint32_t CC1IF : 1; /*!< [1..1] desc CC1IF                                                         */
        __IM uint32_t CC2IF : 1; /*!< [2..2] desc CC2IF                                                         */
        __IM uint32_t CC3IF : 1; /*!< [3..3] desc CC3IF                                                         */
        __IM uint32_t CC4IF : 1; /*!< [4..4] desc CC4IF                                                         */
        __IM uint32_t COMIF : 1; /*!< [5..5] desc COMIF                                                         */
        __IM uint32_t TIF : 1;   /*!< [6..6] desc TIF                                                           */
        __IM uint32_t BIF : 1;   /*!< [7..7] desc BIF                                                           */
        __IM uint32_t B2IF : 1;  /*!< [8..8] desc B2IF                                                          */
        __IM uint32_t CC1OF : 1; /*!< [9..9] desc CC1OF                                                         */
        __IM uint32_t CC2OF : 1; /*!< [10..10] desc CC2OF                                                       */
        __IM uint32_t CC3OF : 1; /*!< [11..11] desc CC3OF                                                       */
        __IM uint32_t CC4OF : 1; /*!< [12..12] desc CC4OF                                                       */
        __IM uint32_t SBIF : 1;  /*!< [13..13] desc SBIF                                                        */
        __IM uint32_t : 2;
        __IM uint32_t CC5IF : 1; /*!< [16..16] desc CC5IF                                                       */
        __IM uint32_t CC6IF : 1; /*!< [17..17] desc CC6IF                                                       */
        __IM uint32_t CC5OF : 1; /*!< [18..18] desc CC5OF                                                       */
        __IM uint32_t CC6OF : 1; /*!< [19..19] desc CC6OF                                                       */
        __IM uint32_t IDXF : 1;  /*!< [20..20] desc IDXF                                                        */
        __IM uint32_t DIRF : 1;  /*!< [21..21] desc DIRF                                                        */
        __IM uint32_t IERRF : 1; /*!< [22..22] desc IERRF                                                       */
        __IM uint32_t TERRF : 1; /*!< [23..23] desc TERRF                                                       */
      } ISR_f;
    };

    union
    {
      __IOM uint32_t EGR; /*!< (@ 0x00000014) Event generation register                                  */

      struct
      {
        __IOM uint32_t UG : 1;   /*!< [0..0] desc UG                                                            */
        __IOM uint32_t CC1G : 1; /*!< [1..1] desc CC1G                                                          */
        __IOM uint32_t CC2G : 1; /*!< [2..2] desc CC2G                                                          */
        __IOM uint32_t CC3G : 1; /*!< [3..3] desc CC3G                                                          */
        __IOM uint32_t CC4G : 1; /*!< [4..4] desc CC4G                                                          */
        __IOM uint32_t COMG : 1; /*!< [5..5] desc COMG                                                          */
        __IOM uint32_t TG : 1;   /*!< [6..6] desc TG                                                            */
        __IOM uint32_t BG : 1;   /*!< [7..7] desc BG                                                            */
        __IOM uint32_t B2G : 1;  /*!< [8..8] desc B2G                                                           */
        __IM uint32_t : 7;
        __IOM uint32_t CC5G : 1; /*!< [16..16] desc CC5G                                                        */
        __IOM uint32_t CC6G : 1; /*!< [17..17] desc CC6G                                                        */
      } EGR_f;
    };

    union
    {
      union
      {
        __IOM uint32_t CCMR1CAP; /*!< (@ 0x00000018) capture compare mode register 1                            */

        struct
        {
          __IOM uint32_t CC1S : 2;   /*!< [1..0] desc CC1S                                                          */
          __IOM uint32_t IC1PSC : 2; /*!< [3..2] desc IC1PSC                                                        */
          __IOM uint32_t IC1F : 4;   /*!< [7..4] desc IC1F                                                          */
          __IOM uint32_t CC2S : 2;   /*!< [9..8] desc CC2S                                                          */
          __IOM uint32_t IC2PSC : 2; /*!< [11..10] desc IC2PSC                                                      */
          __IOM uint32_t IC2F : 4;   /*!< [15..12] desc IC2F                                                        */
        } CCMR1CAP_f;
      };

      union
      {
        __IOM uint32_t CCMR1CMP; /*!< (@ 0x00000018) capture compare mode register 1                            */

        struct
        {
          __IOM uint32_t CC1S : 2;  /*!< [1..0] desc CC1S                                                          */
          __IOM uint32_t OC1FE : 1; /*!< [2..2] desc OC1FE                                                         */
          __IOM uint32_t OC1PE : 1; /*!< [3..3] desc OC1PE                                                         */
          __IOM uint32_t OC1M : 3;  /*!< [6..4] desc OC1M                                                          */
          __IOM uint32_t OC1CE : 1; /*!< [7..7] desc OC1CE                                                         */
          __IOM uint32_t CC2S : 2;  /*!< [9..8] desc CC2S                                                          */
          __IOM uint32_t OC2FE : 1; /*!< [10..10] desc OC2FE                                                       */
          __IOM uint32_t OC2PE : 1; /*!< [11..11] desc OC2PE                                                       */
          __IOM uint32_t OC2M : 3;  /*!< [14..12] desc OC2M                                                        */
          __IOM uint32_t OC2CE : 1; /*!< [15..15] desc OC2CE                                                       */
          __IOM uint32_t OC1MH : 1; /*!< [16..16] desc OC1MH                                                       */
          __IM uint32_t : 7;
          __IOM uint32_t OC2MH : 1; /*!< [24..24] desc OC2MH                                                       */
        } CCMR1CMP_f;
      };
    };

    union
    {
      union
      {
        __IOM uint32_t CCMR2CAP; /*!< (@ 0x0000001C) capture compare mode register 2                            */

        struct
        {
          __IOM uint32_t CC3S : 2;   /*!< [1..0] desc CC3S                                                          */
          __IOM uint32_t IC3PSC : 2; /*!< [3..2] desc IC3PSC                                                        */
          __IOM uint32_t IC3F : 4;   /*!< [7..4] desc IC3F                                                          */
          __IOM uint32_t CC4S : 2;   /*!< [9..8] desc CC4S                                                          */
          __IOM uint32_t IC4PSC : 2; /*!< [11..10] desc IC4PSC                                                      */
          __IOM uint32_t IC4F : 4;   /*!< [15..12] desc IC4F                                                        */
        } CCMR2CAP_f;
      };

      union
      {
        __IOM uint32_t CCMR2CMP; /*!< (@ 0x0000001C) capture compare mode register 2                            */

        struct
        {
          __IOM uint32_t CC3S : 2;  /*!< [1..0] desc CC3S                                                          */
          __IOM uint32_t OC3FE : 1; /*!< [2..2] desc OC3FE                                                         */
          __IOM uint32_t OC3PE : 1; /*!< [3..3] desc OC3PE                                                         */
          __IOM uint32_t OC3M : 3;  /*!< [6..4] desc OC3M                                                          */
          __IOM uint32_t OC3CE : 1; /*!< [7..7] desc OC3CE                                                         */
          __IOM uint32_t CC4S : 2;  /*!< [9..8] desc CC4S                                                          */
          __IOM uint32_t OC4FE : 1; /*!< [10..10] desc OC4FE                                                       */
          __IOM uint32_t OC4PE : 1; /*!< [11..11] desc OC4PE                                                       */
          __IOM uint32_t OC4M : 3;  /*!< [14..12] desc OC4M                                                        */
          __IOM uint32_t OC4CE : 1; /*!< [15..15] desc OC4CE                                                       */
          __IOM uint32_t OC3MH : 1; /*!< [16..16] desc OC3MH                                                       */
          __IM uint32_t : 7;
          __IOM uint32_t OC4MH : 1; /*!< [24..24] desc OC4MH                                                       */
        } CCMR2CMP_f;
      };
    };

    union
    {
      __IOM uint32_t CCER; /*!< (@ 0x00000020) capture compare enable register                            */

      struct
      {
        __IOM uint32_t CC1E : 1;  /*!< [0..0] desc CC1E                                                          */
        __IOM uint32_t CC1P : 1;  /*!< [1..1] desc CC1P                                                          */
        __IOM uint32_t CC1NE : 1; /*!< [2..2] desc CC1NE                                                         */
        __IOM uint32_t CC1NP : 1; /*!< [3..3] desc CC1NP                                                         */
        __IOM uint32_t CC2E : 1;  /*!< [4..4] desc CC2E                                                          */
        __IOM uint32_t CC2P : 1;  /*!< [5..5] desc CC2P                                                          */
        __IOM uint32_t CC2NE : 1; /*!< [6..6] desc CC2NE                                                         */
        __IOM uint32_t CC2NP : 1; /*!< [7..7] desc CC2NP                                                         */
        __IOM uint32_t CC3E : 1;  /*!< [8..8] desc CC3E                                                          */
        __IOM uint32_t CC3P : 1;  /*!< [9..9] desc CC3P                                                          */
        __IOM uint32_t CC3NE : 1; /*!< [10..10] desc CC3NE                                                       */
        __IOM uint32_t CC3NP : 1; /*!< [11..11] desc CC3NP                                                       */
        __IOM uint32_t CC4E : 1;  /*!< [12..12] desc CC4E                                                        */
        __IOM uint32_t CC4P : 1;  /*!< [13..13] desc CC4P                                                        */
        __IOM uint32_t CC4NE : 1; /*!< [14..14] desc CC4NE                                                       */
        __IOM uint32_t CC4NP : 1; /*!< [15..15] desc CC4NP                                                       */
        __IOM uint32_t CC5E : 1;  /*!< [16..16] desc CC5E                                                        */
        __IOM uint32_t CC5P : 1;  /*!< [17..17] desc CC5P                                                        */
        __IOM uint32_t CC5NE : 1; /*!< [18..18] desc CC5NE                                                       */
        __IOM uint32_t CC5NP : 1; /*!< [19..19] desc CC5NP                                                       */
        __IOM uint32_t CC6E : 1;  /*!< [20..20] desc CC6E                                                        */
        __IOM uint32_t CC6P : 1;  /*!< [21..21] desc CC6P                                                        */
        __IOM uint32_t CC6NE : 1; /*!< [22..22] desc CC6NE                                                       */
        __IOM uint32_t CC6NP : 1; /*!< [23..23] desc CC6NP                                                       */
      } CCER_f;
    };

    union
    {
      __IOM uint32_t CNT; /*!< (@ 0x00000024) Counter Register                                           */

      struct
      {
        __IOM uint32_t CNT : 16; /*!< [15..0] desc CNT                                                          */
        __IM uint32_t : 15;
        __IM uint32_t UIFCPY : 1; /*!< [31..31] desc UIFCPY                                                      */
      } CNT_f;
    };

    union
    {
      __IOM uint32_t PSC; /*!< (@ 0x00000028) prescaler Register                                         */

      struct
      {
        __IOM uint32_t PSC : 16; /*!< [15..0] desc PSC                                                          */
      } PSC_f;
    };

    union
    {
      __IOM uint32_t ARR; /*!< (@ 0x0000002C) Auto reload Register                                       */

      struct
      {
        __IOM uint32_t ARR : 16; /*!< [15..0] desc ARR                                                          */
      } ARR_f;
    };

    union
    {
      __IOM uint32_t RCR; /*!< (@ 0x00000030) Repetition Counter Register                                */

      struct
      {
        __IOM uint32_t REP : 16; /*!< [15..0] desc REP                                                          */
      } RCR_f;
    };

    union
    {
      __IOM uint32_t CCR1; /*!< (@ 0x00000034) capture compare register1                                  */

      struct
      {
        __IOM uint32_t CCR1 : 16; /*!< [15..0] desc CCR1                                                         */
      } CCR1_f;
    };

    union
    {
      __IOM uint32_t CCR2; /*!< (@ 0x00000038) capture compare register2                                  */

      struct
      {
        __IOM uint32_t CCR2 : 16; /*!< [15..0] desc CCR2                                                         */
      } CCR2_f;
    };

    union
    {
      __IOM uint32_t CCR3; /*!< (@ 0x0000003C) capture compare register3                                  */

      struct
      {
        __IOM uint32_t CCR3 : 16; /*!< [15..0] desc CCR3                                                         */
      } CCR3_f;
    };

    union
    {
      __IOM uint32_t CCR4; /*!< (@ 0x00000040) capture compare register4                                  */

      struct
      {
        __IOM uint32_t CCR4 : 16; /*!< [15..0] desc CCR4                                                         */
      } CCR4_f;
    };

    union
    {
      __IOM uint32_t BDTR; /*!< (@ 0x00000044) break and dead-time register                               */

      struct
      {
        __IOM uint32_t DTG : 8;  /*!< [7..0] desc DTG                                                           */
        __IOM uint32_t LOCK : 2; /*!< [9..8] desc LOCK                                                          */
        __IOM uint32_t OSSI : 1; /*!< [10..10] desc OSSI                                                        */
        __IOM uint32_t OSSR : 1; /*!< [11..11] desc OSSR                                                        */
        __IOM uint32_t BKE : 1;  /*!< [12..12] desc BKE                                                         */
        __IOM uint32_t BKP : 1;  /*!< [13..13] desc BKP                                                         */
        __IOM uint32_t AOE : 1;  /*!< [14..14] desc AOE                                                         */
        __IOM uint32_t MOE : 1;  /*!< [15..15] desc MOE                                                         */
        __IOM uint32_t BKF : 4;  /*!< [19..16] desc BKF                                                         */
        __IOM uint32_t BK2F : 4; /*!< [23..20] desc BK2F                                                        */
        __IOM uint32_t BK2E : 1; /*!< [24..24] desc BK2E                                                        */
        __IOM uint32_t BK2P : 1; /*!< [25..25] desc BK2P                                                        */
      } BDTR_f;
    };

    union
    {
      __IOM uint32_t CCR5; /*!< (@ 0x00000048) capture compare register5                                  */

