zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
      struct
      {
        __IOM uint32_t CCR5 : 16; /*!< [15..0] desc CCR5                                                         */
        __IM uint32_t : 10;
        __IOM uint32_t GC5C1 : 1; /*!< [26..26] desc GC5C1                                                       */
        __IOM uint32_t GC5C2 : 1; /*!< [27..27] desc GC5C2                                                       */
        __IOM uint32_t GC5C3 : 1; /*!< [28..28] desc GC5C3                                                       */
        __IOM uint32_t GC5C4 : 1; /*!< [29..29] desc GC5C4                                                       */
        __IOM uint32_t GC5C5 : 1; /*!< [30..30] desc GC5C5                                                       */
        __IOM uint32_t GC5C6 : 1; /*!< [31..31] desc GC5C6                                                       */
      } CCR5_f;
    };

    union
    {
      __IOM uint32_t CCR6; /*!< (@ 0x0000004C) capture compare register6                                  */

      struct
      {
        __IOM uint32_t CCR6 : 16; /*!< [15..0] desc CCR6                                                         */
        __IM uint32_t : 10;
        __IOM uint32_t GC6C1 : 1; /*!< [26..26] desc GC6C1                                                       */
        __IOM uint32_t GC6C2 : 1; /*!< [27..27] desc GC6C2                                                       */
        __IOM uint32_t GC6C3 : 1; /*!< [28..28] desc GC6C3                                                       */
        __IOM uint32_t GC6C4 : 1; /*!< [29..29] desc GC6C4                                                       */
        __IOM uint32_t GC6C5 : 1; /*!< [30..30] desc GC6C5                                                       */
        __IOM uint32_t GC6C6 : 1; /*!< [31..31] desc GC6C6                                                       */
      } CCR6_f;
    };

    union
    {
      union
      {
        __IOM uint32_t CCMR3CAP; /*!< (@ 0x00000050) capture compare mode register 3                            */

        struct
        {
          __IOM uint32_t CC5S : 2;   /*!< [1..0] desc CC5S                                                          */
          __IOM uint32_t IC5PSC : 2; /*!< [3..2] desc IC5PSC                                                        */
          __IOM uint32_t IC5F : 4;   /*!< [7..4] desc IC5F                                                          */
          __IOM uint32_t CC6S : 2;   /*!< [9..8] desc CC6S                                                          */
          __IOM uint32_t IC6PSC : 2; /*!< [11..10] desc IC6PSC                                                      */
          __IOM uint32_t IC6F : 4;   /*!< [15..12] desc IC6F                                                        */
        } CCMR3CAP_f;
      };

      union
      {
        __IOM uint32_t CCMR3CMP; /*!< (@ 0x00000050) capture compare mode register 3                            */

        struct
        {
          __IOM uint32_t CC5S : 2;  /*!< [1..0] desc CC5S                                                          */
          __IOM uint32_t OC5FE : 1; /*!< [2..2] desc OC5FE                                                         */
          __IOM uint32_t OC5PE : 1; /*!< [3..3] desc OC5PE                                                         */
          __IOM uint32_t OC5M : 3;  /*!< [6..4] desc OC5M                                                          */
          __IOM uint32_t OC5CE : 1; /*!< [7..7] desc OC5CE                                                         */
          __IOM uint32_t CC6S : 2;  /*!< [9..8] desc CC6S                                                          */
          __IOM uint32_t OC6FE : 1; /*!< [10..10] desc OC6FE                                                       */
          __IOM uint32_t OC6PE : 1; /*!< [11..11] desc OC6PE                                                       */
          __IOM uint32_t OC6M : 3;  /*!< [14..12] desc OC6M                                                        */
          __IOM uint32_t OC6CE : 1; /*!< [15..15] desc OC6CE                                                       */
          __IOM uint32_t OC5MH : 1; /*!< [16..16] desc OC5MH                                                       */
          __IM uint32_t : 7;
          __IOM uint32_t OC6MH : 1; /*!< [24..24] desc OC6MH                                                       */
        } CCMR3CMP_f;
      };
    };

    union
    {
      __IOM uint32_t DTR2; /*!< (@ 0x00000054) dead-time register2                                        */

      struct
      {
        __IOM uint32_t DTGF : 8; /*!< [7..0] desc DTGF                                                          */
        __IM uint32_t : 8;
        __IOM uint32_t DTAE : 1; /*!< [16..16] desc DTAE                                                        */
        __IOM uint32_t DTPE : 1; /*!< [17..17] desc DTPE                                                        */
      } DTR2_f;
    };

    union
    {
      __IOM uint32_t ECR; /*!< (@ 0x00000058) Encoder control Register                                   */

      struct
      {
        __IOM uint32_t IE : 1;   /*!< [0..0] desc IE                                                            */
        __IOM uint32_t IDIR : 2; /*!< [2..1] desc IDIR                                                          */
        __IM uint32_t : 2;
        __IOM uint32_t FIDX : 1; /*!< [5..5] desc FIDX                                                          */
        __IOM uint32_t IPOS : 2; /*!< [7..6] desc IPOS                                                          */
      } ECR_f;
    };

    union
    {
      __IOM uint32_t TISEL1; /*!< (@ 0x0000005C) Timer Input Select Register1                               */

      struct
      {
        __IOM uint32_t TI1SEL : 4; /*!< [3..0] desc TI1SEL                                                        */
        __IM uint32_t : 4;
        __IOM uint32_t TI2SEL : 4; /*!< [11..8] desc TI2SEL                                                       */
        __IM uint32_t : 4;
        __IOM uint32_t TI3SEL : 4; /*!< [19..16] desc TI3SEL                                                      */
        __IM uint32_t : 4;
        __IOM uint32_t TI4SEL : 4; /*!< [27..24] desc TI4SEL                                                      */
      } TISEL1_f;
    };

    union
    {
      __IOM uint32_t AF1; /*!< (@ 0x00000060) Alternate function Register1                               */

      struct
      {
        __IOM uint32_t BKINE : 1;  /*!< [0..0] desc BKINE                                                         */
        __IOM uint32_t BKVC1E : 1; /*!< [1..1] desc BKVC1E                                                        */
        __IOM uint32_t BKVC2E : 1; /*!< [2..2] desc BKVC2E                                                        */
        __IM uint32_t : 6;
        __IOM uint32_t BKINP : 1;  /*!< [9..9] desc BKINP                                                         */
        __IOM uint32_t BKVC1P : 1; /*!< [10..10] desc BKVC1P                                                      */
        __IOM uint32_t BKVC2P : 1; /*!< [11..11] desc BKVC2P                                                      */
        __IM uint32_t : 2;
        __IOM uint32_t ETRSEL : 4; /*!< [17..14] desc ETRSEL                                                      */
      } AF1_f;
    };

    union
    {
      __IOM uint32_t AF2; /*!< (@ 0x00000064) Alternate function Register2                               */

      struct
      {
        __IOM uint32_t BK2INE : 1;  /*!< [0..0] desc BK2INE                                                        */
        __IOM uint32_t BK2VC1E : 1; /*!< [1..1] desc BK2VC1E                                                       */
        __IOM uint32_t BK2VC2E : 1; /*!< [2..2] desc BK2VC2E                                                       */
        __IM uint32_t : 6;
        __IOM uint32_t BK2INP : 1;  /*!< [9..9] desc BK2INP                                                        */
        __IOM uint32_t BK2VC1P : 1; /*!< [10..10] desc BK2VC1P                                                     */
        __IOM uint32_t BK2VC2P : 1; /*!< [11..11] desc BK2VC2P                                                     */
        __IM uint32_t : 4;
        __IOM uint32_t OCRSEL : 3; /*!< [18..16] desc OCRSEL                                                      */
      } AF2_f;
    };
    __IM uint32_t RESERVED;

    union
    {
      __IOM uint32_t TISEL2; /*!< (@ 0x0000006C) Timer Input Select Register2                               */

      struct
      {
        __IOM uint32_t TI5SEL : 4; /*!< [3..0] desc TI5SEL                                                        */
        __IM uint32_t : 4;
        __IOM uint32_t TI6SEL : 4; /*!< [11..8] desc TI6SEL                                                       */
      } TISEL2_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000070) Interrupt clean register                                   */

      struct
      {
        __IOM uint32_t UIF : 1;   /*!< [0..0] desc UIF                                                           */
        __IOM uint32_t CC1IF : 1; /*!< [1..1] desc CC1IF                                                         */
        __IOM uint32_t CC2IF : 1; /*!< [2..2] desc CC2IF                                                         */
        __IOM uint32_t CC3IF : 1; /*!< [3..3] desc CC3IF                                                         */
        __IOM uint32_t CC4IF : 1; /*!< [4..4] desc CC4IF                                                         */
        __IOM uint32_t COMIF : 1; /*!< [5..5] desc COMIF                                                         */
        __IOM uint32_t TIF : 1;   /*!< [6..6] desc TIF                                                           */
        __IOM uint32_t BIF : 1;   /*!< [7..7] desc BIF                                                           */
        __IOM uint32_t B2IF : 1;  /*!< [8..8] desc B2IF                                                          */
        __IOM uint32_t CC1OF : 1; /*!< [9..9] desc CC1OF                                                         */
        __IOM uint32_t CC2OF : 1; /*!< [10..10] desc CC2OF                                                       */
        __IOM uint32_t CC3OF : 1; /*!< [11..11] desc CC3OF                                                       */
        __IOM uint32_t CC4OF : 1; /*!< [12..12] desc CC4OF                                                       */
        __IOM uint32_t SBIF : 1;  /*!< [13..13] desc SBIF                                                        */
        __IM uint32_t : 2;
        __IOM uint32_t CC5IF : 1; /*!< [16..16] desc CC5IF                                                       */
        __IOM uint32_t CC6IF : 1; /*!< [17..17] desc CC6IF                                                       */
        __IOM uint32_t CC5OF : 1; /*!< [18..18] desc CC5OF                                                       */
        __IOM uint32_t CC6OF : 1; /*!< [19..19] desc CC6OF                                                       */
        __IOM uint32_t IDXF : 1;  /*!< [20..20] desc IDXF                                                        */
        __IOM uint32_t DIRF : 1;  /*!< [21..21] desc DIRF                                                        */
        __IOM uint32_t IERRF : 1; /*!< [22..22] desc IERRF                                                       */
        __IOM uint32_t TERRF : 1; /*!< [23..23] desc TERRF                                                       */
      } ICR_f;
    };
  } ATIM_TypeDef; /*!< Size = 116 (0x74)                                                         */

  /* =========================================================================================================================== */
  /* ================                                           BTIM1                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief Base Timer 1 (BTIM1)
   */

  typedef struct
  { /*!< (@ 0x40004800) BTIM1 Structure                                            */

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000000) Control register1                                          */

      struct
      {
        __IOM uint32_t EN : 1;      /*!< [0..0] desc EN                                                            */
        __IOM uint32_t UDIS : 1;    /*!< [1..1] desc UDIS                                                          */
        __IOM uint32_t URS : 1;     /*!< [2..2] desc URS                                                           */
        __IOM uint32_t ONESHOT : 1; /*!< [3..3] desc ONESHOT                                                       */
        __IM uint32_t : 7;
        __IOM uint32_t UIFREMAP : 1; /*!< [11..11] desc UIFREMAP                                                    */
        __IM uint32_t : 3;
        __IOM uint32_t TOGEN : 1; /*!< [15..15] desc TOGEN                                                       */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x00000004) Control register2                                          */

      struct
      {
        __IM uint32_t : 4;
        __IOM uint32_t MMS : 3; /*!< [6..4] desc MMS                                                           */
      } CR2_f;
    };

    union
    {
      __IOM uint32_t SMCR; /*!< (@ 0x00000008) Slave Mode Control register                                */

      struct
      {
        __IOM uint32_t SMS : 3;     /*!< [2..0] desc SMS                                                           */
        __IOM uint32_t RSTISRC : 4; /*!< [6..3] desc RSTISRC                                                       */
        __IOM uint32_t TRGISRC : 4; /*!< [10..7] desc TRGISRC                                                      */
        __IOM uint32_t MSM : 1;     /*!< [11..11] desc MSM                                                         */
        __IOM uint32_t TRGIFLT : 3; /*!< [14..12] desc TRGIFLT                                                     */
        __IM uint32_t : 1;
        __IOM uint32_t RSTIPOL : 1; /*!< [16..16] desc RSTIPOL                                                     */
        __IOM uint32_t TRGIPOL : 1; /*!< [17..17] desc TRGIPOL                                                     */
      } SMCR_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x0000000C) Interrupt enable register                                  */

      struct
      {
        __IOM uint32_t UIE : 1; /*!< [0..0] desc UIE                                                           */
        __IM uint32_t : 5;
        __IOM uint32_t TIE : 1; /*!< [6..6] desc TIE                                                           */
      } IER_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000010) Interrupt status register                                  */

      struct
      {
        __IM uint32_t UIF : 1; /*!< [0..0] desc UIF                                                           */
        __IM uint32_t : 5;
        __IM uint32_t TIF : 1; /*!< [6..6] desc TIF                                                           */
      } ISR_f;
    };

    union
    {
      __OM uint32_t EGR; /*!< (@ 0x00000014) Event Generate register                                    */

      struct
      {
        __OM uint32_t UG : 1; /*!< [0..0] desc UG                                                            */
        __IM uint32_t : 5;
        __OM uint32_t TG : 1; /*!< [6..6] desc TG                                                            */
      } EGR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000018) Interrupt flag clear register                              */

      struct
      {
        __IOM uint32_t UIF : 1; /*!< [0..0] desc UIF                                                           */
        __IM uint32_t : 5;
        __IOM uint32_t TIF : 1; /*!< [6..6] desc TIF                                                           */
      } ICR_f;
    };
    __IM uint32_t RESERVED[2];

    union
    {
      __IOM uint32_t CNT; /*!< (@ 0x00000024) Counter Register                                           */

      struct
      {
        __IOM uint32_t CNT : 16; /*!< [15..0] desc CNT                                                          */
        __IM uint32_t : 15;
        __IM uint32_t UIFCPY : 1; /*!< [31..31] desc UIFCPY                                                      */
      } CNT_f;
    };

    union
    {
      __IOM uint32_t PSC; /*!< (@ 0x00000028) Prescaler Control Register                                 */

      struct
      {
        __IOM uint32_t PSC : 16; /*!< [15..0] desc PSC                                                          */
      } PSC_f;
    };

    union
    {
      __IOM uint32_t ARR; /*!< (@ 0x0000002C) Auto Reload Register                                       */

      struct
      {
        __IOM uint32_t ARR : 16; /*!< [15..0] desc ARR                                                          */
      } ARR_f;
    };
  } BTIM_TypeDef; /*!< Size = 48 (0x30)                                                          */

  /* =========================================================================================================================== */
  /* ================                                            CRC                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc CRC (CRC)
   */

  typedef struct
  { /*!< (@ 0x40023000) CRC Structure                                              */

    union
    {
      __IOM uint32_t CR; /*!< (@ 0x00000000) Control register                                           */

      struct
      {
        __IOM uint32_t MODE : 4; /*!< [3..0] desc MODE                                                          */
      } CR_f;
    };
    __IM uint32_t RESERVED;

    union
    {
      __IOM uint32_t DR; /*!< (@ 0x00000008) Data register                                              */

      struct
      {
        __IOM uint32_t DR : 8; /*!< [7..0] desc DR                                                            */
      } DR_f;
    };

    union
    {
      __IM uint32_t RESULT; /*!< (@ 0x0000000C) Result register                                            */

      struct
      {
        __IM uint32_t RESULT : 16; /*!< [15..0] desc RESULT                                                       */
      } RESULT_f;
    };
  } CRC_TypeDef; /*!< Size = 16 (0x10)                                                          */

  /* =========================================================================================================================== */
  /* ================                                           FLASH                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc FLASH (FLASH)
   */

  typedef struct
  { /*!< (@ 0x40022000) FLASH Structure                                            */

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000000) Control register1                                          */

      struct
      {
        __IOM uint32_t MODE : 2; /*!< [1..0] desc MODE                                                          */
        __IM uint32_t : 3;
        __IM uint32_t SECURITY : 2; /*!< [6..5] desc SECURITY                                                      */
        __IM uint32_t : 9;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x00000004) Control register2                                          */

      struct
      {
        __IOM uint32_t WAIT : 3; /*!< [2..0] desc WAIT                                                          */
        __IM uint32_t : 13;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } CR2_f;
    };

    union
    {
      __IOM uint32_t PAGELOCK; /*!< (@ 0x00000008) Page Write Erase Lock                                      */

      struct
      {
        __IOM uint32_t LOCK0 : 1;  /*!< [0..0] Page0 - 7                                                          */
        __IOM uint32_t LOCK1 : 1;  /*!< [1..1] Page8 - 15                                                         */
        __IOM uint32_t LOCK2 : 1;  /*!< [2..2] Page16 - 23                                                        */
        __IOM uint32_t LOCK3 : 1;  /*!< [3..3] Page24 - 31                                                        */
        __IOM uint32_t LOCK4 : 1;  /*!< [4..4] Page32 - 39                                                        */
        __IOM uint32_t LOCK5 : 1;  /*!< [5..5] Page40 - 47                                                        */
        __IOM uint32_t LOCK6 : 1;  /*!< [6..6] Page48 - 55                                                        */
        __IOM uint32_t LOCK7 : 1;  /*!< [7..7] Page56 - 63                                                        */
        __IOM uint32_t LOCK8 : 1;  /*!< [8..8] Page64 - 71                                                        */
        __IOM uint32_t LOCK9 : 1;  /*!< [9..9] Page72 - 79                                                        */
        __IOM uint32_t LOCK10 : 1; /*!< [10..10] Page80 - 87                                                      */
        __IOM uint32_t LOCK11 : 1; /*!< [11..11] Page88 - 95                                                      */
        __IOM uint32_t LOCK12 : 1; /*!< [12..12] Page96 - 103                                                     */
        __IOM uint32_t LOCK13 : 1; /*!< [13..13] Page104 - 111                                                    */
        __IOM uint32_t LOCK14 : 1; /*!< [14..14] Page112 - 119                                                    */
        __IOM uint32_t LOCK15 : 1; /*!< [15..15] Page120 - 127                                                    */
        __OM uint32_t KEY : 16;    /*!< [31..16] desc KEY                                                         */
      } PAGELOCK_f;
    };
    __IM uint32_t RESERVED[5];

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000020) Interrupt enable register                                  */

      struct
      {
        __IOM uint32_t PC : 1;       /*!< [0..0] desc PC                                                            */
        __IOM uint32_t PAGELOCK : 1; /*!< [1..1] desc PAGELOCK                                                      */
        __IOM uint32_t SDKERR : 1;   /*!< [2..2] desc SDKERR                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t PROG : 1; /*!< [4..4] desc PROG                                                          */
      } IER_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000024) Interrupt status register                                  */

