zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
      struct
      {
        __IM uint32_t PC : 1;       /*!< [0..0] desc PC                                                            */
        __IM uint32_t PAGELOCK : 1; /*!< [1..1] desc PAGELOCK                                                      */
        __IM uint32_t SDKERR : 1;   /*!< [2..2] desc SDKERR                                                       */
        __IM uint32_t : 1;
        __IM uint32_t PROG : 1; /*!< [4..4] desc PROG                                                          */
        __IM uint32_t BUSY : 1; /*!< [5..5] desc BUSY                                                          */
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000028) Interrupt flag clear register                              */

      struct
      {
        __IOM uint32_t PC : 1;       /*!< [0..0] desc PC                                                            */
        __IOM uint32_t PAGELOCK : 1; /*!< [1..1] desc PAGELOCK                                                      */
        __IOM uint32_t SDKERR : 1;   /*!< [2..2] desc SDKERR                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t PROG : 1; /*!< [4..4] desc PROG                                                          */
      } ICR_f;
    };
    __IM uint32_t RESERVED1[17];

    union
    {
      __IM uint32_t SDKCFR; /*!< (@ 0x00000070) SDK config register                                        */

      struct
      {
        __IM uint32_t START : 7; /*!< [6..0] desc START                                                         */
        __IM uint32_t : 1;
        __IM uint32_t END : 7; /*!< [14..8] desc END                                                          */
      } SDKCFR_f;
    };
  } FLASH_TypeDef; /*!< Size = 116 (0x74)                                                         */

  /* =========================================================================================================================== */
  /* ================                                           GPIOA                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc GPIOA (GPIOA)
   */

  typedef struct
  { /*!< (@ 0x48000000) GPIOA Structure                                            */

    union
    {
      __IOM uint32_t DIR; /*!< (@ 0x00000000) desc DIR                                                   */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
      } DIR_f;
    };

    union
    {
      __IOM uint32_t OPENDRAIN; /*!< (@ 0x00000004) desc OPENDRAIN                                             */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
      } OPENDRAIN_f;
    };
    __IM uint32_t RESERVED[2];

    union
    {
      __IOM uint32_t PUR; /*!< (@ 0x00000010) desc PUR                                                   */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
      } PUR_f;
    };

    union
    {
      __IOM uint32_t AFRH; /*!< (@ 0x00000014) desc AFRH                                                  */

      struct
      {
        __IOM uint32_t AFR8 : 3; /*!< [2..0] desc AFR8                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t AFR9 : 3; /*!< [6..4] desc AFR9                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t AFR10 : 3; /*!< [10..8] desc AFR10                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t AFR11 : 3; /*!< [14..12] desc AFR11                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t AFR12 : 3; /*!< [18..16] desc AFR12                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t AFR13 : 3; /*!< [22..20] desc AFR13                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t AFR14 : 3; /*!< [26..24] desc AFR14                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t AFR15 : 3; /*!< [30..28] desc AFR15                                                       */
      } AFRH_f;
    };

    union
    {
      __IOM uint32_t AFRL; /*!< (@ 0x00000018) desc AFRL                                                  */

      struct
      {
        __IOM uint32_t AFR0 : 3; /*!< [2..0] desc AFR0                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t AFR1 : 3; /*!< [6..4] desc AFR1                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t AFR2 : 3; /*!< [10..8] desc AFR2                                                         */
        __IM uint32_t : 1;
        __IOM uint32_t AFR3 : 3; /*!< [14..12] desc AFR3                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t AFR4 : 3; /*!< [18..16] desc AFR4                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t AFR5 : 3; /*!< [22..20] desc AFR5                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t AFR6 : 3; /*!< [26..24] desc AFR6                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t AFR7 : 3; /*!< [30..28] desc AFR7                                                        */
      } AFRL_f;
    };

    union
    {
      __IOM uint32_t ANALOG; /*!< (@ 0x0000001C) desc ANALOG                                                */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
      } ANALOG_f;
    };
    __IM uint32_t RESERVED1;

    union
    {
      __IOM uint32_t RISEIE; /*!< (@ 0x00000024) Interrupt enable register                                  */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
      } RISEIE_f;
    };

    union
    {
      __IOM uint32_t FALLIE; /*!< (@ 0x00000028) Interrupt enable register                                  */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
      } FALLIE_f;
    };
    __IM uint32_t RESERVED2[2];

    union
    {
      __IOM uint32_t ISR; /*!< (@ 0x00000034) Interrupt status register                                  */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000038) Interrupt flag clear register                              */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
      } ICR_f;
    };
    __IM uint32_t RESERVED3;

    union
    {
      __IOM uint32_t FILTER; /*!< (@ 0x00000040) desc FILTER                                                */

      struct
      {
        __IOM uint32_t PIN0 : 1;   /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;   /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;   /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;   /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;   /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;   /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;   /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;   /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;   /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;   /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1;  /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1;  /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1;  /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1;  /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1;  /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1;  /*!< [15..15] desc PIN15                                                       */
        __IOM uint32_t FLTCLK : 3; /*!< [18..16] desc FLTCLK                                                      */
      } FILTER_f;
    };
    __IM uint32_t RESERVED4[3];

    union
    {
      __IOM uint32_t IDR; /*!< (@ 0x00000050) desc IDR                                                   */

