zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
      } IDR_f;
    };

    union
    {
      __IOM uint32_t ODR; /*!< (@ 0x00000054) desc ODR                                                   */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
      } ODR_f;
    };

    union
    {
      __IOM uint32_t BRR; /*!< (@ 0x00000058) desc BRR                                                   */

      struct
      {
        __IOM uint32_t BRR0 : 1;  /*!< [0..0] desc BRR0                                                          */
        __IOM uint32_t BRR1 : 1;  /*!< [1..1] desc BRR1                                                          */
        __IOM uint32_t BRR2 : 1;  /*!< [2..2] desc BRR2                                                          */
        __IOM uint32_t BRR3 : 1;  /*!< [3..3] desc BRR3                                                          */
        __IOM uint32_t BRR4 : 1;  /*!< [4..4] desc BRR4                                                          */
        __IOM uint32_t BRR5 : 1;  /*!< [5..5] desc BRR5                                                          */
        __IOM uint32_t BRR6 : 1;  /*!< [6..6] desc BRR6                                                          */
        __IOM uint32_t BRR7 : 1;  /*!< [7..7] desc BRR7                                                          */
        __IOM uint32_t BRR8 : 1;  /*!< [8..8] desc BRR8                                                          */
        __IOM uint32_t BRR9 : 1;  /*!< [9..9] desc BRR9                                                          */
        __IOM uint32_t BRR10 : 1; /*!< [10..10] desc BRR10                                                       */
        __IOM uint32_t BRR11 : 1; /*!< [11..11] desc BRR11                                                       */
        __IOM uint32_t BRR12 : 1; /*!< [12..12] desc BRR12                                                       */
        __IOM uint32_t BRR13 : 1; /*!< [13..13] desc BRR13                                                       */
        __IOM uint32_t BRR14 : 1; /*!< [14..14] desc BRR14                                                       */
        __IOM uint32_t BRR15 : 1; /*!< [15..15] desc BRR15                                                       */
      } BRR_f;
    };

    union
    {
      __IOM uint32_t BSRR; /*!< (@ 0x0000005C) desc BSRR                                                  */

      struct
      {
        __IOM uint32_t BSS0 : 1;  /*!< [0..0] desc BSS0                                                          */
        __IOM uint32_t BSS1 : 1;  /*!< [1..1] desc BSS1                                                          */
        __IOM uint32_t BSS2 : 1;  /*!< [2..2] desc BSS2                                                          */
        __IOM uint32_t BSS3 : 1;  /*!< [3..3] desc BSS3                                                          */
        __IOM uint32_t BSS4 : 1;  /*!< [4..4] desc BSS4                                                          */
        __IOM uint32_t BSS5 : 1;  /*!< [5..5] desc BSS5                                                          */
        __IOM uint32_t BSS6 : 1;  /*!< [6..6] desc BSS6                                                          */
        __IOM uint32_t BSS7 : 1;  /*!< [7..7] desc BSS7                                                          */
        __IOM uint32_t BSS8 : 1;  /*!< [8..8] desc BSS8                                                          */
        __IOM uint32_t BSS9 : 1;  /*!< [9..9] desc BSS9                                                          */
        __IOM uint32_t BSS10 : 1; /*!< [10..10] desc BSS10                                                       */
        __IOM uint32_t BSS11 : 1; /*!< [11..11] desc BSS11                                                       */
        __IOM uint32_t BSS12 : 1; /*!< [12..12] desc BSS12                                                       */
        __IOM uint32_t BSS13 : 1; /*!< [13..13] desc BSS13                                                       */
        __IOM uint32_t BSS14 : 1; /*!< [14..14] desc BSS14                                                       */
        __IOM uint32_t BSS15 : 1; /*!< [15..15] desc BSS15                                                       */
        __IOM uint32_t BRR0 : 1;  /*!< [16..16] desc BRR0                                                        */
        __IOM uint32_t BRR1 : 1;  /*!< [17..17] desc BRR1                                                        */
        __IOM uint32_t BRR2 : 1;  /*!< [18..18] desc BRR2                                                        */
        __IOM uint32_t BRR3 : 1;  /*!< [19..19] desc BRR3                                                        */
        __IOM uint32_t BRR4 : 1;  /*!< [20..20] desc BRR4                                                        */
        __IOM uint32_t BRR5 : 1;  /*!< [21..21] desc BRR5                                                        */
        __IOM uint32_t BRR6 : 1;  /*!< [22..22] desc BRR6                                                        */
        __IOM uint32_t BRR7 : 1;  /*!< [23..23] desc BRR7                                                        */
        __IOM uint32_t BRR8 : 1;  /*!< [24..24] desc BRR8                                                        */
        __IOM uint32_t BRR9 : 1;  /*!< [25..25] desc BRR9                                                        */
        __IOM uint32_t BRR10 : 1; /*!< [26..26] desc BRR10                                                       */
        __IOM uint32_t BRR11 : 1; /*!< [27..27] desc BRR11                                                       */
        __IOM uint32_t BRR12 : 1; /*!< [28..28] desc BRR12                                                       */
        __IOM uint32_t BRR13 : 1; /*!< [29..29] desc BRR13                                                       */
        __IOM uint32_t BRR14 : 1; /*!< [30..30] desc BRR14                                                       */
        __IOM uint32_t BRR15 : 1; /*!< [31..31] desc BRR15                                                       */
      } BSRR_f;
    };

    union
    {
      __IOM uint32_t TOG; /*!< (@ 0x00000060) desc TOG                                                   */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
      } TOG_f;
    };
  } GPIO_TypeDef; /*!< Size = 100 (0x64)                                                         */

  /* =========================================================================================================================== */
  /* ================                                           GTIM1                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief General Timer 1 (GTIM1)
   */

  typedef struct
  { /*!< (@ 0x40001800) GTIM1 Structure                                            */

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000000) Control register1                                          */

      struct
      {
        __IOM uint32_t CEN : 1;  /*!< [0..0] desc CEN                                                           */
        __IOM uint32_t UDIS : 1; /*!< [1..1] desc UDIS                                                          */
        __IOM uint32_t URS : 1;  /*!< [2..2] desc URS                                                           */
        __IOM uint32_t OPM : 1;  /*!< [3..3] desc OPM                                                           */
        __IOM uint32_t DIR : 1;  /*!< [4..4] desc DIR                                                           */
        __IOM uint32_t CMS : 2;  /*!< [6..5] desc CMS                                                           */
        __IOM uint32_t ARPE : 1; /*!< [7..7] desc ARPE                                                          */
        __IOM uint32_t CKD : 2;  /*!< [9..8] desc CKD                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t UIFREMAP : 1; /*!< [11..11] desc UIFREMAP                                                    */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x00000004) Control register2                                          */

      struct
      {
        __IM uint32_t : 4;
        __IOM uint32_t MMS : 3;  /*!< [6..4] desc MMS                                                           */
        __IOM uint32_t TI1S : 1; /*!< [7..7] desc TI1S                                                          */
        __IM uint32_t : 17;
        __IOM uint32_t MMSH : 2; /*!< [26..25] desc MMSH                                                        */
      } CR2_f;
    };

    union
    {
      __IOM uint32_t SMCR; /*!< (@ 0x00000008) Slave Mode control register                                */

      struct
      {
        __IOM uint32_t SMS : 3;  /*!< [2..0] desc SMS                                                           */
        __IOM uint32_t OCCS : 1; /*!< [3..3] desc OCCS                                                          */
        __IOM uint32_t TS : 3;   /*!< [6..4] desc TS                                                            */
        __IOM uint32_t MSM : 1;  /*!< [7..7] desc MSM                                                           */
        __IOM uint32_t ETF : 4;  /*!< [11..8] desc ETF                                                          */
        __IOM uint32_t ETPS : 2; /*!< [13..12] desc ETPS                                                        */
        __IOM uint32_t ECE : 1;  /*!< [14..14] desc ECE                                                         */
        __IOM uint32_t ETP : 1;  /*!< [15..15] desc ETP                                                         */
        __IOM uint32_t SMSH : 1; /*!< [16..16] desc SMSH                                                        */
        __IM uint32_t : 3;
        __IOM uint32_t TSH : 2; /*!< [21..20] desc TSH                                                         */
        __IM uint32_t : 2;
        __IOM uint32_t SMSPE : 1; /*!< [24..24] desc SMSPE                                                       */
        __IOM uint32_t SMSPS : 1; /*!< [25..25] desc SMSPS                                                       */
      } SMCR_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x0000000C) Interrupt control register                                 */

      struct
      {
        __IOM uint32_t UIE : 1;   /*!< [0..0] desc UIE                                                           */
        __IOM uint32_t CC1IE : 1; /*!< [1..1] desc CC1IE                                                         */
        __IOM uint32_t CC2IE : 1; /*!< [2..2] desc CC2IE                                                         */
        __IOM uint32_t CC3IE : 1; /*!< [3..3] desc CC3IE                                                         */
        __IOM uint32_t CC4IE : 1; /*!< [4..4] desc CC4IE                                                         */
        __IM uint32_t : 1;
        __IOM uint32_t TIE : 1; /*!< [6..6] desc TIE                                                           */
        __IM uint32_t : 13;
        __IOM uint32_t IDXIE : 1;  /*!< [20..20] desc IDXIE                                                       */
        __IOM uint32_t DIRIE : 1;  /*!< [21..21] desc DIRIE                                                       */
        __IOM uint32_t IERRIE : 1; /*!< [22..22] desc IERRIE                                                      */
        __IOM uint32_t TERRIE : 1; /*!< [23..23] desc TERRIE                                                      */
      } IER_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000010) Interrupt status register                                  */

      struct
      {
        __IM uint32_t UIF : 1;   /*!< [0..0] desc UIF                                                           */
        __IM uint32_t CC1IF : 1; /*!< [1..1] desc CC1IF                                                         */
        __IM uint32_t CC2IF : 1; /*!< [2..2] desc CC2IF                                                         */
        __IM uint32_t CC3IF : 1; /*!< [3..3] desc CC3IF                                                         */
        __IM uint32_t CC4IF : 1; /*!< [4..4] desc CC4IF                                                         */
        __IM uint32_t : 1;
        __IM uint32_t TIF : 1; /*!< [6..6] desc TIF                                                           */
        __IM uint32_t : 2;
        __IM uint32_t CC1OF : 1; /*!< [9..9] desc CC1OF                                                         */
        __IM uint32_t CC2OF : 1; /*!< [10..10] desc CC2OF                                                       */
        __IM uint32_t CC3OF : 1; /*!< [11..11] desc CC3OF                                                       */
        __IM uint32_t CC4OF : 1; /*!< [12..12] desc CC4OF                                                       */
        __IM uint32_t : 7;
        __IM uint32_t IDXF : 1;  /*!< [20..20] desc IDXF                                                        */
        __IM uint32_t DIRF : 1;  /*!< [21..21] desc DIRF                                                        */
        __IM uint32_t IERRF : 1; /*!< [22..22] desc IERRF                                                       */
        __IM uint32_t TERRF : 1; /*!< [23..23] desc TERRF                                                       */
      } ISR_f;
    };

    union
    {
      __IOM uint32_t EGR; /*!< (@ 0x00000014) Event Generate register                                    */

      struct
      {
        __IOM uint32_t UG : 1;   /*!< [0..0] desc UG                                                            */
        __IOM uint32_t CC1G : 1; /*!< [1..1] desc CC1G                                                          */
        __IOM uint32_t CC2G : 1; /*!< [2..2] desc CC2G                                                          */
        __IOM uint32_t CC3G : 1; /*!< [3..3] desc CC3G                                                          */
        __IOM uint32_t CC4G : 1; /*!< [4..4] desc CC4G                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t TG : 1; /*!< [6..6] desc TG                                                            */
      } EGR_f;
    };

    union
    {
      union
      {
        __IOM uint32_t CCMR1CAP; /*!< (@ 0x00000018) Capture control Register1                                  */

        struct
        {
          __IOM uint32_t CC1S : 2;   /*!< [1..0] desc CC1S                                                          */
          __IOM uint32_t IC1PSC : 2; /*!< [3..2] desc IC1PSC                                                        */
          __IOM uint32_t IC1F : 4;   /*!< [7..4] desc IC1F                                                          */
          __IOM uint32_t CC2S : 2;   /*!< [9..8] desc CC2S                                                          */
          __IOM uint32_t IC2PSC : 2; /*!< [11..10] desc IC2PSC                                                      */
          __IOM uint32_t IC2F : 4;   /*!< [15..12] desc IC2F                                                        */
        } CCMR1CAP_f;
      };

      union
      {
        __IOM uint32_t CCMR1CMP; /*!< (@ 0x00000018) Compare control Register1                                  */

        struct
        {
          __IOM uint32_t CC1S : 2;  /*!< [1..0] desc CC1S                                                          */
          __IOM uint32_t OC1FE : 1; /*!< [2..2] desc OC1FE                                                         */
          __IOM uint32_t OC1PE : 1; /*!< [3..3] desc OC1PE                                                         */
          __IOM uint32_t OC1M : 3;  /*!< [6..4] desc OC1M                                                          */
          __IOM uint32_t OC1CE : 1; /*!< [7..7] desc OC1CE                                                         */
          __IOM uint32_t CC2S : 2;  /*!< [9..8] desc CC2S                                                          */
          __IOM uint32_t OC2FE : 1; /*!< [10..10] desc OC2FE                                                       */
          __IOM uint32_t OC2PE : 1; /*!< [11..11] desc OC2PE                                                       */
          __IOM uint32_t OC2M : 3;  /*!< [14..12] desc OC2M                                                        */
          __IOM uint32_t OC2CE : 1; /*!< [15..15] desc OC2CE                                                       */
          __IOM uint32_t OC1MH : 1; /*!< [16..16] desc OC1MH                                                       */
          __IM uint32_t : 7;
          __IOM uint32_t OC2MH : 1; /*!< [24..24] desc OC2MH                                                       */
        } CCMR1CMP_f;
      };
    };

    union
    {
      union
      {
        __IOM uint32_t CCMR2CAP; /*!< (@ 0x0000001C) Capture control Register2                                  */

        struct
        {
          __IOM uint32_t CC3S : 2;   /*!< [1..0] desc CC3S                                                          */
          __IOM uint32_t IC3PSC : 2; /*!< [3..2] desc IC3PSC                                                        */
          __IOM uint32_t IC3F : 4;   /*!< [7..4] desc IC3F                                                          */
          __IOM uint32_t CC4S : 2;   /*!< [9..8] desc CC4S                                                          */
          __IOM uint32_t IC4PSC : 2; /*!< [11..10] desc IC4PSC                                                      */
          __IOM uint32_t IC4F : 4;   /*!< [15..12] desc IC4F                                                        */
        } CCMR2CAP_f;
      };

      union
      {
        __IOM uint32_t CCMR2CMP; /*!< (@ 0x0000001C) Compare control Register2                                  */

