zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
        struct
        {
          __IOM uint32_t CC3S : 2;  /*!< [1..0] desc CC3S                                                          */
          __IOM uint32_t OC3FE : 1; /*!< [2..2] desc OC3FE                                                         */
          __IOM uint32_t OC3PE : 1; /*!< [3..3] desc OC3PE                                                         */
          __IOM uint32_t OC3M : 3;  /*!< [6..4] desc OC3M                                                          */
          __IOM uint32_t OC3CE : 1; /*!< [7..7] desc OC3CE                                                         */
          __IOM uint32_t CC4S : 2;  /*!< [9..8] desc CC4S                                                          */
          __IOM uint32_t OC4FE : 1; /*!< [10..10] desc OC4FE                                                       */
          __IOM uint32_t OC4PE : 1; /*!< [11..11] desc OC4PE                                                       */
          __IOM uint32_t OC4M : 3;  /*!< [14..12] desc OC4M                                                        */
          __IOM uint32_t OC4CE : 1; /*!< [15..15] desc OC4CE                                                       */
          __IOM uint32_t OC3MH : 1; /*!< [16..16] desc OC3MH                                                       */
          __IM uint32_t : 7;
          __IOM uint32_t OC4MH : 1; /*!< [24..24] desc OC4MH                                                       */
        } CCMR2CMP_f;
      };
    };

    union
    {
      __IOM uint32_t CCER; /*!< (@ 0x00000020) Capture compare Enable Register                            */

      struct
      {
        __IOM uint32_t CC1E : 1; /*!< [0..0] desc CC1E                                                          */
        __IOM uint32_t CC1P : 1; /*!< [1..1] desc CC1P                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t CC1NP : 1; /*!< [3..3] desc CC1NP                                                         */
        __IOM uint32_t CC2E : 1;  /*!< [4..4] desc CC2E                                                          */
        __IOM uint32_t CC2P : 1;  /*!< [5..5] desc CC2P                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t CC2NP : 1; /*!< [7..7] desc CC2NP                                                         */
        __IOM uint32_t CC3E : 1;  /*!< [8..8] desc CC3E                                                          */
        __IOM uint32_t CC3P : 1;  /*!< [9..9] desc CC3P                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t CC3NP : 1; /*!< [11..11] desc CC3NP                                                       */
        __IOM uint32_t CC4E : 1;  /*!< [12..12] desc CC4E                                                        */
        __IOM uint32_t CC4P : 1;  /*!< [13..13] desc CC4P                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t CC4NP : 1; /*!< [15..15] desc CC4NP                                                       */
      } CCER_f;
    };

    union
    {
      __IOM uint32_t CNT; /*!< (@ 0x00000024) Counter Register                                           */

      struct
      {
        __IOM uint32_t CNT : 16; /*!< [15..0] desc CNT                                                          */
        __IM uint32_t : 15;
        __IM uint32_t UIFCPY : 1; /*!< [31..31] desc UIFCPY                                                      */
      } CNT_f;
    };

    union
    {
      __IOM uint32_t PSC; /*!< (@ 0x00000028) Prescaler Control Register                                 */

      struct
      {
        __IOM uint32_t PSC : 16; /*!< [15..0] desc PSC                                                          */
      } PSC_f;
    };

    union
    {
      __IOM uint32_t ARR; /*!< (@ 0x0000002C) Auto Reload Register                                       */

      struct
      {
        __IOM uint32_t ARR : 16; /*!< [15..0] desc ARR                                                          */
      } ARR_f;
    };
    __IM uint32_t RESERVED;

    union
    {
      __IOM uint32_t CCR1; /*!< (@ 0x00000034) Capture control Register1                                  */

      struct
      {
        __IOM uint32_t CCR1 : 16; /*!< [15..0] desc CCR1                                                         */
      } CCR1_f;
    };

    union
    {
      __IOM uint32_t CCR2; /*!< (@ 0x00000038) Capture control Register2                                  */

      struct
      {
        __IOM uint32_t CCR2 : 16; /*!< [15..0] desc CCR2                                                         */
      } CCR2_f;
    };

    union
    {
      __IOM uint32_t CCR3; /*!< (@ 0x0000003C) Capture control Register3                                  */

      struct
      {
        __IOM uint32_t CCR3 : 16; /*!< [15..0] desc CCR3                                                         */
      } CCR3_f;
    };

    union
    {
      __IOM uint32_t CCR4; /*!< (@ 0x00000040) Capture control Register4                                  */

      struct
      {
        __IOM uint32_t CCR4 : 16; /*!< [15..0] desc CCR4                                                         */
      } CCR4_f;
    };
    __IM uint32_t RESERVED1[5];

    union
    {
      __IOM uint32_t ECR; /*!< (@ 0x00000058) Encoder control Register                                   */

      struct
      {
        __IOM uint32_t IE : 1;   /*!< [0..0] desc IE                                                            */
        __IOM uint32_t IDIR : 2; /*!< [2..1] desc IDIR                                                          */
        __IM uint32_t : 2;
        __IOM uint32_t FIDX : 1; /*!< [5..5] desc FIDX                                                          */
        __IOM uint32_t IPOS : 2; /*!< [7..6] desc IPOS                                                          */
      } ECR_f;
    };

    union
    {
      __IOM uint32_t TISEL; /*!< (@ 0x0000005C) Timer Input Select Register                                */

      struct
      {
        __IOM uint32_t TI1SEL : 4; /*!< [3..0] desc TI1SEL                                                        */
        __IM uint32_t : 4;
        __IOM uint32_t TI2SEL : 4; /*!< [11..8] desc TI2SEL                                                       */
        __IM uint32_t : 4;
        __IOM uint32_t TI3SEL : 4; /*!< [19..16] desc TI3SEL                                                      */
        __IM uint32_t : 4;
        __IOM uint32_t TI4SEL : 4; /*!< [27..24] desc TI4SEL                                                      */
      } TISEL_f;
    };

    union
    {
      __IOM uint32_t AF1; /*!< (@ 0x00000060) Alternate function Register1                               */

      struct
      {
        __IM uint32_t : 14;
        __IOM uint32_t ETRSEL : 4; /*!< [17..14] desc ETRSEL                                                      */
      } AF1_f;
    };

    union
    {
      __IOM uint32_t AF2; /*!< (@ 0x00000064) Alternate function Register2                               */

      struct
      {
        __IM uint32_t : 16;
        __IOM uint32_t OCRSEL : 3; /*!< [18..16] desc OCRSEL                                                      */
      } AF2_f;
    };
    __IM uint32_t RESERVED2[2];

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000070) Interrupt flag clear register                              */

      struct
      {
        __IOM uint32_t UIF : 1;   /*!< [0..0] desc UIF                                                           */
        __IOM uint32_t CC1IF : 1; /*!< [1..1] desc CC1IF                                                         */
        __IOM uint32_t CC2IF : 1; /*!< [2..2] desc CC2IF                                                         */
        __IOM uint32_t CC3IF : 1; /*!< [3..3] desc CC3IF                                                         */
        __IOM uint32_t CC4IF : 1; /*!< [4..4] desc CC4IF                                                         */
        __IM uint32_t : 1;
        __IOM uint32_t TIF : 1; /*!< [6..6] desc TIF                                                           */
        __IM uint32_t : 2;
        __IOM uint32_t CC1OF : 1; /*!< [9..9] desc CC1OF                                                         */
        __IOM uint32_t CC2OF : 1; /*!< [10..10] desc CC2OF                                                       */
        __IOM uint32_t CC3OF : 1; /*!< [11..11] desc CC3OF                                                       */
        __IOM uint32_t CC4OF : 1; /*!< [12..12] desc CC4OF                                                       */
        __IM uint32_t : 7;
        __IOM uint32_t IDXF : 1;  /*!< [20..20] desc IDXF                                                        */
        __IOM uint32_t DIRF : 1;  /*!< [21..21] desc DIRF                                                        */
        __IOM uint32_t IERRF : 1; /*!< [22..22] desc IERRF                                                       */
        __IOM uint32_t TERRF : 1; /*!< [23..23] desc TERRF                                                       */
      } ICR_f;
    };
  } GTIM_TypeDef; /*!< Size = 116 (0x74)                                                         */

  /* =========================================================================================================================== */
  /* ================                                           I2C                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc I2C (I2C)
   */

  typedef struct
  { /*!< (@ 0x40005400) I2C Structure                                             */

    union
    {
      __IOM uint32_t BRREN; /*!< (@ 0x00000000) desc BRREN                                                 */

      struct
      {
        __IOM uint32_t EN : 1; /*!< [0..0] desc EN                                                            */
      } BRREN_f;
    };

    union
    {
      __IOM uint32_t BRR; /*!< (@ 0x00000004) desc BRR                                                   */

      struct
      {
        __IOM uint32_t BRR : 8; /*!< [7..0] desc BRR                                                           */
      } BRR_f;
    };

    union
    {
      __IOM uint32_t CR; /*!< (@ 0x00000008) Control register                                           */

      struct
      {
        __IOM uint32_t FLT : 1; /*!< [0..0] desc FLT                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t AA : 1;  /*!< [2..2] desc AA                                                            */
        __IOM uint32_t SI : 1;  /*!< [3..3] desc SI                                                            */
        __IOM uint32_t STO : 1; /*!< [4..4] desc STO                                                           */
        __IOM uint32_t STA : 1; /*!< [5..5] desc STA                                                           */
        __IOM uint32_t EN : 1;  /*!< [6..6] desc EN                                                            */
        __IM uint32_t : 1;
        __IOM uint32_t SCLINSRC : 3; /*!< [10..8] desc SCLINSRC                                                     */
        __IOM uint32_t SDAINSRC : 3; /*!< [13..11] desc SDAINSRC                                                    */
      } CR_f;
    };

    union
    {
      __IOM uint32_t DR; /*!< (@ 0x0000000C) Data register                                              */

      struct
      {
        __IOM uint32_t DR : 8; /*!< [7..0] desc DR                                                            */
      } DR_f;
    };

    union
    {
      __IOM uint32_t ADDR0; /*!< (@ 0x00000010) Slave Addrress0                                            */

      struct
      {
        __IOM uint32_t GC : 1;    /*!< [0..0] desc GC                                                            */
        __IOM uint32_t ADDR0 : 7; /*!< [7..1] desc ADDR0                                                         */
      } ADDR0_f;
    };

    union
    {
      __IM uint32_t STAT; /*!< (@ 0x00000014) Status register                                            */

      struct
      {
        __IM uint32_t STAT : 8; /*!< [7..0] desc STAT                                                          */
      } STAT_f;
    };
    __IM uint32_t RESERVED[2];

    union
    {
      __IOM uint32_t ADDR1; /*!< (@ 0x00000020) Slave Addrress1                                            */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t ADDR1 : 7; /*!< [7..1] desc ADDR1                                                         */
      } ADDR1_f;
    };

    union
    {
      __IOM uint32_t ADDR2; /*!< (@ 0x00000024) Slave Addrress2                                            */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t ADDR2 : 7; /*!< [7..1] desc ADDR2                                                         */
      } ADDR2_f;
    };

    union
    {
      __IM uint32_t MATCH; /*!< (@ 0x00000028) Slave Addrress match flag                                  */

      struct
      {
        __IM uint32_t ADDR0 : 1; /*!< [0..0] desc ADDR0                                                         */
        __IM uint32_t ADDR1 : 1; /*!< [1..1] desc ADDR1                                                         */
        __IM uint32_t ADDR2 : 1; /*!< [2..2] desc ADDR2                                                         */
      } MATCH_f;
    };
  } I2C_TypeDef; /*!< Size = 44 (0x2c)                                                          */

  /* =========================================================================================================================== */
  /* ================                                           IRMOD                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc IRMOD (IRMOD)
   */

  typedef struct
  { /*!< (@ 0x40004080) IRMOD Structure                                            */

    union
    {
      __IOM uint32_t CR; /*!< (@ 0x00000000) Input selection register                                   */

      struct
      {
        __IOM uint32_t MOD : 4;  /*!< [3..0] desc MOD                                                           */
        __IOM uint32_t IRSW : 1; /*!< [4..4] desc IRSW                                                          */
        __IOM uint32_t INV : 1;  /*!< [5..5] desc INV                                                           */
      } CR_f;
    };
  } IRMOD_TypeDef; /*!< Size = 4 (0x4)                                                            */

  /* =========================================================================================================================== */
  /* ================                                           IWDT                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc IWDT (IWDT)
   */

  typedef struct
  { /*!< (@ 0x40005000) IWDT Structure                                             */

    union
    {
      __OM uint32_t KR; /*!< (@ 0x00000000) Key register                                               */

      struct
      {
        __OM uint32_t KR : 16; /*!< [15..0] desc KR                                                           */
      } KR_f;
    };

    union
    {
      __IOM uint32_t CR; /*!< (@ 0x00000004) Control register                                           */

      struct
      {
        __IOM uint32_t PRS : 3;    /*!< [2..0] desc PRS                                                           */
        __IOM uint32_t ACTION : 1; /*!< [3..3] desc ACTION                                                        */
        __IOM uint32_t IE : 1;     /*!< [4..4] desc IE                                                            */
        __IOM uint32_t PAUSE : 1;  /*!< [5..5] desc PAUSE                                                         */
      } CR_f;
    };

    union
    {
      __IOM uint32_t ARR; /*!< (@ 0x00000008) Auto reload register                                       */

      struct
      {
        __IOM uint32_t ARR : 12; /*!< [11..0] desc ARR                                                          */
      } ARR_f;
    };

    union
    {
      __IOM uint32_t SR; /*!< (@ 0x0000000C) Status register                                            */

      struct
      {
        __IM uint32_t CRF : 1;    /*!< [0..0] desc CRF                                                           */
        __IM uint32_t ARRF : 1;   /*!< [1..1] desc ARRF                                                          */
        __IM uint32_t WINRF : 1;  /*!< [2..2] desc WINRF                                                         */
        __IOM uint32_t OV : 1;    /*!< [3..3] desc OV                                                            */
        __IM uint32_t RUN : 1;    /*!< [4..4] desc RUN                                                           */
        __IM uint32_t RELOAD : 1; /*!< [5..5] desc RELOAD                                                        */
      } SR_f;
    };

    union
    {
      __IOM uint32_t WINR; /*!< (@ 0x00000010) Window register                                            */

      struct
      {
        __IOM uint32_t WINR : 12; /*!< [11..0] desc WINR                                                         */
      } WINR_f;
    };
    __IM uint32_t RESERVED[4];

    union
    {
      __IM uint32_t CNT; /*!< (@ 0x00000024) counter                                                    */

      struct
      {
        __IM uint32_t CNT : 12; /*!< [11..0] desc CNT                                                          */
      } CNT_f;
    };
  } IWDT_TypeDef; /*!< Size = 40 (0x28)                                                          */

  /* =========================================================================================================================== */
  /* ================                                           LPTIM                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc LPTIM (LPTIM)
   */

  typedef struct
  { /*!< (@ 0x40006000) LPTIM Structure                                            */

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000000) desc ISR                                                   */

      struct
      {
        __IM uint32_t CMPM : 1;    /*!< [0..0] desc CMPM                                                          */
        __IM uint32_t ARRM : 1;    /*!< [1..1] desc ARRM                                                          */
        __IM uint32_t EXTTRIG : 1; /*!< [2..2] desc EXTTRIG                                                       */
        __IM uint32_t CMPOK : 1;   /*!< [3..3] desc CMPOK                                                         */
        __IM uint32_t ARROK : 1;   /*!< [4..4] desc ARROK                                                         */
        __IM uint32_t UP : 1;      /*!< [5..5] desc UP                                                            */
        __IM uint32_t DOWN : 1;    /*!< [6..6] desc DOWN                                                          */
        __IM uint32_t DIR : 2;     /*!< [8..7] desc DIR                                                           */
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000004) desc ICR                                                   */

      struct
      {
        __IOM uint32_t CMPM : 1;    /*!< [0..0] desc CMPM                                                          */
        __IOM uint32_t ARRM : 1;    /*!< [1..1] desc ARRM                                                          */
        __IOM uint32_t EXTTRIG : 1; /*!< [2..2] desc EXTTRIG                                                       */
        __IOM uint32_t CMPOK : 1;   /*!< [3..3] desc CMPOK                                                         */
        __IOM uint32_t ARROK : 1;   /*!< [4..4] desc ARROK                                                         */
        __IOM uint32_t UP : 1;      /*!< [5..5] desc UP                                                            */
        __IOM uint32_t DOWN : 1;    /*!< [6..6] desc DOWN                                                          */
      } ICR_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000008) desc IER                                                   */

      struct
      {
        __IOM uint32_t CMPM : 1;    /*!< [0..0] desc CMPM                                                          */
        __IOM uint32_t ARRM : 1;    /*!< [1..1] desc ARRM                                                          */
        __IOM uint32_t EXTTRIG : 1; /*!< [2..2] desc EXTTRIG                                                       */
        __IOM uint32_t CMPOK : 1;   /*!< [3..3] desc CMPOK                                                         */
        __IOM uint32_t ARROK : 1;   /*!< [4..4] desc ARROK                                                         */
        __IOM uint32_t UP : 1;      /*!< [5..5] desc UP                                                            */
        __IOM uint32_t DOWN : 1;    /*!< [6..6] desc DOWN                                                          */
      } IER_f;
    };

    union
    {
      __IOM uint32_t CFGR; /*!< (@ 0x0000000C) desc CFGR                                                  */

      struct
      {
        __IOM uint32_t CKSEL : 1;       /*!< [0..0] desc CKSEL                                                         */
        __IOM uint32_t ENCMD_CKPOL : 2; /*!< [2..1] desc ENCMD_CKPOL                                                   */
        __IOM uint32_t CHFLT : 2;       /*!< [4..3] desc CHFLT                                                         */
        __IM uint32_t : 1;
        __IOM uint32_t TRIGFLT : 2; /*!< [7..6] desc TRIGFLT                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t PRS : 3; /*!< [11..9] desc PRS                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t TRIGSEL : 3; /*!< [15..13] desc TRIGSEL                                                     */
        __IM uint32_t : 1;
        __IOM uint32_t TRIGEN : 2;  /*!< [18..17] desc TRIGEN                                                      */
        __IOM uint32_t TIMOUT : 1;  /*!< [19..19] desc TIMOUT                                                      */
        __IOM uint32_t WAVE : 1;    /*!< [20..20] desc WAVE                                                        */
        __IOM uint32_t WAVPOL : 1;  /*!< [21..21] desc WAVPOL                                                      */
        __IOM uint32_t PRELOAD : 1; /*!< [22..22] desc PRELOAD                                                     */
        __IOM uint32_t COUNTMD : 1; /*!< [23..23] desc COUNTMD                                                     */
        __IOM uint32_t ENC : 1;     /*!< [24..24] desc ENC                                                         */
        __IOM uint32_t ICLKSRC : 2; /*!< [26..25] desc ICLKSRC                                                     */
      } CFGR_f;
    };

