zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
    union
    {
      __IOM uint32_t CR; /*!< (@ 0x00000010) desc CR                                                    */

      struct
      {
        __IOM uint32_t EN : 1;       /*!< [0..0] desc EN                                                            */
        __IOM uint32_t SNGSTART : 1; /*!< [1..1] desc SNGSTART                                                      */
        __IOM uint32_t CNTSTART : 1; /*!< [2..2] desc CNTSTART                                                      */
        __IOM uint32_t SRST : 1;     /*!< [3..3] desc SRST                                                          */
        __IOM uint32_t ARST : 1;     /*!< [4..4] desc ARST                                                          */
      } CR_f;
    };

    union
    {
      __IOM uint32_t CMP; /*!< (@ 0x00000014) desc CMP                                                   */

      struct
      {
        __IOM uint32_t CMP : 16; /*!< [15..0] desc CMP                                                          */
      } CMP_f;
    };

    union
    {
      __IOM uint32_t ARR; /*!< (@ 0x00000018) desc ARR                                                   */

      struct
      {
        __IOM uint32_t ARR : 16; /*!< [15..0] desc ARR                                                          */
      } ARR_f;
    };

    union
    {
      __IM uint32_t CNT; /*!< (@ 0x0000001C) desc CNT                                                   */

      struct
      {
        __IM uint32_t CNT : 16; /*!< [15..0] desc CNT                                                          */
      } CNT_f;
    };
  } LPTIM_TypeDef; /*!< Size = 32 (0x20)                                                          */

  /* =========================================================================================================================== */
  /* ================                                           UART1                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc UART1 (UART1)
   */

  typedef struct
  { /*!< (@ 0x40000C00) UART1 Structure                                            */

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000000) Control register1                                          */

      struct
      {
        __IOM uint32_t TXEN : 1;     /*!< [0..0] desc TXEN                                                          */
        __IOM uint32_t RXEN : 1;     /*!< [1..1] desc RXEN                                                          */
        __IOM uint32_t PARITY : 1;   /*!< [2..2] desc PARITY                                                        */
        __IOM uint32_t PARITYEN : 1; /*!< [3..3] desc PARITYEN                                                      */
        __IOM uint32_t STOP : 2;     /*!< [5..4] desc STOP                                                          */
        __IOM uint32_t CHLEN : 1;    /*!< [6..6] desc CHLEN                                                         */
        __IOM uint32_t MSBF : 1;     /*!< [7..7] desc MSBF                                                          */
        __IOM uint32_t START : 1;    /*!< [8..8] desc START                                                         */
        __IOM uint32_t OVER : 2;     /*!< [10..9] desc OVER                                                         */
        __IOM uint32_t SIGNAL : 1;   /*!< [11..11] desc SIGNAL                                                      */
        __IOM uint32_t SOURCE : 2;   /*!< [13..12] desc SOURCE                                                      */
        __IOM uint32_t SYNC : 1;     /*!< [14..14] desc SYNC                                                        */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x00000004) Control register2                                          */

      struct
      {
        __IOM uint32_t ADDREN : 1;    /*!< [0..0] desc ADDREN                                                        */
        __IOM uint32_t RXMATCHEN : 1; /*!< [1..1] desc RXMATCHEN                                                     */
        __IOM uint32_t CTSEN : 1;     /*!< [2..2] desc CTSEN                                                         */
        __IOM uint32_t RTSEN : 1;     /*!< [3..3] desc RTSEN                                                         */
        __IOM uint32_t RXINV : 1;     /*!< [4..4] desc RXINV                                                         */
        __IOM uint32_t TXINV : 1;     /*!< [5..5] desc TXINV                                                         */
        __IM uint32_t : 2;
        __IOM uint32_t TIMCR : 3; /*!< [10..8] desc TIMCR                                                        */
        __IOM uint32_t SWAP : 1;  /*!< [11..11] desc SWAP                                                        */
        __IOM uint32_t ADCRX : 1; /*!< [12..12] desc ADCRX                                                       */
        __IOM uint32_t ADCTX : 1; /*!< [13..13] desc ADCTX                                                       */
        __IOM uint32_t LOOP : 1;  /*!< [14..14] desc LOOP                                                        */
        __IOM uint32_t RXSRC : 3; /*!< [17..15] desc RXSRC                                                       */
      } CR2_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000008) Interrupt enable register                                  */

      struct
      {
        __IOM uint32_t TXE : 1;     /*!< [0..0] desc TXE                                                           */
        __IOM uint32_t TC : 1;      /*!< [1..1] desc TC                                                            */
        __IOM uint32_t RC : 1;      /*!< [2..2] desc RC                                                            */
        __IOM uint32_t RXIDLE : 1;  /*!< [3..3] desc RXIDLE                                                        */
        __IOM uint32_t RXBRK : 1;   /*!< [4..4] desc RXBRK                                                         */
        __IOM uint32_t BAUD : 1;    /*!< [5..5] desc BAUD                                                          */
        __IOM uint32_t TIMOV : 1;   /*!< [6..6] desc TIMOV                                                         */
        __IOM uint32_t CTS : 1;     /*!< [7..7] desc CTS                                                           */
        __IOM uint32_t FE : 1;      /*!< [8..8] desc FE                                                            */
        __IOM uint32_t PE : 1;      /*!< [9..9] desc PE                                                            */
        __IOM uint32_t NE : 1;      /*!< [10..10] desc NE                                                          */
        __IOM uint32_t ORE : 1;     /*!< [11..11] desc ORE                                                         */
        __IOM uint32_t RXMATCH : 1; /*!< [12..12] desc RXMATCH                                                     */
      } IER_f;
    };

    union
    {
      __IOM uint32_t BRRI; /*!< (@ 0x0000000C) desc BRRI                                                  */

      struct
      {
        __IOM uint32_t BRRI : 16; /*!< [15..0] desc BRRI                                                         */
      } BRRI_f;
    };

    union
    {
      __IOM uint32_t BRRF; /*!< (@ 0x00000010) desc BRRF                                                  */

      struct
      {
        __IOM uint32_t BRRF : 4; /*!< [3..0] desc BRRF                                                          */
      } BRRF_f;
    };

    union
    {
      __IOM uint32_t TIMARR; /*!< (@ 0x00000014) desc TIMARR                                                */

      struct
      {
        __IOM uint32_t TIMARR : 24; /*!< [23..0] desc TIMARR                                                       */
      } TIMARR_f;
    };

    union
    {
      __IM uint32_t TIMCNT; /*!< (@ 0x00000018) desc TIMCNT                                                */

      struct
      {
        __IM uint32_t TIMCNT : 24; /*!< [23..0] desc TIMCNT                                                       */
      } TIMCNT_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x0000001C) Interrupt status register                                  */

      struct
      {
        __IM uint32_t TXE : 1;      /*!< [0..0] desc TXE                                                           */
        __IM uint32_t TC : 1;       /*!< [1..1] desc TC                                                            */
        __IM uint32_t RC : 1;       /*!< [2..2] desc RC                                                            */
        __IM uint32_t RXIDLE : 1;   /*!< [3..3] desc RXIDLE                                                        */
        __IM uint32_t RXBRK : 1;    /*!< [4..4] desc RXBRK                                                         */
        __IM uint32_t BAUD : 1;     /*!< [5..5] desc BAUD                                                          */
        __IM uint32_t TIMOV : 1;    /*!< [6..6] desc TIMOV                                                         */
        __IM uint32_t CTS : 1;      /*!< [7..7] desc CTS                                                           */
        __IM uint32_t FE : 1;       /*!< [8..8] desc FE                                                            */
        __IM uint32_t PE : 1;       /*!< [9..9] desc PE                                                            */
        __IM uint32_t NE : 1;       /*!< [10..10] desc NE                                                          */
        __IM uint32_t ORE : 1;      /*!< [11..11] desc ORE                                                         */
        __IM uint32_t RXMATCH : 1;  /*!< [12..12] desc RXMATCH                                                     */
        __IM uint32_t SLVMATCH : 1; /*!< [13..13] desc SLVMATCH                                                    */
        __IM uint32_t TXBUSY : 1;   /*!< [14..14] desc TXBUSY                                                      */
        __IM uint32_t CTSLV : 1;    /*!< [15..15] desc CTSLV                                                       */
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000020) Interrupt flag clear register                              */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t TC : 1;      /*!< [1..1] desc TC                                                            */
        __IOM uint32_t RC : 1;      /*!< [2..2] desc RC                                                            */
        __IOM uint32_t RXIDLE : 1;  /*!< [3..3] desc RXIDLE                                                        */
        __IOM uint32_t RXBRK : 1;   /*!< [4..4] desc RXBRK                                                         */
        __IOM uint32_t BAUD : 1;    /*!< [5..5] desc BAUD                                                          */
        __IOM uint32_t TIMOV : 1;   /*!< [6..6] desc TIMOV                                                         */
        __IOM uint32_t CTS : 1;     /*!< [7..7] desc CTS                                                           */
        __IOM uint32_t FE : 1;      /*!< [8..8] desc FE                                                            */
        __IOM uint32_t PE : 1;      /*!< [9..9] desc PE                                                            */
        __IOM uint32_t NE : 1;      /*!< [10..10] desc NE                                                          */
        __IOM uint32_t ORE : 1;     /*!< [11..11] desc ORE                                                         */
        __IOM uint32_t RXMATCH : 1; /*!< [12..12] desc RXMATCH                                                     */
      } ICR_f;
    };

    union
    {
      __IM uint32_t RDR; /*!< (@ 0x00000024) Data reg for read                                          */

      struct
      {
        __IM uint32_t RDR : 9; /*!< [8..0] desc RDR                                                           */
      } RDR_f;
    };

    union
    {
      __OM uint32_t TDR; /*!< (@ 0x00000028) Data reg for write                                         */

      struct
      {
        __OM uint32_t TDR : 9;   /*!< [8..0] desc TDR                                                           */
        __OM uint32_t IDLE : 1;  /*!< [9..9] desc IDLE                                                          */
        __OM uint32_t BREAK : 1; /*!< [10..10] desc BREAK                                                       */
      } TDR_f;
    };
    __IM uint32_t RESERVED;

    union
    {
      __IOM uint32_t ADDR; /*!< (@ 0x00000030) Slave addr                                                 */

      struct
      {
        __IOM uint32_t ADDR : 8; /*!< [7..0] desc ADDR                                                          */
      } ADDR_f;
    };

    union
    {
      __IOM uint32_t MASK; /*!< (@ 0x00000034) Slave addr mask                                            */

      struct
      {
        __IOM uint32_t MASK : 8; /*!< [7..0] desc MASK                                                          */
      } MASK_f;
    };

    union
    {
      __IOM uint32_t CR3; /*!< (@ 0x00000038) Control register3                                          */

      struct
      {
        __IOM uint32_t DEM : 1;    /*!< [0..0] desc DEM                                                           */
        __IOM uint32_t DEP : 1;    /*!< [1..1] desc DEP                                                           */
        __IOM uint32_t DETIME : 5; /*!< [6..2] desc DETIME                                                        */
        __IOM uint32_t LIN : 1;    /*!< [7..7] desc LIN                                                           */
        __IOM uint32_t BRKL : 1;   /*!< [8..8] desc BRKL                                                          */
      } CR3_f;
    };

    union
    {
      __IOM uint32_t RXMATCH; /*!< (@ 0x0000003C) desc RXMATCH                                               */

      struct
      {
        __IOM uint32_t RXMATCH : 9; /*!< [8..0] desc RXMATCH                                                       */
      } RXMATCH_f;
    };
  } UART_TypeDef; /*!< Size = 64 (0x40)                                                          */

  /* =========================================================================================================================== */
  /* ================                                            LVD                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc LVD (LVD)
   */

  typedef struct
  { /*!< (@ 0x400000D0) LVD Structure                                              */

    union
    {
      __IOM uint32_t CR0; /*!< (@ 0x00000000) Control register0                                          */

      struct
      {
        __IOM uint32_t EN : 1;     /*!< [0..0] desc EN                                                            */
        __IOM uint32_t ACTION : 1; /*!< [1..1] desc ACTION                                                        */
        __IOM uint32_t SOURCE : 1; /*!< [2..2] desc SOURCE                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t VTH : 3; /*!< [6..4] desc VTH                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t FLTCLK : 1; /*!< [8..8] desc FLTCLK                                                        */
      } CR0_f;
    };

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000004) Control register1                                          */

      struct
      {
        __IOM uint32_t IE : 1;      /*!< [0..0] desc IE                                                            */
        __IOM uint32_t LEVEL : 1;   /*!< [1..1] desc LEVEL                                                         */
        __IOM uint32_t RISE : 1;    /*!< [2..2] desc RISE                                                          */
        __IOM uint32_t FALL : 1;    /*!< [3..3] desc FALL                                                          */
        __IOM uint32_t FLTTIME : 4; /*!< [7..4] desc FLTTIME                                                       */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t SR; /*!< (@ 0x00000008) status register                                            */

      struct
      {
        __IOM uint32_t INTF : 1; /*!< [0..0] desc INTF                                                          */
        __IM uint32_t FLTV : 1;  /*!< [1..1] desc FLTV                                                          */
      } SR_f;
    };
  } LVD_TypeDef; /*!< Size = 12 (0xc)                                                           */

  /* =========================================================================================================================== */
  /* ================                                            RAM                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc RAM (RAM)
   */

  typedef struct
  { /*!< (@ 0x40022400) RAM Structure                                              */

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000000) Interrupt enable register                                  */

      struct
      {
        __IOM uint32_t PARITY : 1; /*!< [0..0] desc PARITY                                                        */
      } IER_f;
    };

    union
    {
      __IM uint32_t ADDR; /*!< (@ 0x00000004) Error address register                                     */

      struct
      {
        __IM uint32_t ADDR : 32; /*!< [31..0] desc ADDR                                                         */
      } ADDR_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000008) Interrupt status register                                  */

      struct
      {
        __IM uint32_t PARITY : 1; /*!< [0..0] desc PARITY                                                        */
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x0000000C) Interrupt flag clear register                              */

      struct
      {
        __IOM uint32_t PARITY : 1; /*!< [0..0] desc PARITY                                                        */
      } ICR_f;
    };
  } RAM_TypeDef; /*!< Size = 16 (0x10)                                                          */

  /* =========================================================================================================================== */
  /* ================                                            RTC                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc RTC (RTC)
   */

  typedef struct
  { /*!< (@ 0x40004400) RTC Structure                                              */

    union
    {
      __OM uint32_t KEY; /*!< (@ 0x00000000) desc KEY                                                   */

      struct
      {
        __OM uint32_t KEY : 8; /*!< [7..0] desc KEY                                                           */
      } KEY_f;
    };

    union
    {
      __IOM uint32_t CR0; /*!< (@ 0x00000004) desc CR0                                                   */

      struct
      {
        __IOM uint32_t INTERVAL : 3; /*!< [2..0] desc INTERVAL                                                      */
        __IOM uint32_t H24 : 1;      /*!< [3..3] desc H24                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t RTC1HZ : 2; /*!< [6..5] desc RTC1HZ                                                        */
        __IOM uint32_t START : 1;  /*!< [7..7] desc START                                                         */
      } CR0_f;
    };

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000008) desc CR1                                                   */

      struct
      {
        __IM uint32_t : 2;
        __IM uint32_t WAIT : 1; /*!< [2..2] desc WAIT                                                          */
        __IM uint32_t : 5;
        __IOM uint32_t SOURCE : 3; /*!< [10..8] desc SOURCE                                                       */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x0000000C) desc CR2                                                   */

      struct
      {
        __IOM uint32_t AWTPRS : 2;   /*!< [1..0] desc AWTPRS                                                        */
        __IOM uint32_t AWTSRC : 1;   /*!< [2..2] desc AWTSRC                                                        */
        __IOM uint32_t TAMPEDGE : 1; /*!< [3..3] desc TAMPEDGE                                                      */
        __IOM uint32_t RTCOUT : 2;   /*!< [5..4] desc RTCOUT                                                        */
        __IOM uint32_t TAMPEN : 1;   /*!< [6..6] desc TAMPEN                                                        */
        __IOM uint32_t AWTEN : 1;    /*!< [7..7] desc AWTEN                                                         */
        __IM uint32_t : 1;
        __IOM uint32_t ALARMAEN : 1; /*!< [9..9] desc ALARMAEN                                                      */
        __IOM uint32_t ALARMBEN : 1; /*!< [10..10] desc ALARMBEN                                                    */
      } CR2_f;
    };

    union
    {
      __IOM uint32_t COMPCFR1; /*!< (@ 0x00000010) desc COMPCFR1                                              */

      struct
      {
        __IOM uint32_t COMP : 12;  /*!< [11..0] desc COMP                                                         */
        __IOM uint32_t PERIOD : 2; /*!< [13..12] desc PERIOD                                                      */
        __IOM uint32_t SIGN : 1;   /*!< [14..14] desc SIGN                                                        */
        __IOM uint32_t EN : 1;     /*!< [15..15] desc EN                                                          */
      } COMPCFR1_f;
    };

    union
    {
      __IOM uint32_t DATE; /*!< (@ 0x00000014) desc DATE                                                  */

      struct
      {
        __IOM uint32_t DAY : 8;   /*!< [7..0] desc DAY                                                           */
        __IOM uint32_t MONTH : 8; /*!< [15..8] desc MONTH                                                        */
        __IOM uint32_t YEAR : 8;  /*!< [23..16] desc YEAR                                                        */
        __IOM uint32_t WEEK : 3;  /*!< [26..24] desc WEEK                                                        */
      } DATE_f;
    };

    union
    {
      __IOM uint32_t TIME; /*!< (@ 0x00000018) desc TIME                                                  */

      struct
      {
        __IOM uint32_t SECOND : 7; /*!< [6..0] desc SECOND                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t MINUTE : 7; /*!< [14..8] desc MINUTE                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t HOUR : 6; /*!< [21..16] desc HOUR                                                        */
      } TIME_f;
    };

    union
    {
      __IOM uint32_t ALARMA; /*!< (@ 0x0000001C) desc ALARMA                                                */

