zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
      struct
      {
        __IOM uint32_t SECOND : 7;   /*!< [6..0] desc SECOND                                                        */
        __IOM uint32_t SECONDEN : 1; /*!< [7..7] desc SECONDEN                                                      */
        __IOM uint32_t MINUTE : 7;   /*!< [14..8] desc MINUTE                                                       */
        __IOM uint32_t MINUTEEN : 1; /*!< [15..15] desc MINUTEEN                                                    */
        __IOM uint32_t HOUR : 6;     /*!< [21..16] desc HOUR                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t HOUREN : 1;   /*!< [23..23] desc HOUREN                                                      */
        __IOM uint32_t WEEKMASK : 7; /*!< [30..24] desc WEEKMASK                                                    */
      } ALARMA_f;
    };

    union
    {
      __IOM uint32_t ALARMB; /*!< (@ 0x00000020) desc ALARMB                                                */

      struct
      {
        __IOM uint32_t SECOND : 7;   /*!< [6..0] desc SECOND                                                        */
        __IOM uint32_t SECONDEN : 1; /*!< [7..7] desc SECONDEN                                                      */
        __IOM uint32_t MINUTE : 7;   /*!< [14..8] desc MINUTE                                                       */
        __IOM uint32_t MINUTEEN : 1; /*!< [15..15] desc MINUTEEN                                                    */
        __IOM uint32_t HOUR : 6;     /*!< [21..16] desc HOUR                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t HOUREN : 1;   /*!< [23..23] desc HOUREN                                                      */
        __IOM uint32_t WEEKMASK : 7; /*!< [30..24] desc WEEKMASK                                                    */
      } ALARMB_f;
    };

    union
    {
      __IM uint32_t TAMPDATE; /*!< (@ 0x00000024) desc TAMPDATE                                              */

      struct
      {
        __IM uint32_t DAY : 6; /*!< [5..0] desc DAY                                                           */
        __IM uint32_t : 2;
        __IM uint32_t MONTH : 5; /*!< [12..8] desc MONTH                                                        */
        __IM uint32_t WEEK : 3;  /*!< [15..13] desc WEEK                                                        */
      } TAMPDATE_f;
    };

    union
    {
      __IM uint32_t TAMPTIME; /*!< (@ 0x00000028) desc TAMPTIME                                              */

      struct
      {
        __IM uint32_t SECOND : 7; /*!< [6..0] desc SECOND                                                        */
        __IM uint32_t : 1;
        __IM uint32_t MINUTE : 7; /*!< [14..8] desc MINUTE                                                       */
        __IM uint32_t : 1;
        __IM uint32_t HOUR : 6; /*!< [21..16] desc HOUR                                                        */
      } TAMPTIME_f;
    };

    union
    {
      __IOM uint32_t AWTARR; /*!< (@ 0x0000002C) desc AWTARR                                                */

      struct
      {
        __IOM uint32_t ARR : 16; /*!< [15..0] desc ARR                                                          */
      } AWTARR_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000030) desc IER                                                   */

      struct
      {
        __IOM uint32_t ALARMA : 1;  /*!< [0..0] desc ALARMA                                                        */
        __IOM uint32_t ALARMB : 1;  /*!< [1..1] desc ALARMB                                                        */
        __IOM uint32_t AWTIMER : 1; /*!< [2..2] desc AWTIMER                                                       */
        __IOM uint32_t TAMP : 1;    /*!< [3..3] desc TAMP                                                          */
        __IOM uint32_t TAMPOV : 1;  /*!< [4..4] desc TAMPOV                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t INTERVAL : 1; /*!< [6..6] desc INTERVAL                                                      */
      } IER_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000034) desc ISR                                                   */

      struct
      {
        __IM uint32_t ALARMA : 1;  /*!< [0..0] desc ALARMA                                                        */
        __IM uint32_t ALARMB : 1;  /*!< [1..1] desc ALARMB                                                        */
        __IM uint32_t AWTIMER : 1; /*!< [2..2] desc AWTIMER                                                       */
        __IM uint32_t TAMP : 1;    /*!< [3..3] desc TAMP                                                          */
        __IM uint32_t TAMPOV : 1;  /*!< [4..4] desc TAMPOV                                                        */
        __IM uint32_t : 1;
        __IM uint32_t INTERVAL : 1; /*!< [6..6] desc INTERVAL                                                      */
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000038) desc ICR                                                   */

      struct
      {
        __IOM uint32_t ALARMA : 1;  /*!< [0..0] desc ALARMA                                                        */
        __IOM uint32_t ALARMB : 1;  /*!< [1..1] desc ALARMB                                                        */
        __IOM uint32_t AWTIMER : 1; /*!< [2..2] desc AWTIMER                                                       */
        __IOM uint32_t TAMP : 1;    /*!< [3..3] desc TAMP                                                          */
        __IOM uint32_t TAMPOV : 1;  /*!< [4..4] desc TAMPOV                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t INTERVAL : 1; /*!< [6..6] desc INTERVAL                                                      */
      } ICR_f;
    };

    union
    {
      __IM uint32_t AWTCNT; /*!< (@ 0x0000003C) desc AWTCNT                                                */

      struct
      {
        __IM uint32_t CNT : 16; /*!< [15..0] desc CNT                                                          */
      } AWTCNT_f;
    };

    union
    {
      __IOM uint32_t PSC; /*!< (@ 0x00000040) desc PSC                                                   */

      struct
      {
        __IOM uint32_t PSC2 : 20; /*!< [19..0] desc PSC2                                                         */
        __IOM uint32_t PSC1 : 8;  /*!< [27..20] desc PSC1                                                        */
      } PSC_f;
    };

    union
    {
      __IM uint32_t SSCNT; /*!< (@ 0x00000044) desc SSCNT                                                 */

      struct
      {
        __IM uint32_t SSCNT0 : 20; /*!< [19..0] desc SSCNT0                                                       */
        __IM uint32_t SSCNT1 : 1;  /*!< [20..20] desc SSCNT1                                                      */
      } SSCNT_f;
    };
  } RTC_TypeDef; /*!< Size = 72 (0x48)                                                          */

  /* =========================================================================================================================== */
  /* ================                                            SPI                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc SPI (SPI)
   */

  typedef struct
  { /*!< (@ 0x40000800) SPI Structure                                              */

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000000) Control register1                                          */

      struct
      {
        __IOM uint32_t MSTR : 1;   /*!< [0..0] desc MSTR                                                          */
        __IOM uint32_t SSM : 1;    /*!< [1..1] desc SSM                                                           */
        __IOM uint32_t CPHA : 1;   /*!< [2..2] desc CPHA                                                          */
        __IOM uint32_t CPOL : 1;   /*!< [3..3] desc CPOL                                                          */
        __IOM uint32_t BR : 3;     /*!< [6..4] desc BR                                                            */
        __IOM uint32_t LSBF : 1;   /*!< [7..7] desc LSBF                                                          */
        __IOM uint32_t WIDTH : 4;  /*!< [11..8] desc WIDTH                                                        */
        __IOM uint32_t GAP : 4;    /*!< [15..12] desc GAP                                                         */
        __IOM uint32_t MODE : 2;   /*!< [17..16] desc MODE                                                        */
        __IOM uint32_t FLTEN : 1;  /*!< [18..18] desc FLTEN                                                       */
        __IOM uint32_t MISOHD : 1; /*!< [19..19] desc MISOHD                                                      */
        __IOM uint32_t SMP : 1;    /*!< [20..20] desc SMP                                                         */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x00000004) Control register2                                          */

      struct
      {
        __IOM uint32_t EN : 1; /*!< [0..0] desc EN                                                            */
        __IM uint32_t : 2;
        __IOM uint32_t ADCRX : 1; /*!< [3..3] desc ADCRX                                                         */
        __IOM uint32_t ADCTX : 1; /*!< [4..4] desc ADCTX                                                         */
      } CR2_f;
    };

    union
    {
      __IOM uint32_t CR3; /*!< (@ 0x00000008) desc CR3                                                   */

      struct
      {
        __IOM uint32_t HDOE : 1; /*!< [0..0] desc HDOE                                                          */
      } CR3_f;
    };

    union
    {
      __IOM uint32_t SSI; /*!< (@ 0x0000000C) Slave slect register                                       */

      struct
      {
        __IOM uint32_t SSI : 1; /*!< [0..0] desc SSI                                                           */
      } SSI_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000010) Interrupt enable register                                  */

      struct
      {
        __IOM uint32_t TXE : 1;   /*!< [0..0] desc TXE                                                           */
        __IOM uint32_t RXNE : 1;  /*!< [1..1] desc RXNE                                                          */
        __IOM uint32_t SSF : 1;   /*!< [2..2] desc SSF                                                           */
        __IOM uint32_t SSR : 1;   /*!< [3..3] desc SSR                                                           */
        __IOM uint32_t UD : 1;    /*!< [4..4] desc UD                                                            */
        __IOM uint32_t OV : 1;    /*!< [5..5] desc OV                                                            */
        __IOM uint32_t SSERR : 1; /*!< [6..6] desc SSERR                                                         */
        __IOM uint32_t MODF : 1;  /*!< [7..7] desc MODF                                                          */
      } IER_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000014) Interrupt status register                                  */

      struct
      {
        __IM uint32_t TXE : 1;   /*!< [0..0] desc TXE                                                           */
        __IM uint32_t RXNE : 1;  /*!< [1..1] desc RXNE                                                          */
        __IM uint32_t SSF : 1;   /*!< [2..2] desc SSF                                                           */
        __IM uint32_t SSR : 1;   /*!< [3..3] desc SSR                                                           */
        __IM uint32_t UD : 1;    /*!< [4..4] desc UD                                                            */
        __IM uint32_t OV : 1;    /*!< [5..5] desc OV                                                            */
        __IM uint32_t SSERR : 1; /*!< [6..6] desc SSERR                                                         */
        __IM uint32_t MODF : 1;  /*!< [7..7] desc MODF                                                          */
        __IM uint32_t BUSY : 1;  /*!< [8..8] desc BUSY                                                          */
        __IM uint32_t SSLVL : 1; /*!< [9..9] desc SSLVL                                                         */
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000018) Interrupt flag clear register                              */

      struct
      {
        __IOM uint32_t FLUSH : 1; /*!< [0..0] desc FLUSH                                                         */
        __IOM uint32_t RXNE : 1;  /*!< [1..1] desc RXNE                                                          */
        __IOM uint32_t SSF : 1;   /*!< [2..2] desc SSF                                                           */
        __IOM uint32_t SSR : 1;   /*!< [3..3] desc SSR                                                           */
        __IOM uint32_t UD : 1;    /*!< [4..4] desc UD                                                            */
        __IOM uint32_t OV : 1;    /*!< [5..5] desc OV                                                            */
        __IOM uint32_t SSERR : 1; /*!< [6..6] desc SSERR                                                         */
        __IOM uint32_t MODF : 1;  /*!< [7..7] desc MODF                                                          */
      } ICR_f;
    };

    union
    {
      __IOM uint32_t DR; /*!< (@ 0x0000001C) Data register                                              */

      struct
      {
        __IOM uint32_t DR : 16; /*!< [15..0] desc DR                                                           */
      } DR_f;
    };
  } SPI_TypeDef; /*!< Size = 32 (0x20)                                                          */

  /* =========================================================================================================================== */
  /* ================                                          SYSCTRL                                          ================ */
  /* =========================================================================================================================== */

  /**
   * @brief System Ctrl (SYSCTRL)
   */

  typedef struct
  { /*!< (@ 0x40004000) SYSCTRL Structure                                          */

    union
    {
      __IOM uint32_t CR0; /*!< (@ 0x00000000) Control Reg0                                               */

      struct
      {
        __IOM uint32_t SYSCLK : 3;  /*!< [2..0] desc SYSCLK                                                        */
        __IOM uint32_t PCLKPRS : 2; /*!< [4..3] desc PCLKPRS                                                       */
        __IOM uint32_t HCLKPRS : 3; /*!< [7..5] desc HCLKPRS                                                       */
        __IM uint32_t : 8;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } CR0_f;
    };

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000004) Control Reg1                                               */

      struct
      {
        __IOM uint32_t HSIEN : 1; /*!< [0..0] desc HSIEN                                                         */
        __IOM uint32_t HSEEN : 1; /*!< [1..1] desc HSEEN                                                         */
        __IM uint32_t : 1;
        __IOM uint32_t LSIEN : 1;   /*!< [3..3] desc LSIEN                                                         */
        __IOM uint32_t LSEEN : 1;   /*!< [4..4] desc LSEEN                                                         */
        __IOM uint32_t LSELOCK : 1; /*!< [5..5] desc LSELOCK                                                       */
        __IOM uint32_t LSECCS : 1;  /*!< [6..6] desc LSECCS                                                        */
        __IOM uint32_t HSECCS : 1;  /*!< [7..7] desc HSECCS                                                        */
        __IOM uint32_t CLKCCS : 1;  /*!< [8..8] desc CLKCCS                                                        */
        __IM uint32_t : 7;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x00000008) Control Reg2                                               */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t SWDIO : 1;     /*!< [1..1] desc SWDIO                                                         */
        __IOM uint32_t LOCKUP : 1;    /*!< [2..2] desc LOCKUP                                                        */
        __IOM uint32_t WAKEUPCLK : 1; /*!< [3..3] desc WAKEUPCLK                                                     */
        __IOM uint32_t FLASHWAIT : 3; /*!< [6..4] desc FLASHWAIT                                                     */
        __IOM uint32_t RTCLPM : 1;    /*!< [7..7] desc RTCLPM                                                        */
        __IM uint32_t : 2;
        __IOM uint32_t HSEBRKEN : 1; /*!< [10..10] desc HSEBRKEN                                                    */
        __IOM uint32_t LSEBRKEN : 1; /*!< [11..11] desc LSEBRKEN                                                    */
        __IOM uint32_t CLLBRKEN : 1; /*!< [12..12] desc CLLBRKEN                                                    */
        __IOM uint32_t DSBRKEN : 1;  /*!< [13..13] desc DSBRKEN                                                     */
        __IOM uint32_t LVDBRKEN : 1; /*!< [14..14] desc LVDBRKEN                                                    */
        __IOM uint32_t RAMBRKEN : 1; /*!< [15..15] desc RAMBRKEN                                                    */
        __OM uint32_t KEY : 16;      /*!< [31..16] desc KEY                                                         */
      } CR2_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x0000000C) Interupt Enable Reg                                        */

      struct
      {
        __IOM uint32_t HSIRDY : 1; /*!< [0..0] desc HSIRDY                                                        */
        __IOM uint32_t HSERDY : 1; /*!< [1..1] desc HSERDY                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t LSIRDY : 1;   /*!< [3..3] desc LSIRDY                                                        */
        __IOM uint32_t LSERDY : 1;   /*!< [4..4] desc LSERDY                                                        */
        __IOM uint32_t LSEFAIL : 1;  /*!< [5..5] desc LSEFAIL                                                       */
        __IOM uint32_t HSEFAIL : 1;  /*!< [6..6] desc HSEFAIL                                                       */
        __IOM uint32_t LSEFAULT : 1; /*!< [7..7] desc LSEFAULT                                                      */
        __IOM uint32_t HSEFAULT : 1; /*!< [8..8] desc HSEFAULT                                                      */
        __IM uint32_t : 7;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } IER_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000010) Interupt Status Reg                                        */

      struct
      {
        __IM uint32_t HSIRDY : 1; /*!< [0..0] desc HSIRDY                                                        */
        __IM uint32_t HSERDY : 1; /*!< [1..1] desc HSERDY                                                        */
        __IM uint32_t : 1;
        __IM uint32_t LSIRDY : 1;   /*!< [3..3] desc LSIRDY                                                        */
        __IM uint32_t LSERDY : 1;   /*!< [4..4] desc LSERDY                                                        */
        __IM uint32_t LSEFAIL : 1;  /*!< [5..5] desc LSEFAIL                                                       */
        __IM uint32_t HSEFAIL : 1;  /*!< [6..6] desc HSEFAIL                                                       */
        __IM uint32_t LSEFAULT : 1; /*!< [7..7] desc LSEFAULT                                                      */
        __IM uint32_t HSEFAULT : 1; /*!< [8..8] desc HSEFAULT                                                      */
        __IM uint32_t : 2;
        __IM uint32_t HSISTABLE : 1; /*!< [11..11] desc HSISTABLE                                                   */
        __IM uint32_t HSESTABLE : 1; /*!< [12..12] desc HSESTABLE                                                   */
        __IM uint32_t : 1;
        __IM uint32_t LSISTABLE : 1; /*!< [14..14] desc LSISTABLE                                                   */
        __IM uint32_t LSESTABLE : 1; /*!< [15..15] desc LSESTABLE                                                   */
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000014) Interupt Clear Reg                                         */

      struct
      {
        __IOM uint32_t HSIRDY : 1; /*!< [0..0] desc HSIRDY                                                        */
        __IOM uint32_t HSERDY : 1; /*!< [1..1] desc HSERDY                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t LSIRDY : 1;   /*!< [3..3] desc LSIRDY                                                        */
        __IOM uint32_t LSERDY : 1;   /*!< [4..4] desc LSERDY                                                        */
        __IOM uint32_t LSEFAIL : 1;  /*!< [5..5] desc LSEFAIL                                                       */
        __IOM uint32_t HSEFAIL : 1;  /*!< [6..6] desc HSEFAIL                                                       */
        __IOM uint32_t LSEFAULT : 1; /*!< [7..7] desc LSEFAULT                                                      */
        __IOM uint32_t HSEFAULT : 1; /*!< [8..8] desc HSEFAULT                                                      */
      } ICR_f;
    };

    union
    {
      __IOM uint32_t HSI; /*!< (@ 0x00000018) HSI Control Reg                                            */

      struct
      {
        __IOM uint32_t TRIM : 11; /*!< [10..0] desc TRIM                                                         */
        __IOM uint32_t DIV : 4;   /*!< [14..11] desc DIV                                                         */
        __IM uint32_t STABLE : 1; /*!< [15..15] desc STABLE                                                      */
      } HSI_f;
    };

    union
    {
      __IOM uint32_t HSE; /*!< (@ 0x0000001C) HEX Control Reg                                            */

