zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
      struct
      {
        __IOM uint32_t DRIVER : 4;    /*!< [3..0] desc DRIVER                                                        */
        __IOM uint32_t WAITCYCLE : 2; /*!< [5..4] desc WAITCYCLE                                                     */
        __IOM uint32_t MODE : 1;      /*!< [6..6] desc MODE                                                          */
        __IOM uint32_t HEXENPOL : 1;  /*!< [7..7] desc HEXENPOL                                                      */
        __IOM uint32_t DETCNT : 11;   /*!< [18..8] desc DETCNT                                                       */
        __IM uint32_t STABLE : 1;     /*!< [19..19] desc STABLE                                                      */
        __IOM uint32_t PDRIVER : 4;   /*!< [23..20] desc PDRIVER                                                     */
        __IOM uint32_t DIGFLT : 1;    /*!< [24..24] desc DIGFLT                                                      */
      } HSE_f;
    };

    union
    {
      __IOM uint32_t LSI; /*!< (@ 0x00000020) LSI Control Reg                                            */

      struct
      {
        __IOM uint32_t TRIM : 10;     /*!< [9..0] desc TRIM                                                          */
        __IOM uint32_t WAITCYCLE : 2; /*!< [11..10] desc WAITCYCLE                                                   */
        __IM uint32_t : 3;
        __IM uint32_t STABLE : 1; /*!< [15..15] desc STABLE                                                      */
      } LSI_f;
    };

    union
    {
      __IOM uint32_t LSE; /*!< (@ 0x00000024) LSE Control Reg                                            */

      struct
      {
        __IOM uint32_t DRIVER : 4;    /*!< [3..0] desc DRIVER                                                        */
        __IOM uint32_t WAITCYCLE : 2; /*!< [5..4] desc WAITCYCLE                                                     */
        __IOM uint32_t MODE : 1;      /*!< [6..6] desc MODE                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t PDRIVER : 4; /*!< [11..8] desc PDRIVER                                                      */
        __IM uint32_t : 5;
        __IOM uint32_t PINLOCK : 1; /*!< [17..17] desc PINLOCK                                                     */
        __IM uint32_t STABLE : 1;   /*!< [18..18] desc STABLE                                                      */
      } LSE_f;
    };
    __IM uint32_t RESERVED;

    union
    {
      __IOM uint32_t DEBUG; /*!< (@ 0x0000002C) Debug Control Reg                                          */

      struct
      {
        __IOM uint32_t ATIM : 1;  /*!< [0..0] desc ATIM                                                          */
        __IOM uint32_t GTIM1 : 1; /*!< [1..1] desc GTIM1                                                         */
        __IOM uint32_t GTIM2 : 1; /*!< [2..2] desc GTIM2                                                         */
        __IM uint32_t : 2;
        __IOM uint32_t BTIM123 : 1; /*!< [5..5] desc BTIM123                                                       */
        __IOM uint32_t LPTIM : 1;   /*!< [6..6] desc LPTIM                                                         */
        __IM uint32_t : 1;
        __IOM uint32_t RTC : 1;  /*!< [8..8] desc RTC                                                           */
        __IOM uint32_t IWDT : 1; /*!< [9..9] desc IWDT                                                          */
      } DEBUG_f;
    };

    union
    {
      __IOM uint32_t AHBEN; /*!< (@ 0x00000030) AHB Clock Control Reg                                      */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t FLASH : 1; /*!< [1..1] desc FLASH                                                         */
        __IOM uint32_t CRC : 1;   /*!< [2..2] desc CRC                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t GPIOA : 1; /*!< [4..4] desc GPIOA                                                         */
        __IOM uint32_t GPIOB : 1; /*!< [5..5] desc GPIOB                                                         */
        __IOM uint32_t GPIOC : 1; /*!< [6..6] desc GPIOC                                                         */
        __IM uint32_t : 9;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } AHBEN_f;
    };

    union
    {
      __IOM uint32_t APBEN2; /*!< (@ 0x00000034) APB Clock Control Reg2                                     */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t RTC : 1;     /*!< [1..1] desc RTC                                                           */
        __IOM uint32_t BTIM123 : 1; /*!< [2..2] desc BTIM123                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t IWDT : 1; /*!< [4..4] desc IWDT                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t I2C : 1;   /*!< [6..6] desc I2C                                                          */
        __IOM uint32_t LPTIM : 1; /*!< [7..7] desc LPTIM                                                         */
        __IM uint32_t : 8;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } APBEN2_f;
    };

    union
    {
      __IOM uint32_t APBEN1; /*!< (@ 0x00000038) APB Clock Control Reg1                                     */

      struct
      {
        __IOM uint32_t ADC : 1;   /*!< [0..0] desc ADC                                                           */
        __IOM uint32_t VC : 1;    /*!< [1..1] desc VC                                                            */
        __IOM uint32_t SPI1 : 1;  /*!< [2..2] desc SPI1                                                          */
        __IOM uint32_t UART1 : 1; /*!< [3..3] desc UART1                                                         */
        __IOM uint32_t UART2 : 1; /*!< [4..4] desc UART2                                                         */
        __IOM uint32_t ATIM : 1;  /*!< [5..5] desc ATIM                                                          */
        __IOM uint32_t GTIM1 : 1; /*!< [6..6] desc GTIM1                                                         */
        __IOM uint32_t GTIM2 : 1; /*!< [7..7] desc GTIM2                                                         */
        __IOM uint32_t UART3 : 1; /*!< [8..8] desc UART3                                                         */
        __IM uint32_t : 7;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } APBEN1_f;
    };
    __IM uint32_t RESERVED1;

    union
    {
      __IOM uint32_t AHBRST; /*!< (@ 0x00000040) AHB Reset Control Reg                                      */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t FLASH : 1; /*!< [1..1] desc FLASH                                                         */
        __IOM uint32_t CRC : 1;   /*!< [2..2] desc CRC                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t GPIOA : 1; /*!< [4..4] desc GPIOA                                                         */
        __IOM uint32_t GPIOB : 1; /*!< [5..5] desc GPIOB                                                         */
        __IOM uint32_t GPIOC : 1; /*!< [6..6] desc GPIOC                                                         */
      } AHBRST_f;
    };

    union
    {
      __IOM uint32_t APBRST2; /*!< (@ 0x00000044) APB Reset Control Reg2                                     */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t RTC : 1;     /*!< [1..1] desc RTC                                                           */
        __IOM uint32_t BTIM123 : 1; /*!< [2..2] desc BTIM123                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t IWDT : 1; /*!< [4..4] desc IWDT                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t I2C : 1;   /*!< [6..6] desc I2C                                                          */
        __IOM uint32_t LPTIM : 1; /*!< [7..7] desc LPTIM                                                         */
      } APBRST2_f;
    };

    union
    {
      __IOM uint32_t APBRST1; /*!< (@ 0x00000048) APB Reset Control Reg1                                     */

      struct
      {
        __IOM uint32_t ADC : 1;   /*!< [0..0] desc ADC                                                           */
        __IOM uint32_t VC : 1;    /*!< [1..1] desc VC                                                            */
        __IOM uint32_t SPI1 : 1;  /*!< [2..2] desc SPI1                                                          */
        __IOM uint32_t UART1 : 1; /*!< [3..3] desc UART1                                                         */
        __IOM uint32_t UART2 : 1; /*!< [4..4] desc UART2                                                         */
        __IOM uint32_t ATIM : 1;  /*!< [5..5] desc ATIM                                                          */
        __IOM uint32_t GTIM1 : 1; /*!< [6..6] desc GTIM1                                                         */
        __IOM uint32_t GTIM2 : 1; /*!< [7..7] desc GTIM2                                                         */
        __IOM uint32_t UART3 : 1; /*!< [8..8] desc UART3                                                         */
      } APBRST1_f;
    };

    union
    {
      __IOM uint32_t RESETFLAG; /*!< (@ 0x0000004C) Reset Status Reg                                           */

      struct
      {
        __IOM uint32_t POR : 1; /*!< [0..0] desc POR                                                           */
        __IM uint32_t : 2;
        __IOM uint32_t LVD : 1;  /*!< [3..3] desc LVD                                                           */
        __IOM uint32_t IWDT : 1; /*!< [4..4] desc IWDT                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t RSTB : 1; /*!< [6..6] desc RSTB                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t LOCKUP : 1;      /*!< [8..8] desc LOCKUP                                                        */
        __IOM uint32_t SYSRESETREQ : 1; /*!< [9..9] desc SYSRESETREQ                                                   */
      } RESETFLAG_f;
    };
    __IM uint32_t RESERVED2[8];

    union
    {
      __IOM uint32_t MCO; /*!< (@ 0x00000070) Master Clock Output Control Reg                            */

      struct
      {
        __IOM uint32_t SOURCE : 4; /*!< [3..0] desc SOURCE                                                        */
        __IOM uint32_t DIV : 3;    /*!< [6..4] desc DIV                                                           */
      } MCO_f;
    };
  } SYSCTRL_TypeDef; /*!< Size = 116 (0x74)                                                         */

  /* =========================================================================================================================== */
  /* ================                                            VC1                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc VC1 (VC1)
   */

  typedef struct
  { /*!< (@ 0x400000A4) VC1 Structure                                              */

    union
    {
      __IOM uint32_t CR0; /*!< (@ 0x00000000) Control register0                                          */

      struct
      {
        __IOM uint32_t EN : 1;     /*!< [0..0] desc EN                                                            */
        __IOM uint32_t RESP : 1;   /*!< [1..1] desc RESP                                                          */
        __IOM uint32_t HYS : 1;    /*!< [2..2] desc HYS                                                           */
        __IOM uint32_t IE : 1;     /*!< [3..3] desc IE                                                            */
        __IOM uint32_t POL : 1;    /*!< [4..4] desc POL                                                           */
        __IOM uint32_t WINDOW : 1; /*!< [5..5] desc WINDOW                                                        */
        __IOM uint32_t INP : 2;    /*!< [7..6] desc INP                                                           */
        __IOM uint32_t INN : 2;    /*!< [9..8] desc INN                                                           */
      } CR0_f;
    };

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000004) Control register1                                          */

      struct
      {
        __IOM uint32_t FLTTIME : 4;    /*!< [3..0] desc FLTTIME                                                       */
        __IOM uint32_t FLTCLK : 1;     /*!< [4..4] desc FLTCLK                                                        */
        __IOM uint32_t FALLIE : 1;     /*!< [5..5] desc FALLIE                                                        */
        __IOM uint32_t RISEIE : 1;     /*!< [6..6] desc RISEIE                                                        */
        __IOM uint32_t HIGHIE : 1;     /*!< [7..7] desc HIGHIE                                                        */
        __IOM uint32_t BLANKATCH1 : 1; /*!< [8..8] desc BLANKATCH1                                                    */
        __IOM uint32_t BLANKATCH2 : 1; /*!< [9..9] desc BLANKATCH2                                                    */
        __IOM uint32_t BLANKATCH3 : 1; /*!< [10..10] desc BLANKATCH3                                                  */
        __IOM uint32_t BLANKATCH4 : 1; /*!< [11..11] desc BLANKATCH4                                                  */
        __IOM uint32_t BLANKATCH5 : 1; /*!< [12..12] desc BLANKATCH5                                                  */
        __IOM uint32_t BLANKATCH6 : 1; /*!< [13..13] desc BLANKATCH6                                                  */
        __IOM uint32_t BLANKTIME : 3;  /*!< [16..14] desc BLANKTIME                                                   */
        __IOM uint32_t BLANKLVL : 1;   /*!< [17..17] desc BLANKLVL                                                    */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t SR; /*!< (@ 0x00000008) Status register                                            */

      struct
      {
        __IOM uint32_t INTF : 1; /*!< [0..0] desc INTF                                                          */
        __IM uint32_t FLTV : 1;  /*!< [1..1] desc FLTV                                                          */
      } SR_f;
    };
  } VC_TypeDef; /*!< Size = 12 (0x0C)                                                          */

  /* =========================================================================================================================== */
  /* ================                                           VCDIV                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc VCDIV (VCDIV)
   */

  typedef struct
  { /*!< (@ 0x400000A0) VCDIV Structure                                            */

    union
    {
      __IOM uint32_t DIV; /*!< (@ 0x00000000) VCREF Control register                                     */

      struct
      {
        __IOM uint32_t DIV : 3; /*!< [2..0] desc DIV                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t EN : 1;  /*!< [4..4] desc EN                                                            */
        __IOM uint32_t VIN : 1; /*!< [5..5] desc VIN                                                           */
      } DIV_f;
    };
  } VCDIV_TypeDef; /*!< Size = 4 (0x4)                                                            */

