zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
#define ATIM_CCMR2CAP_IC4PSC_Pos (10UL)    /*!< IC4PSC (Bit 10)                                       */
#define ATIM_CCMR2CAP_IC4PSC_Msk (0xc00UL) /*!< IC4PSC (Bitfield-Mask: 0x03)                          */
#define ATIM_CCMR2CAP_CC4S_Pos (8UL)       /*!< CC4S (Bit 8)                                          */
#define ATIM_CCMR2CAP_CC4S_Msk (0x300UL)   /*!< CC4S (Bitfield-Mask: 0x03)                            */
#define ATIM_CCMR2CAP_IC3F_Pos (4UL)       /*!< IC3F (Bit 4)                                          */
#define ATIM_CCMR2CAP_IC3F_Msk (0xf0UL)    /*!< IC3F (Bitfield-Mask: 0x0f)                            */
#define ATIM_CCMR2CAP_IC3PSC_Pos (2UL)     /*!< IC3PSC (Bit 2)                                        */
#define ATIM_CCMR2CAP_IC3PSC_Msk (0xcUL)   /*!< IC3PSC (Bitfield-Mask: 0x03)                          */
#define ATIM_CCMR2CAP_CC3S_Pos (0UL)       /*!< CC3S (Bit 0)                                          */
#define ATIM_CCMR2CAP_CC3S_Msk (0x3UL)     /*!< CC3S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR2CMP  ======================================================== */
#define ATIM_CCMR2CMP_OC4MH_Pos (24UL)        /*!< OC4MH (Bit 24)                                        */
#define ATIM_CCMR2CMP_OC4MH_Msk (0x1000000UL) /*!< OC4MH (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_OC3MH_Pos (16UL)        /*!< OC3MH (Bit 16)                                        */
#define ATIM_CCMR2CMP_OC3MH_Msk (0x10000UL)   /*!< OC3MH (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_OC4CE_Pos (15UL)        /*!< OC4CE (Bit 15)                                        */
#define ATIM_CCMR2CMP_OC4CE_Msk (0x8000UL)    /*!< OC4CE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_OC4M_Pos (12UL)         /*!< OC4M (Bit 12)                                         */
#define ATIM_CCMR2CMP_OC4M_Msk (0x7000UL)     /*!< OC4M (Bitfield-Mask: 0x07)                            */
#define ATIM_CCMR2CMP_OC4PE_Pos (11UL)        /*!< OC4PE (Bit 11)                                        */
#define ATIM_CCMR2CMP_OC4PE_Msk (0x800UL)     /*!< OC4PE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_OC4FE_Pos (10UL)        /*!< OC4FE (Bit 10)                                        */
#define ATIM_CCMR2CMP_OC4FE_Msk (0x400UL)     /*!< OC4FE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_CC4S_Pos (8UL)          /*!< CC4S (Bit 8)                                          */
#define ATIM_CCMR2CMP_CC4S_Msk (0x300UL)      /*!< CC4S (Bitfield-Mask: 0x03)                            */
#define ATIM_CCMR2CMP_OC3CE_Pos (7UL)         /*!< OC3CE (Bit 7)                                         */
#define ATIM_CCMR2CMP_OC3CE_Msk (0x80UL)      /*!< OC3CE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_OC3M_Pos (4UL)          /*!< OC3M (Bit 4)                                          */
#define ATIM_CCMR2CMP_OC3M_Msk (0x70UL)       /*!< OC3M (Bitfield-Mask: 0x07)                            */
#define ATIM_CCMR2CMP_OC3PE_Pos (3UL)         /*!< OC3PE (Bit 3)                                         */
#define ATIM_CCMR2CMP_OC3PE_Msk (0x8UL)       /*!< OC3PE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_OC3FE_Pos (2UL)         /*!< OC3FE (Bit 2)                                         */
#define ATIM_CCMR2CMP_OC3FE_Msk (0x4UL)       /*!< OC3FE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_CC3S_Pos (0UL)          /*!< CC3S (Bit 0)                                          */
#define ATIM_CCMR2CMP_CC3S_Msk (0x3UL)        /*!< CC3S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR3CAP  ======================================================== */
#define ATIM_CCMR3CAP_IC6F_Pos (12UL)      /*!< IC6F (Bit 12)                                         */
#define ATIM_CCMR3CAP_IC6F_Msk (0xf000UL)  /*!< IC6F (Bitfield-Mask: 0x0f)                            */
#define ATIM_CCMR3CAP_IC6PSC_Pos (10UL)    /*!< IC6PSC (Bit 10)                                       */
#define ATIM_CCMR3CAP_IC6PSC_Msk (0xc00UL) /*!< IC6PSC (Bitfield-Mask: 0x03)                          */
#define ATIM_CCMR3CAP_CC6S_Pos (8UL)       /*!< CC6S (Bit 8)                                          */
#define ATIM_CCMR3CAP_CC6S_Msk (0x300UL)   /*!< CC6S (Bitfield-Mask: 0x03)                            */
#define ATIM_CCMR3CAP_IC5F_Pos (4UL)       /*!< IC5F (Bit 4)                                          */
#define ATIM_CCMR3CAP_IC5F_Msk (0xf0UL)    /*!< IC5F (Bitfield-Mask: 0x0f)                            */
#define ATIM_CCMR3CAP_IC5PSC_Pos (2UL)     /*!< IC5PSC (Bit 2)                                        */
#define ATIM_CCMR3CAP_IC5PSC_Msk (0xcUL)   /*!< IC5PSC (Bitfield-Mask: 0x03)                          */
#define ATIM_CCMR3CAP_CC5S_Pos (0UL)       /*!< CC5S (Bit 0)                                          */
#define ATIM_CCMR3CAP_CC5S_Msk (0x3UL)     /*!< CC5S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR3CMP  ======================================================== */
#define ATIM_CCMR3CMP_OC6MH_Pos (24UL)        /*!< OC6MH (Bit 24)                                        */
#define ATIM_CCMR3CMP_OC6MH_Msk (0x1000000UL) /*!< OC6MH (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_OC5MH_Pos (16UL)        /*!< OC5MH (Bit 16)                                        */
#define ATIM_CCMR3CMP_OC5MH_Msk (0x10000UL)   /*!< OC5MH (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_OC6CE_Pos (15UL)        /*!< OC6CE (Bit 15)                                        */
#define ATIM_CCMR3CMP_OC6CE_Msk (0x8000UL)    /*!< OC6CE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_OC6M_Pos (12UL)         /*!< OC6M (Bit 12)                                         */
#define ATIM_CCMR3CMP_OC6M_Msk (0x7000UL)     /*!< OC6M (Bitfield-Mask: 0x07)                            */
#define ATIM_CCMR3CMP_OC6PE_Pos (11UL)        /*!< OC6PE (Bit 11)                                        */
#define ATIM_CCMR3CMP_OC6PE_Msk (0x800UL)     /*!< OC6PE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_OC6FE_Pos (10UL)        /*!< OC6FE (Bit 10)                                        */
#define ATIM_CCMR3CMP_OC6FE_Msk (0x400UL)     /*!< OC6FE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_CC6S_Pos (8UL)          /*!< CC6S (Bit 8)                                          */
#define ATIM_CCMR3CMP_CC6S_Msk (0x300UL)      /*!< CC6S (Bitfield-Mask: 0x03)                            */
#define ATIM_CCMR3CMP_OC5CE_Pos (7UL)         /*!< OC5CE (Bit 7)                                         */
#define ATIM_CCMR3CMP_OC5CE_Msk (0x80UL)      /*!< OC5CE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_OC5M_Pos (4UL)          /*!< OC5M (Bit 4)                                          */
#define ATIM_CCMR3CMP_OC5M_Msk (0x70UL)       /*!< OC5M (Bitfield-Mask: 0x07)                            */
#define ATIM_CCMR3CMP_OC5PE_Pos (3UL)         /*!< OC5PE (Bit 3)                                         */
#define ATIM_CCMR3CMP_OC5PE_Msk (0x8UL)       /*!< OC5PE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_OC5FE_Pos (2UL)         /*!< OC5FE (Bit 2)                                         */
#define ATIM_CCMR3CMP_OC5FE_Msk (0x4UL)       /*!< OC5FE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_CC5S_Pos (0UL)          /*!< CC5S (Bit 0)                                          */
#define ATIM_CCMR3CMP_CC5S_Msk (0x3UL)        /*!< CC5S (Bitfield-Mask: 0x03)                            */
/* =========================================================  CCER  ========================================================== */
#define ATIM_CCER_CC6NP_Pos (23UL)       /*!< CC6NP (Bit 23)                                        */
#define ATIM_CCER_CC6NP_Msk (0x800000UL) /*!< CC6NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC6NE_Pos (22UL)       /*!< CC6NE (Bit 22)                                        */
#define ATIM_CCER_CC6NE_Msk (0x400000UL) /*!< CC6NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC6P_Pos (21UL)        /*!< CC6P (Bit 21)                                         */
#define ATIM_CCER_CC6P_Msk (0x200000UL)  /*!< CC6P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC6E_Pos (20UL)        /*!< CC6E (Bit 20)                                         */
#define ATIM_CCER_CC6E_Msk (0x100000UL)  /*!< CC6E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC5NP_Pos (19UL)       /*!< CC5NP (Bit 19)                                        */
#define ATIM_CCER_CC5NP_Msk (0x80000UL)  /*!< CC5NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC5NE_Pos (18UL)       /*!< CC5NE (Bit 18)                                        */
#define ATIM_CCER_CC5NE_Msk (0x40000UL)  /*!< CC5NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC5P_Pos (17UL)        /*!< CC5P (Bit 17)                                         */
#define ATIM_CCER_CC5P_Msk (0x20000UL)   /*!< CC5P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC5E_Pos (16UL)        /*!< CC5E (Bit 16)                                         */
#define ATIM_CCER_CC5E_Msk (0x10000UL)   /*!< CC5E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC4NP_Pos (15UL)       /*!< CC4NP (Bit 15)                                        */
#define ATIM_CCER_CC4NP_Msk (0x8000UL)   /*!< CC4NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC4NE_Pos (14UL)       /*!< CC4NE (Bit 14)                                        */
#define ATIM_CCER_CC4NE_Msk (0x4000UL)   /*!< CC4NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC4P_Pos (13UL)        /*!< CC4P (Bit 13)                                         */
#define ATIM_CCER_CC4P_Msk (0x2000UL)    /*!< CC4P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC4E_Pos (12UL)        /*!< CC4E (Bit 12)                                         */
#define ATIM_CCER_CC4E_Msk (0x1000UL)    /*!< CC4E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC3NP_Pos (11UL)       /*!< CC3NP (Bit 11)                                        */
#define ATIM_CCER_CC3NP_Msk (0x800UL)    /*!< CC3NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC3NE_Pos (10UL)       /*!< CC3NE (Bit 10)                                        */
#define ATIM_CCER_CC3NE_Msk (0x400UL)    /*!< CC3NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC3P_Pos (9UL)         /*!< CC3P (Bit 9)                                          */
#define ATIM_CCER_CC3P_Msk (0x200UL)     /*!< CC3P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC3E_Pos (8UL)         /*!< CC3E (Bit 8)                                          */
#define ATIM_CCER_CC3E_Msk (0x100UL)     /*!< CC3E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC2NP_Pos (7UL)        /*!< CC2NP (Bit 7)                                         */
#define ATIM_CCER_CC2NP_Msk (0x80UL)     /*!< CC2NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC2NE_Pos (6UL)        /*!< CC2NE (Bit 6)                                         */
#define ATIM_CCER_CC2NE_Msk (0x40UL)     /*!< CC2NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC2P_Pos (5UL)         /*!< CC2P (Bit 5)                                          */
#define ATIM_CCER_CC2P_Msk (0x20UL)      /*!< CC2P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC2E_Pos (4UL)         /*!< CC2E (Bit 4)                                          */
#define ATIM_CCER_CC2E_Msk (0x10UL)      /*!< CC2E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC1NP_Pos (3UL)        /*!< CC1NP (Bit 3)                                         */
#define ATIM_CCER_CC1NP_Msk (0x8UL)      /*!< CC1NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC1NE_Pos (2UL)        /*!< CC1NE (Bit 2)                                         */
#define ATIM_CCER_CC1NE_Msk (0x4UL)      /*!< CC1NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC1P_Pos (1UL)         /*!< CC1P (Bit 1)                                          */
#define ATIM_CCER_CC1P_Msk (0x2UL)       /*!< CC1P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC1E_Pos (0UL)         /*!< CC1E (Bit 0)                                          */
#define ATIM_CCER_CC1E_Msk (0x1UL)       /*!< CC1E (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CNT  ========================================================== */
#define ATIM_CNT_UIFCPY_Pos (31UL)         /*!< UIFCPY (Bit 31)                                       */
#define ATIM_CNT_UIFCPY_Msk (0x80000000UL) /*!< UIFCPY (Bitfield-Mask: 0x01)                          */
#define ATIM_CNT_CNT_Pos (0UL)             /*!< CNT (Bit 0)                                           */
#define ATIM_CNT_CNT_Msk (0xffffUL)        /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define ATIM_PSC_PSC_Pos (0UL)      /*!< PSC (Bit 0)                                           */
#define ATIM_PSC_PSC_Msk (0xffffUL) /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  ARR  ========================================================== */
#define ATIM_ARR_ARR_Pos (0UL)      /*!< ARR (Bit 0)                                           */
#define ATIM_ARR_ARR_Msk (0xffffUL) /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  RCR  ========================================================== */
#define ATIM_RCR_REP_Pos (0UL)      /*!< REP (Bit 0)                                           */
#define ATIM_RCR_REP_Msk (0xffffUL) /*!< REP (Bitfield-Mask: 0xffff)                           */
/* =========================================================  CCR1  ========================================================== */
#define ATIM_CCR1_CCR1_Pos (0UL)      /*!< CCR1 (Bit 0)                                          */
#define ATIM_CCR1_CCR1_Msk (0xffffUL) /*!< CCR1 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR2  ========================================================== */
#define ATIM_CCR2_CCR2_Pos (0UL)      /*!< CCR2 (Bit 0)                                          */
#define ATIM_CCR2_CCR2_Msk (0xffffUL) /*!< CCR2 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR3  ========================================================== */
#define ATIM_CCR3_CCR3_Pos (0UL)      /*!< CCR3 (Bit 0)                                          */
#define ATIM_CCR3_CCR3_Msk (0xffffUL) /*!< CCR3 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR4  ========================================================== */
#define ATIM_CCR4_CCR4_Pos (0UL)      /*!< CCR4 (Bit 0)                                          */
#define ATIM_CCR4_CCR4_Msk (0xffffUL) /*!< CCR4 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR5  ========================================================== */
#define ATIM_CCR5_GC5C6_Pos (31UL)         /*!< GC5C6 (Bit 31)                                        */
#define ATIM_CCR5_GC5C6_Msk (0x80000000UL) /*!< GC5C6 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C5_Pos (30UL)         /*!< GC5C5 (Bit 30)                                        */
#define ATIM_CCR5_GC5C5_Msk (0x40000000UL) /*!< GC5C5 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C4_Pos (29UL)         /*!< GC5C4 (Bit 29)                                        */
#define ATIM_CCR5_GC5C4_Msk (0x20000000UL) /*!< GC5C4 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C3_Pos (28UL)         /*!< GC5C3 (Bit 28)                                        */
#define ATIM_CCR5_GC5C3_Msk (0x10000000UL) /*!< GC5C3 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C2_Pos (27UL)         /*!< GC5C2 (Bit 27)                                        */
#define ATIM_CCR5_GC5C2_Msk (0x8000000UL)  /*!< GC5C2 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C1_Pos (26UL)         /*!< GC5C1 (Bit 26)                                        */
#define ATIM_CCR5_GC5C1_Msk (0x4000000UL)  /*!< GC5C1 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_CCR5_Pos (0UL)           /*!< CCR5 (Bit 0)                                          */
#define ATIM_CCR5_CCR5_Msk (0xffffUL)      /*!< CCR5 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR6  ========================================================== */
#define ATIM_CCR6_GC6C6_Pos (31UL)         /*!< GC6C6 (Bit 31)                                        */
#define ATIM_CCR6_GC6C6_Msk (0x80000000UL) /*!< GC6C6 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C5_Pos (30UL)         /*!< GC6C5 (Bit 30)                                        */
#define ATIM_CCR6_GC6C5_Msk (0x40000000UL) /*!< GC6C5 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C4_Pos (29UL)         /*!< GC6C4 (Bit 29)                                        */
#define ATIM_CCR6_GC6C4_Msk (0x20000000UL) /*!< GC6C4 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C3_Pos (28UL)         /*!< GC6C3 (Bit 28)                                        */
#define ATIM_CCR6_GC6C3_Msk (0x10000000UL) /*!< GC6C3 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C2_Pos (27UL)         /*!< GC6C2 (Bit 27)                                        */
#define ATIM_CCR6_GC6C2_Msk (0x8000000UL)  /*!< GC6C2 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C1_Pos (26UL)         /*!< GC6C1 (Bit 26)                                        */
#define ATIM_CCR6_GC6C1_Msk (0x4000000UL)  /*!< GC6C1 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_CCR6_Pos (0UL)           /*!< CCR6 (Bit 0)                                          */
#define ATIM_CCR6_CCR6_Msk (0xffffUL)      /*!< CCR6 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  BDTR  ========================================================== */
#define ATIM_BDTR_BK2P_Pos (25UL)        /*!< BK2P (Bit 25)                                         */
#define ATIM_BDTR_BK2P_Msk (0x2000000UL) /*!< BK2P (Bitfield-Mask: 0x01)                            */
#define ATIM_BDTR_BK2E_Pos (24UL)        /*!< BK2E (Bit 24)                                         */
#define ATIM_BDTR_BK2E_Msk (0x1000000UL) /*!< BK2E (Bitfield-Mask: 0x01)                            */
#define ATIM_BDTR_BK2F_Pos (20UL)        /*!< BK2F (Bit 20)                                         */
#define ATIM_BDTR_BK2F_Msk (0xf00000UL)  /*!< BK2F (Bitfield-Mask: 0x0f)                            */
#define ATIM_BDTR_BKF_Pos (16UL)         /*!< BKF (Bit 16)                                          */
#define ATIM_BDTR_BKF_Msk (0xf0000UL)    /*!< BKF (Bitfield-Mask: 0x0f)                             */
#define ATIM_BDTR_MOE_Pos (15UL)         /*!< MOE (Bit 15)                                          */
#define ATIM_BDTR_MOE_Msk (0x8000UL)     /*!< MOE (Bitfield-Mask: 0x01)                             */
#define ATIM_BDTR_AOE_Pos (14UL)         /*!< AOE (Bit 14)                                          */
#define ATIM_BDTR_AOE_Msk (0x4000UL)     /*!< AOE (Bitfield-Mask: 0x01)                             */
#define ATIM_BDTR_BKP_Pos (13UL)         /*!< BKP (Bit 13)                                          */
#define ATIM_BDTR_BKP_Msk (0x2000UL)     /*!< BKP (Bitfield-Mask: 0x01)                             */
#define ATIM_BDTR_BKE_Pos (12UL)         /*!< BKE (Bit 12)                                          */
#define ATIM_BDTR_BKE_Msk (0x1000UL)     /*!< BKE (Bitfield-Mask: 0x01)                             */
#define ATIM_BDTR_OSSR_Pos (11UL)        /*!< OSSR (Bit 11)                                         */
#define ATIM_BDTR_OSSR_Msk (0x800UL)     /*!< OSSR (Bitfield-Mask: 0x01)                            */
#define ATIM_BDTR_OSSI_Pos (10UL)        /*!< OSSI (Bit 10)                                         */
#define ATIM_BDTR_OSSI_Msk (0x400UL)     /*!< OSSI (Bitfield-Mask: 0x01)                            */
#define ATIM_BDTR_LOCK_Pos (8UL)         /*!< LOCK (Bit 8)                                          */
#define ATIM_BDTR_LOCK_Msk (0x300UL)     /*!< LOCK (Bitfield-Mask: 0x03)                            */
#define ATIM_BDTR_DTG_Pos (0UL)          /*!< DTG (Bit 0)                                           */
#define ATIM_BDTR_DTG_Msk (0xffUL)       /*!< DTG (Bitfield-Mask: 0xff)                             */
/* =========================================================  DTR2  ========================================================== */
#define ATIM_DTR2_DTPE_Pos (17UL)      /*!< DTPE (Bit 17)                                         */
#define ATIM_DTR2_DTPE_Msk (0x20000UL) /*!< DTPE (Bitfield-Mask: 0x01)                            */
#define ATIM_DTR2_DTAE_Pos (16UL)      /*!< DTAE (Bit 16)                                         */
#define ATIM_DTR2_DTAE_Msk (0x10000UL) /*!< DTAE (Bitfield-Mask: 0x01)                            */
#define ATIM_DTR2_DTGF_Pos (0UL)       /*!< DTGF (Bit 0)                                          */
#define ATIM_DTR2_DTGF_Msk (0xffUL)    /*!< DTGF (Bitfield-Mask: 0xff)                            */
/* ==========================================================  ECR  ========================================================== */
#define ATIM_ECR_IPOS_Pos (6UL)    /*!< IPOS (Bit 6)                                          */
#define ATIM_ECR_IPOS_Msk (0xc0UL) /*!< IPOS (Bitfield-Mask: 0x03)                            */
#define ATIM_ECR_FIDX_Pos (5UL)    /*!< FIDX (Bit 5)                                          */
#define ATIM_ECR_FIDX_Msk (0x20UL) /*!< FIDX (Bitfield-Mask: 0x01)                            */
#define ATIM_ECR_IDIR_Pos (1UL)    /*!< IDIR (Bit 1)                                          */
#define ATIM_ECR_IDIR_Msk (0x6UL)  /*!< IDIR (Bitfield-Mask: 0x03)                            */
#define ATIM_ECR_IE_Pos (0UL)      /*!< IE (Bit 0)                                            */
#define ATIM_ECR_IE_Msk (0x1UL)    /*!< IE (Bitfield-Mask: 0x01)                              */
/* ========================================================  TISEL1  ========================================================= */
#define ATIM_TISEL1_TI4SEL_Pos (24UL)        /*!< TI4SEL (Bit 24)                                       */
#define ATIM_TISEL1_TI4SEL_Msk (0xf000000UL) /*!< TI4SEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_TISEL1_TI3SEL_Pos (16UL)        /*!< TI3SEL (Bit 16)                                       */
#define ATIM_TISEL1_TI3SEL_Msk (0xf0000UL)   /*!< TI3SEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_TISEL1_TI2SEL_Pos (8UL)         /*!< TI2SEL (Bit 8)                                        */
