zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
#define ATIM_TISEL1_TI2SEL_Msk (0xf00UL)     /*!< TI2SEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_TISEL1_TI1SEL_Pos (0UL)         /*!< TI1SEL (Bit 0)                                        */
#define ATIM_TISEL1_TI1SEL_Msk (0xfUL)       /*!< TI1SEL (Bitfield-Mask: 0x0f)                          */
/* ========================================================  TISEL2  ========================================================= */
#define ATIM_TISEL2_TI6SEL_Pos (8UL)     /*!< TI6SEL (Bit 8)                                        */
#define ATIM_TISEL2_TI6SEL_Msk (0xf00UL) /*!< TI6SEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_TISEL2_TI5SEL_Pos (0UL)     /*!< TI5SEL (Bit 0)                                        */
#define ATIM_TISEL2_TI5SEL_Msk (0xfUL)   /*!< TI5SEL (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  AF1  ========================================================== */
#define ATIM_AF1_ETRSEL_Pos (14UL)      /*!< ETRSEL (Bit 14)                                       */
#define ATIM_AF1_ETRSEL_Msk (0x3c000UL) /*!< ETRSEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_AF1_BKVC2P_Pos (11UL)      /*!< BKVC2P (Bit 11)                                       */
#define ATIM_AF1_BKVC2P_Msk (0x800UL)   /*!< BKVC2P (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKVC1P_Pos (10UL)      /*!< BKVC1P (Bit 10)                                       */
#define ATIM_AF1_BKVC1P_Msk (0x400UL)   /*!< BKVC1P (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKINP_Pos (9UL)        /*!< BKINP (Bit 9)                                         */
#define ATIM_AF1_BKINP_Msk (0x200UL)    /*!< BKINP (Bitfield-Mask: 0x01)                           */
#define ATIM_AF1_BKVC2E_Pos (2UL)       /*!< BKVC2E (Bit 2)                                        */
#define ATIM_AF1_BKVC2E_Msk (0x4UL)     /*!< BKVC2E (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKVC1E_Pos (1UL)       /*!< BKVC1E (Bit 1)                                        */
#define ATIM_AF1_BKVC1E_Msk (0x2UL)     /*!< BKVC1E (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKINE_Pos (0UL)        /*!< BKINE (Bit 0)                                         */
#define ATIM_AF1_BKINE_Msk (0x1UL)      /*!< BKINE (Bitfield-Mask: 0x01)                           */
/* ==========================================================  AF2  ========================================================== */
#define ATIM_AF2_OCRSEL_Pos (16UL)      /*!< OCRSEL (Bit 16)                                       */
#define ATIM_AF2_OCRSEL_Msk (0x70000UL) /*!< OCRSEL (Bitfield-Mask: 0x07)                          */
#define ATIM_AF2_BK2VC2P_Pos (11UL)     /*!< BK2VC2P (Bit 11)                                      */
#define ATIM_AF2_BK2VC2P_Msk (0x800UL)  /*!< BK2VC2P (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2VC1P_Pos (10UL)     /*!< BK2VC1P (Bit 10)                                      */
#define ATIM_AF2_BK2VC1P_Msk (0x400UL)  /*!< BK2VC1P (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2INP_Pos (9UL)       /*!< BK2INP (Bit 9)                                        */
#define ATIM_AF2_BK2INP_Msk (0x200UL)   /*!< BK2INP (Bitfield-Mask: 0x01)                          */
#define ATIM_AF2_BK2VC2E_Pos (2UL)      /*!< BK2VC2E (Bit 2)                                       */
#define ATIM_AF2_BK2VC2E_Msk (0x4UL)    /*!< BK2VC2E (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2VC1E_Pos (1UL)      /*!< BK2VC1E (Bit 1)                                       */
#define ATIM_AF2_BK2VC1E_Msk (0x2UL)    /*!< BK2VC1E (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2INE_Pos (0UL)       /*!< BK2INE (Bit 0)                                        */
#define ATIM_AF2_BK2INE_Msk (0x1UL)     /*!< BK2INE (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ICR  ========================================================== */
#define ATIM_ICR_TERRF_Pos (23UL)       /*!< TERRF (Bit 23)                                        */
#define ATIM_ICR_TERRF_Msk (0x800000UL) /*!< TERRF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_IERRF_Pos (22UL)       /*!< IERRF (Bit 22)                                        */
#define ATIM_ICR_IERRF_Msk (0x400000UL) /*!< IERRF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_DIRF_Pos (21UL)        /*!< DIRF (Bit 21)                                         */
#define ATIM_ICR_DIRF_Msk (0x200000UL)  /*!< DIRF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_IDXF_Pos (20UL)        /*!< IDXF (Bit 20)                                         */
#define ATIM_ICR_IDXF_Msk (0x100000UL)  /*!< IDXF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_CC6OF_Pos (19UL)       /*!< CC6OF (Bit 19)                                        */
#define ATIM_ICR_CC6OF_Msk (0x80000UL)  /*!< CC6OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC5OF_Pos (18UL)       /*!< CC5OF (Bit 18)                                        */
#define ATIM_ICR_CC5OF_Msk (0x40000UL)  /*!< CC5OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC6IF_Pos (17UL)       /*!< CC6IF (Bit 17)                                        */
#define ATIM_ICR_CC6IF_Msk (0x20000UL)  /*!< CC6IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC5IF_Pos (16UL)       /*!< CC5IF (Bit 16)                                        */
#define ATIM_ICR_CC5IF_Msk (0x10000UL)  /*!< CC5IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_SBIF_Pos (13UL)        /*!< SBIF (Bit 13)                                         */
#define ATIM_ICR_SBIF_Msk (0x2000UL)    /*!< SBIF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_CC4OF_Pos (12UL)       /*!< CC4OF (Bit 12)                                        */
#define ATIM_ICR_CC4OF_Msk (0x1000UL)   /*!< CC4OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC3OF_Pos (11UL)       /*!< CC3OF (Bit 11)                                        */
#define ATIM_ICR_CC3OF_Msk (0x800UL)    /*!< CC3OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC2OF_Pos (10UL)       /*!< CC2OF (Bit 10)                                        */
#define ATIM_ICR_CC2OF_Msk (0x400UL)    /*!< CC2OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC1OF_Pos (9UL)        /*!< CC1OF (Bit 9)                                         */
#define ATIM_ICR_CC1OF_Msk (0x200UL)    /*!< CC1OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_B2IF_Pos (8UL)         /*!< B2IF (Bit 8)                                          */
#define ATIM_ICR_B2IF_Msk (0x100UL)     /*!< B2IF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_BIF_Pos (7UL)          /*!< BIF (Bit 7)                                           */
#define ATIM_ICR_BIF_Msk (0x80UL)       /*!< BIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ICR_TIF_Pos (6UL)          /*!< TIF (Bit 6)                                           */
#define ATIM_ICR_TIF_Msk (0x40UL)       /*!< TIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ICR_COMIF_Pos (5UL)        /*!< COMIF (Bit 5)                                         */
#define ATIM_ICR_COMIF_Msk (0x20UL)     /*!< COMIF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC4IF_Pos (4UL)        /*!< CC4IF (Bit 4)                                         */
#define ATIM_ICR_CC4IF_Msk (0x10UL)     /*!< CC4IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC3IF_Pos (3UL)        /*!< CC3IF (Bit 3)                                         */
#define ATIM_ICR_CC3IF_Msk (0x8UL)      /*!< CC3IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC2IF_Pos (2UL)        /*!< CC2IF (Bit 2)                                         */
#define ATIM_ICR_CC2IF_Msk (0x4UL)      /*!< CC2IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC1IF_Pos (1UL)        /*!< CC1IF (Bit 1)                                         */
#define ATIM_ICR_CC1IF_Msk (0x2UL)      /*!< CC1IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_UIF_Pos (0UL)          /*!< UIF (Bit 0)                                           */
#define ATIM_ICR_UIF_Msk (0x1UL)        /*!< UIF (Bitfield-Mask: 0x01)                             */

/* =========================================================================================================================== */
/* ================                                           BTIM                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR1  ========================================================== */
#define BTIMx_CR1_TOGEN_Pos (15UL)       /*!< TOGEN (Bit 15)                                        */
#define BTIMx_CR1_TOGEN_Msk (0x8000UL)   /*!< TOGEN (Bitfield-Mask: 0x01)                           */
#define BTIMx_CR1_UIFREMAP_Pos (11UL)    /*!< UIFREMAP (Bit 11)                                     */
#define BTIMx_CR1_UIFREMAP_Msk (0x800UL) /*!< UIFREMAP (Bitfield-Mask: 0x01)                        */
#define BTIMx_CR1_ONESHOT_Pos (3UL)      /*!< ONESHOT (Bit 3)                                       */
#define BTIMx_CR1_ONESHOT_Msk (0x8UL)    /*!< ONESHOT (Bitfield-Mask: 0x01)                         */
#define BTIMx_CR1_URS_Pos (2UL)          /*!< URS (Bit 2)                                           */
#define BTIMx_CR1_URS_Msk (0x4UL)        /*!< URS (Bitfield-Mask: 0x01)                             */
#define BTIMx_CR1_UDIS_Pos (1UL)         /*!< UDIS (Bit 1)                                          */
#define BTIMx_CR1_UDIS_Msk (0x2UL)       /*!< UDIS (Bitfield-Mask: 0x01)                            */
#define BTIMx_CR1_EN_Pos (0UL)           /*!< EN (Bit 0)                                            */
#define BTIMx_CR1_EN_Msk (0x1UL)         /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR2  ========================================================== */
#define BTIMx_CR2_MMS_Pos (4UL)    /*!< MMS (Bit 4)                                           */
#define BTIMx_CR2_MMS_Msk (0x70UL) /*!< MMS (Bitfield-Mask: 0x07)                             */
/* =========================================================  SMCR  ========================================================== */
#define BTIMx_SMCR_TRGIPOL_Pos (17UL)      /*!< TRGIPOL (Bit 17)                                      */
#define BTIMx_SMCR_TRGIPOL_Msk (0x20000UL) /*!< TRGIPOL (Bitfield-Mask: 0x01)                         */
#define BTIMx_SMCR_RSTIPOL_Pos (16UL)      /*!< RSTIPOL (Bit 16)                                      */
#define BTIMx_SMCR_RSTIPOL_Msk (0x10000UL) /*!< RSTIPOL (Bitfield-Mask: 0x01)                         */
#define BTIMx_SMCR_TRGIFLT_Pos (12UL)      /*!< TRGIFLT (Bit 12)                                      */
#define BTIMx_SMCR_TRGIFLT_Msk (0x7000UL)  /*!< TRGIFLT (Bitfield-Mask: 0x07)                         */
#define BTIMx_SMCR_MSM_Pos (11UL)          /*!< MSM (Bit 11)                                          */
#define BTIMx_SMCR_MSM_Msk (0x800UL)       /*!< MSM (Bitfield-Mask: 0x01)                             */
#define BTIMx_SMCR_TRGISRC_Pos (7UL)       /*!< TRGISRC (Bit 7)                                       */
#define BTIMx_SMCR_TRGISRC_Msk (0x780UL)   /*!< TRGISRC (Bitfield-Mask: 0x0f)                         */
#define BTIMx_SMCR_RSTISRC_Pos (3UL)       /*!< RSTISRC (Bit 3)                                       */
#define BTIMx_SMCR_RSTISRC_Msk (0x78UL)    /*!< RSTISRC (Bitfield-Mask: 0x0f)                         */
#define BTIMx_SMCR_SMS_Pos (0UL)           /*!< SMS (Bit 0)                                           */
#define BTIMx_SMCR_SMS_Msk (0x7UL)         /*!< SMS (Bitfield-Mask: 0x07)                             */
/* ==========================================================  IER  ========================================================== */
#define BTIMx_IER_TIE_Pos (6UL)    /*!< TIE (Bit 6)                                           */
#define BTIMx_IER_TIE_Msk (0x40UL) /*!< TIE (Bitfield-Mask: 0x01)                             */
#define BTIMx_IER_UIE_Pos (0UL)    /*!< UIE (Bit 0)                                           */
#define BTIMx_IER_UIE_Msk (0x1UL)  /*!< UIE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define BTIMx_ISR_TIF_Pos (6UL)    /*!< TIF (Bit 6)                                           */
#define BTIMx_ISR_TIF_Msk (0x40UL) /*!< TIF (Bitfield-Mask: 0x01)                             */
#define BTIMx_ISR_UIF_Pos (0UL)    /*!< UIF (Bit 0)                                           */
#define BTIMx_ISR_UIF_Msk (0x1UL)  /*!< UIF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  EGR  ========================================================== */
#define BTIMx_EGR_TG_Pos (6UL)    /*!< TG (Bit 6)                                            */
#define BTIMx_EGR_TG_Msk (0x40UL) /*!< TG (Bitfield-Mask: 0x01)                              */
#define BTIMx_EGR_UG_Pos (0UL)    /*!< UG (Bit 0)                                            */
#define BTIMx_EGR_UG_Msk (0x1UL)  /*!< UG (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ICR  ========================================================== */
#define BTIMx_ICR_TIF_Pos (6UL)    /*!< TIF (Bit 6)                                           */
#define BTIMx_ICR_TIF_Msk (0x40UL) /*!< TIF (Bitfield-Mask: 0x01)                             */
#define BTIMx_ICR_UIF_Pos (0UL)    /*!< UIF (Bit 0)                                           */
#define BTIMx_ICR_UIF_Msk (0x1UL)  /*!< UIF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  CNT  ========================================================== */
#define BTIMx_CNT_UIFCPY_Pos (31UL)         /*!< UIFCPY (Bit 31)                                       */
#define BTIMx_CNT_UIFCPY_Msk (0x80000000UL) /*!< UIFCPY (Bitfield-Mask: 0x01)                          */
#define BTIMx_CNT_CNT_Pos (0UL)             /*!< CNT (Bit 0)                                           */
#define BTIMx_CNT_CNT_Msk (0xffffUL)        /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define BTIMx_PSC_PSC_Pos (0UL)      /*!< PSC (Bit 0)                                           */
#define BTIMx_PSC_PSC_Msk (0xffffUL) /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  ARR  ========================================================== */
#define BTIMx_ARR_ARR_Pos (0UL)      /*!< ARR (Bit 0)                                           */
#define BTIMx_ARR_ARR_Msk (0xffffUL) /*!< ARR (Bitfield-Mask: 0xffff)                           */

/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define CRC_CR_MODE_Pos (0UL)   /*!< MODE (Bit 0)                                          */
#define CRC_CR_MODE_Msk (0xfUL) /*!< MODE (Bitfield-Mask: 0x0f)                            */
/* ==========================================================  DR  =========================================================== */
#define CRC_DR_DR_Pos (0UL)    /*!< DR (Bit 0)                                            */
#define CRC_DR_DR_Msk (0xffUL) /*!< DR (Bitfield-Mask: 0xff)                              */
/* ========================================================  RESULT  ========================================================= */
#define CRC_RESULT_RESULT_Pos (0UL)      /*!< RESULT (Bit 0)                                        */
#define CRC_RESULT_RESULT_Msk (0xffffUL) /*!< RESULT (Bitfield-Mask: 0xffff)                        */

/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */

