zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
/* ==========================================================  CR1  ========================================================== */
#define FLASH_CR1_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define FLASH_CR1_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_CR1_SECURITY_Pos (5UL)     /*!< SECURITY (Bit 5)                                      */
#define FLASH_CR1_SECURITY_Msk (0x60UL)  /*!< SECURITY (Bitfield-Mask: 0x03)                        */
#define FLASH_CR1_MODE_Pos (0UL)         /*!< MODE (Bit 0)                                          */
#define FLASH_CR1_MODE_Msk (0x3UL)       /*!< MODE (Bitfield-Mask: 0x03)                            */
/* ==========================================================  CR2  ========================================================== */
#define FLASH_CR2_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define FLASH_CR2_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_CR2_WAIT_Pos (0UL)         /*!< WAIT (Bit 0)                                          */
#define FLASH_CR2_WAIT_Msk (0x7UL)       /*!< WAIT (Bitfield-Mask: 0x07)                            */
/* =======================================================  PAGELOCK  ======================================================== */
#define FLASH_PAGELOCK_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define FLASH_PAGELOCK_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_PAGELOCK_LOCK15_Pos (15UL)      /*!< LOCK15 (Bit 15)                                       */
#define FLASH_PAGELOCK_LOCK15_Msk (0x8000UL)  /*!< LOCK15 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK_LOCK14_Pos (14UL)      /*!< LOCK14 (Bit 14)                                       */
#define FLASH_PAGELOCK_LOCK14_Msk (0x4000UL)  /*!< LOCK14 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK_LOCK13_Pos (13UL)      /*!< LOCK13 (Bit 13)                                       */
#define FLASH_PAGELOCK_LOCK13_Msk (0x2000UL)  /*!< LOCK13 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK_LOCK12_Pos (12UL)      /*!< LOCK12 (Bit 12)                                       */
#define FLASH_PAGELOCK_LOCK12_Msk (0x1000UL)  /*!< LOCK12 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK_LOCK11_Pos (11UL)      /*!< LOCK11 (Bit 11)                                       */
#define FLASH_PAGELOCK_LOCK11_Msk (0x800UL)   /*!< LOCK11 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK_LOCK10_Pos (10UL)      /*!< LOCK10 (Bit 10)                                       */
#define FLASH_PAGELOCK_LOCK10_Msk (0x400UL)   /*!< LOCK10 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK_LOCK9_Pos (9UL)        /*!< LOCK9 (Bit 9)                                         */
#define FLASH_PAGELOCK_LOCK9_Msk (0x200UL)    /*!< LOCK9 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK_LOCK8_Pos (8UL)        /*!< LOCK8 (Bit 8)                                         */
#define FLASH_PAGELOCK_LOCK8_Msk (0x100UL)    /*!< LOCK8 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK_LOCK7_Pos (7UL)        /*!< LOCK7 (Bit 7)                                         */
#define FLASH_PAGELOCK_LOCK7_Msk (0x80UL)     /*!< LOCK7 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK_LOCK6_Pos (6UL)        /*!< LOCK6 (Bit 6)                                         */
#define FLASH_PAGELOCK_LOCK6_Msk (0x40UL)     /*!< LOCK6 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK_LOCK5_Pos (5UL)        /*!< LOCK5 (Bit 5)                                         */
#define FLASH_PAGELOCK_LOCK5_Msk (0x20UL)     /*!< LOCK5 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK_LOCK4_Pos (4UL)        /*!< LOCK4 (Bit 4)                                         */
#define FLASH_PAGELOCK_LOCK4_Msk (0x10UL)     /*!< LOCK4 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK_LOCK3_Pos (3UL)        /*!< LOCK3 (Bit 3)                                         */
#define FLASH_PAGELOCK_LOCK3_Msk (0x8UL)      /*!< LOCK3 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK_LOCK2_Pos (2UL)        /*!< LOCK2 (Bit 2)                                         */
#define FLASH_PAGELOCK_LOCK2_Msk (0x4UL)      /*!< LOCK2 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK_LOCK1_Pos (1UL)        /*!< LOCK1 (Bit 1)                                         */
#define FLASH_PAGELOCK_LOCK1_Msk (0x2UL)      /*!< LOCK1 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK_LOCK0_Pos (0UL)        /*!< LOCK0 (Bit 0)                                         */
#define FLASH_PAGELOCK_LOCK0_Msk (0x1UL)      /*!< LOCK0 (Bitfield-Mask: 0x01)                           */
/* ==========================================================  IER  ========================================================== */
#define FLASH_IER_PROG_Pos (4UL)       /*!< PROG (Bit 4)                                          */
#define FLASH_IER_PROG_Msk (0x10UL)    /*!< PROG (Bitfield-Mask: 0x01)                            */
#define FLASH_IER_SDKERR_Pos (2UL)     /*!< SDKERR (Bit 2)                                       */
#define FLASH_IER_SDKERR_Msk (0x4UL)   /*!< SDKERR (Bitfield-Mask: 0x01)                         */
#define FLASH_IER_PAGELOCK_Pos (1UL)   /*!< PAGELOCK (Bit 1)                                      */
#define FLASH_IER_PAGELOCK_Msk (0x2UL) /*!< PAGELOCK (Bitfield-Mask: 0x01)                        */
#define FLASH_IER_PC_Pos (0UL)         /*!< PC (Bit 0)                                            */
#define FLASH_IER_PC_Msk (0x1UL)       /*!< PC (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ISR  ========================================================== */
#define FLASH_ISR_BUSY_Pos (5UL)       /*!< BUSY (Bit 5)                                          */
#define FLASH_ISR_BUSY_Msk (0x20UL)    /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define FLASH_ISR_PROG_Pos (4UL)       /*!< PROG (Bit 4)                                          */
#define FLASH_ISR_PROG_Msk (0x10UL)    /*!< PROG (Bitfield-Mask: 0x01)                            */
#define FLASH_ISR_SDKERR_Pos (2UL)     /*!< SDKERR (Bit 2)                                       */
#define FLASH_ISR_SDKERR_Msk (0x4UL)   /*!< SDKERR (Bitfield-Mask: 0x01)                         */
#define FLASH_ISR_PAGELOCK_Pos (1UL)   /*!< PAGELOCK (Bit 1)                                      */
#define FLASH_ISR_PAGELOCK_Msk (0x2UL) /*!< PAGELOCK (Bitfield-Mask: 0x01)                        */
#define FLASH_ISR_PC_Pos (0UL)         /*!< PC (Bit 0)                                            */
#define FLASH_ISR_PC_Msk (0x1UL)       /*!< PC (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ICR  ========================================================== */
#define FLASH_ICR_PROG_Pos (4UL)       /*!< PROG (Bit 4)                                          */
#define FLASH_ICR_PROG_Msk (0x10UL)    /*!< PROG (Bitfield-Mask: 0x01)                            */
#define FLASH_ICR_SDKERR_Pos (2UL)     /*!< SDKERR (Bit 2)                                       */
#define FLASH_ICR_SDKERR_Msk (0x4UL)   /*!< SDKERR (Bitfield-Mask: 0x01)                         */
#define FLASH_ICR_PAGELOCK_Pos (1UL)   /*!< PAGELOCK (Bit 1)                                      */
#define FLASH_ICR_PAGELOCK_Msk (0x2UL) /*!< PAGELOCK (Bitfield-Mask: 0x01)                        */
#define FLASH_ICR_PC_Pos (0UL)         /*!< PC (Bit 0)                                            */
#define FLASH_ICR_PC_Msk (0x1UL)       /*!< PC (Bitfield-Mask: 0x01)                              */
/* ========================================================  SDKCFR  ========================================================= */
#define FLASH_SDKCFR_END_Pos (8UL)      /*!< END (Bit 8)                                           */
#define FLASH_SDKCFR_END_Msk (0x7f00UL) /*!< END (Bitfield-Mask: 0x7f)                             */
#define FLASH_SDKCFR_START_Pos (0UL)    /*!< START (Bit 0)                                         */
#define FLASH_SDKCFR_START_Msk (0x7fUL) /*!< START (Bitfield-Mask: 0x7f)                           */

/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */

