zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
#define GPIOx_BSRR_BRR1_Pos (17UL)          /*!< BRR1 (Bit 17)                                         */
#define GPIOx_BSRR_BRR1_Msk (0x20000UL)     /*!< BRR1 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BSRR_BRR0_Pos (16UL)          /*!< BRR0 (Bit 16)                                         */
#define GPIOx_BSRR_BRR0_Msk (0x10000UL)     /*!< BRR0 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BSRR_BSS15_Pos (15UL)         /*!< BSS15 (Bit 15)                                        */
#define GPIOx_BSRR_BSS15_Msk (0x8000UL)     /*!< BSS15 (Bitfield-Mask: 0x01)                           */
#define GPIOx_BSRR_BSS14_Pos (14UL)         /*!< BSS14 (Bit 14)                                        */
#define GPIOx_BSRR_BSS14_Msk (0x4000UL)     /*!< BSS14 (Bitfield-Mask: 0x01)                           */
#define GPIOx_BSRR_BSS13_Pos (13UL)         /*!< BSS13 (Bit 13)                                        */
#define GPIOx_BSRR_BSS13_Msk (0x2000UL)     /*!< BSS13 (Bitfield-Mask: 0x01)                           */
#define GPIOx_BSRR_BSS12_Pos (12UL)         /*!< BSS12 (Bit 12)                                        */
#define GPIOx_BSRR_BSS12_Msk (0x1000UL)     /*!< BSS12 (Bitfield-Mask: 0x01)                           */
#define GPIOx_BSRR_BSS11_Pos (11UL)         /*!< BSS11 (Bit 11)                                        */
#define GPIOx_BSRR_BSS11_Msk (0x800UL)      /*!< BSS11 (Bitfield-Mask: 0x01)                           */
#define GPIOx_BSRR_BSS10_Pos (10UL)         /*!< BSS10 (Bit 10)                                        */
#define GPIOx_BSRR_BSS10_Msk (0x400UL)      /*!< BSS10 (Bitfield-Mask: 0x01)                           */
#define GPIOx_BSRR_BSS9_Pos (9UL)           /*!< BSS9 (Bit 9)                                          */
#define GPIOx_BSRR_BSS9_Msk (0x200UL)       /*!< BSS9 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BSRR_BSS8_Pos (8UL)           /*!< BSS8 (Bit 8)                                          */
#define GPIOx_BSRR_BSS8_Msk (0x100UL)       /*!< BSS8 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BSRR_BSS7_Pos (7UL)           /*!< BSS7 (Bit 7)                                          */
#define GPIOx_BSRR_BSS7_Msk (0x80UL)        /*!< BSS7 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BSRR_BSS6_Pos (6UL)           /*!< BSS6 (Bit 6)                                          */
#define GPIOx_BSRR_BSS6_Msk (0x40UL)        /*!< BSS6 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BSRR_BSS5_Pos (5UL)           /*!< BSS5 (Bit 5)                                          */
#define GPIOx_BSRR_BSS5_Msk (0x20UL)        /*!< BSS5 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BSRR_BSS4_Pos (4UL)           /*!< BSS4 (Bit 4)                                          */
#define GPIOx_BSRR_BSS4_Msk (0x10UL)        /*!< BSS4 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BSRR_BSS3_Pos (3UL)           /*!< BSS3 (Bit 3)                                          */
#define GPIOx_BSRR_BSS3_Msk (0x8UL)         /*!< BSS3 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BSRR_BSS2_Pos (2UL)           /*!< BSS2 (Bit 2)                                          */
#define GPIOx_BSRR_BSS2_Msk (0x4UL)         /*!< BSS2 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BSRR_BSS1_Pos (1UL)           /*!< BSS1 (Bit 1)                                          */
#define GPIOx_BSRR_BSS1_Msk (0x2UL)         /*!< BSS1 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BSRR_BSS0_Pos (0UL)           /*!< BSS0 (Bit 0)                                          */
#define GPIOx_BSRR_BSS0_Msk (0x1UL)         /*!< BSS0 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  TOG  ========================================================== */
#define GPIOx_TOG_PIN15_Pos (15UL)     /*!< PIN15 (Bit 15)                                        */
#define GPIOx_TOG_PIN15_Msk (0x8000UL) /*!< PIN15 (Bitfield-Mask: 0x01)                           */
#define GPIOx_TOG_PIN14_Pos (14UL)     /*!< PIN14 (Bit 14)                                        */
#define GPIOx_TOG_PIN14_Msk (0x4000UL) /*!< PIN14 (Bitfield-Mask: 0x01)                           */
#define GPIOx_TOG_PIN13_Pos (13UL)     /*!< PIN13 (Bit 13)                                        */
#define GPIOx_TOG_PIN13_Msk (0x2000UL) /*!< PIN13 (Bitfield-Mask: 0x01)                           */
#define GPIOx_TOG_PIN12_Pos (12UL)     /*!< PIN12 (Bit 12)                                        */
#define GPIOx_TOG_PIN12_Msk (0x1000UL) /*!< PIN12 (Bitfield-Mask: 0x01)                           */
#define GPIOx_TOG_PIN11_Pos (11UL)     /*!< PIN11 (Bit 11)                                        */
#define GPIOx_TOG_PIN11_Msk (0x800UL)  /*!< PIN11 (Bitfield-Mask: 0x01)                           */
#define GPIOx_TOG_PIN10_Pos (10UL)     /*!< PIN10 (Bit 10)                                        */
#define GPIOx_TOG_PIN10_Msk (0x400UL)  /*!< PIN10 (Bitfield-Mask: 0x01)                           */
#define GPIOx_TOG_PIN9_Pos (9UL)       /*!< PIN9 (Bit 9)                                          */
#define GPIOx_TOG_PIN9_Msk (0x200UL)   /*!< PIN9 (Bitfield-Mask: 0x01)                            */
#define GPIOx_TOG_PIN8_Pos (8UL)       /*!< PIN8 (Bit 8)                                          */
#define GPIOx_TOG_PIN8_Msk (0x100UL)   /*!< PIN8 (Bitfield-Mask: 0x01)                            */
#define GPIOx_TOG_PIN7_Pos (7UL)       /*!< PIN7 (Bit 7)                                          */
#define GPIOx_TOG_PIN7_Msk (0x80UL)    /*!< PIN7 (Bitfield-Mask: 0x01)                            */
#define GPIOx_TOG_PIN6_Pos (6UL)       /*!< PIN6 (Bit 6)                                          */
#define GPIOx_TOG_PIN6_Msk (0x40UL)    /*!< PIN6 (Bitfield-Mask: 0x01)                            */
#define GPIOx_TOG_PIN5_Pos (5UL)       /*!< PIN5 (Bit 5)                                          */
#define GPIOx_TOG_PIN5_Msk (0x20UL)    /*!< PIN5 (Bitfield-Mask: 0x01)                            */
#define GPIOx_TOG_PIN4_Pos (4UL)       /*!< PIN4 (Bit 4)                                          */
#define GPIOx_TOG_PIN4_Msk (0x10UL)    /*!< PIN4 (Bitfield-Mask: 0x01)                            */
#define GPIOx_TOG_PIN3_Pos (3UL)       /*!< PIN3 (Bit 3)                                          */
#define GPIOx_TOG_PIN3_Msk (0x8UL)     /*!< PIN3 (Bitfield-Mask: 0x01)                            */
#define GPIOx_TOG_PIN2_Pos (2UL)       /*!< PIN2 (Bit 2)                                          */
#define GPIOx_TOG_PIN2_Msk (0x4UL)     /*!< PIN2 (Bitfield-Mask: 0x01)                            */
#define GPIOx_TOG_PIN1_Pos (1UL)       /*!< PIN1 (Bit 1)                                          */
#define GPIOx_TOG_PIN1_Msk (0x2UL)     /*!< PIN1 (Bitfield-Mask: 0x01)                            */
#define GPIOx_TOG_PIN0_Pos (0UL)       /*!< PIN0 (Bit 0)                                          */
#define GPIOx_TOG_PIN0_Msk (0x1UL)     /*!< PIN0 (Bitfield-Mask: 0x01)                            */

/* =========================================================================================================================== */
/* ================                                           GTIM                                            ================ */
/* =========================================================================================================================== */

