zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
/* ==========================================================  CR1  ========================================================== */
#define GTIMx_CR1_UIFREMAP_Pos (11UL)    /*!< UIFREMAP (Bit 11)                                     */
#define GTIMx_CR1_UIFREMAP_Msk (0x800UL) /*!< UIFREMAP (Bitfield-Mask: 0x01)                        */
#define GTIMx_CR1_CKD_Pos (8UL)          /*!< CKD (Bit 8)                                           */
#define GTIMx_CR1_CKD_Msk (0x300UL)      /*!< CKD (Bitfield-Mask: 0x03)                             */
#define GTIMx_CR1_ARPE_Pos (7UL)         /*!< ARPE (Bit 7)                                          */
#define GTIMx_CR1_ARPE_Msk (0x80UL)      /*!< ARPE (Bitfield-Mask: 0x01)                            */
#define GTIMx_CR1_CMS_Pos (5UL)          /*!< CMS (Bit 5)                                           */
#define GTIMx_CR1_CMS_Msk (0x60UL)       /*!< CMS (Bitfield-Mask: 0x03)                             */
#define GTIMx_CR1_DIR_Pos (4UL)          /*!< DIR (Bit 4)                                           */
#define GTIMx_CR1_DIR_Msk (0x10UL)       /*!< DIR (Bitfield-Mask: 0x01)                             */
#define GTIMx_CR1_OPM_Pos (3UL)          /*!< OPM (Bit 3)                                           */
#define GTIMx_CR1_OPM_Msk (0x8UL)        /*!< OPM (Bitfield-Mask: 0x01)                             */
#define GTIMx_CR1_URS_Pos (2UL)          /*!< URS (Bit 2)                                           */
#define GTIMx_CR1_URS_Msk (0x4UL)        /*!< URS (Bitfield-Mask: 0x01)                             */
#define GTIMx_CR1_UDIS_Pos (1UL)         /*!< UDIS (Bit 1)                                          */
#define GTIMx_CR1_UDIS_Msk (0x2UL)       /*!< UDIS (Bitfield-Mask: 0x01)                            */
#define GTIMx_CR1_CEN_Pos (0UL)          /*!< CEN (Bit 0)                                           */
#define GTIMx_CR1_CEN_Msk (0x1UL)        /*!< CEN (Bitfield-Mask: 0x01)                             */
/* ==========================================================  CR2  ========================================================== */
#define GTIMx_CR2_MMSH_Pos (25UL)        /*!< MMSH (Bit 25)                                         */
#define GTIMx_CR2_MMSH_Msk (0x6000000UL) /*!< MMSH (Bitfield-Mask: 0x03)                            */
#define GTIMx_CR2_TI1S_Pos (7UL)         /*!< TI1S (Bit 7)                                          */
#define GTIMx_CR2_TI1S_Msk (0x80UL)      /*!< TI1S (Bitfield-Mask: 0x01)                            */
#define GTIMx_CR2_MMS_Pos (4UL)          /*!< MMS (Bit 4)                                           */
#define GTIMx_CR2_MMS_Msk (0x70UL)       /*!< MMS (Bitfield-Mask: 0x07)                             */
/* =========================================================  SMCR  ========================================================== */
#define GTIMx_SMCR_SMSPS_Pos (25UL)        /*!< SMSPS (Bit 25)                                        */
#define GTIMx_SMCR_SMSPS_Msk (0x2000000UL) /*!< SMSPS (Bitfield-Mask: 0x01)                           */
#define GTIMx_SMCR_SMSPE_Pos (24UL)        /*!< SMSPE (Bit 24)                                        */
#define GTIMx_SMCR_SMSPE_Msk (0x1000000UL) /*!< SMSPE (Bitfield-Mask: 0x01)                           */
#define GTIMx_SMCR_TSH_Pos (20UL)          /*!< TSH (Bit 20)                                          */
#define GTIMx_SMCR_TSH_Msk (0x300000UL)    /*!< TSH (Bitfield-Mask: 0x03)                             */
#define GTIMx_SMCR_SMSH_Pos (16UL)         /*!< SMSH (Bit 16)                                         */
#define GTIMx_SMCR_SMSH_Msk (0x10000UL)    /*!< SMSH (Bitfield-Mask: 0x01)                            */
#define GTIMx_SMCR_ETP_Pos (15UL)          /*!< ETP (Bit 15)                                          */
#define GTIMx_SMCR_ETP_Msk (0x8000UL)      /*!< ETP (Bitfield-Mask: 0x01)                             */
#define GTIMx_SMCR_ECE_Pos (14UL)          /*!< ECE (Bit 14)                                          */
#define GTIMx_SMCR_ECE_Msk (0x4000UL)      /*!< ECE (Bitfield-Mask: 0x01)                             */
#define GTIMx_SMCR_ETPS_Pos (12UL)         /*!< ETPS (Bit 12)                                         */
#define GTIMx_SMCR_ETPS_Msk (0x3000UL)     /*!< ETPS (Bitfield-Mask: 0x03)                            */
#define GTIMx_SMCR_ETF_Pos (8UL)           /*!< ETF (Bit 8)                                           */
#define GTIMx_SMCR_ETF_Msk (0xf00UL)       /*!< ETF (Bitfield-Mask: 0x0f)                             */
#define GTIMx_SMCR_MSM_Pos (7UL)           /*!< MSM (Bit 7)                                           */
#define GTIMx_SMCR_MSM_Msk (0x80UL)        /*!< MSM (Bitfield-Mask: 0x01)                             */
#define GTIMx_SMCR_TS_Pos (4UL)            /*!< TS (Bit 4)                                            */
#define GTIMx_SMCR_TS_Msk (0x70UL)         /*!< TS (Bitfield-Mask: 0x07)                              */
#define GTIMx_SMCR_OCCS_Pos (3UL)          /*!< OCCS (Bit 3)                                          */
#define GTIMx_SMCR_OCCS_Msk (0x8UL)        /*!< OCCS (Bitfield-Mask: 0x01)                            */
#define GTIMx_SMCR_SMS_Pos (0UL)           /*!< SMS (Bit 0)                                           */
#define GTIMx_SMCR_SMS_Msk (0x7UL)         /*!< SMS (Bitfield-Mask: 0x07)                             */
/* ==========================================================  IER  ========================================================== */
#define GTIMx_IER_TERRIE_Pos (23UL)       /*!< TERRIE (Bit 23)                                       */
#define GTIMx_IER_TERRIE_Msk (0x800000UL) /*!< TERRIE (Bitfield-Mask: 0x01)                          */
#define GTIMx_IER_IERRIE_Pos (22UL)       /*!< IERRIE (Bit 22)                                       */
#define GTIMx_IER_IERRIE_Msk (0x400000UL) /*!< IERRIE (Bitfield-Mask: 0x01)                          */
#define GTIMx_IER_DIRIE_Pos (21UL)        /*!< DIRIE (Bit 21)                                        */
#define GTIMx_IER_DIRIE_Msk (0x200000UL)  /*!< DIRIE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_IDXIE_Pos (20UL)        /*!< IDXIE (Bit 20)                                        */
#define GTIMx_IER_IDXIE_Msk (0x100000UL)  /*!< IDXIE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_TIE_Pos (6UL)           /*!< TIE (Bit 6)                                           */
#define GTIMx_IER_TIE_Msk (0x40UL)        /*!< TIE (Bitfield-Mask: 0x01)                             */
#define GTIMx_IER_CC4IE_Pos (4UL)         /*!< CC4IE (Bit 4)                                         */
#define GTIMx_IER_CC4IE_Msk (0x10UL)      /*!< CC4IE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_CC3IE_Pos (3UL)         /*!< CC3IE (Bit 3)                                         */
#define GTIMx_IER_CC3IE_Msk (0x8UL)       /*!< CC3IE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_CC2IE_Pos (2UL)         /*!< CC2IE (Bit 2)                                         */
#define GTIMx_IER_CC2IE_Msk (0x4UL)       /*!< CC2IE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_CC1IE_Pos (1UL)         /*!< CC1IE (Bit 1)                                         */
#define GTIMx_IER_CC1IE_Msk (0x2UL)       /*!< CC1IE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_UIE_Pos (0UL)           /*!< UIE (Bit 0)                                           */
#define GTIMx_IER_UIE_Msk (0x1UL)         /*!< UIE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define GTIMx_ISR_TERRF_Pos (23UL)       /*!< TERRF (Bit 23)                                        */
#define GTIMx_ISR_TERRF_Msk (0x800000UL) /*!< TERRF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_IERRF_Pos (22UL)       /*!< IERRF (Bit 22)                                        */
#define GTIMx_ISR_IERRF_Msk (0x400000UL) /*!< IERRF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_DIRF_Pos (21UL)        /*!< DIRF (Bit 21)                                         */
#define GTIMx_ISR_DIRF_Msk (0x200000UL)  /*!< DIRF (Bitfield-Mask: 0x01)                            */
#define GTIMx_ISR_IDXF_Pos (20UL)        /*!< IDXF (Bit 20)                                         */
#define GTIMx_ISR_IDXF_Msk (0x100000UL)  /*!< IDXF (Bitfield-Mask: 0x01)                            */
#define GTIMx_ISR_CC4OF_Pos (12UL)       /*!< CC4OF (Bit 12)                                        */
#define GTIMx_ISR_CC4OF_Msk (0x1000UL)   /*!< CC4OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_CC3OF_Pos (11UL)       /*!< CC3OF (Bit 11)                                        */
#define GTIMx_ISR_CC3OF_Msk (0x800UL)    /*!< CC3OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_CC2OF_Pos (10UL)       /*!< CC2OF (Bit 10)                                        */
#define GTIMx_ISR_CC2OF_Msk (0x400UL)    /*!< CC2OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_CC1OF_Pos (9UL)        /*!< CC1OF (Bit 9)                                         */
#define GTIMx_ISR_CC1OF_Msk (0x200UL)    /*!< CC1OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_TIF_Pos (6UL)          /*!< TIF (Bit 6)                                           */
#define GTIMx_ISR_TIF_Msk (0x40UL)       /*!< TIF (Bitfield-Mask: 0x01)                             */
#define GTIMx_ISR_CC4IF_Pos (4UL)        /*!< CC4IF (Bit 4)                                         */
#define GTIMx_ISR_CC4IF_Msk (0x10UL)     /*!< CC4IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_CC3IF_Pos (3UL)        /*!< CC3IF (Bit 3)                                         */
#define GTIMx_ISR_CC3IF_Msk (0x8UL)      /*!< CC3IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_CC2IF_Pos (2UL)        /*!< CC2IF (Bit 2)                                         */
#define GTIMx_ISR_CC2IF_Msk (0x4UL)      /*!< CC2IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_CC1IF_Pos (1UL)        /*!< CC1IF (Bit 1)                                         */
#define GTIMx_ISR_CC1IF_Msk (0x2UL)      /*!< CC1IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_UIF_Pos (0UL)          /*!< UIF (Bit 0)                                           */
#define GTIMx_ISR_UIF_Msk (0x1UL)        /*!< UIF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define GTIMx_ICR_TERRF_Pos (23UL)       /*!< TERRF (Bit 23)                                        */
#define GTIMx_ICR_TERRF_Msk (0x800000UL) /*!< TERRF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_IERRF_Pos (22UL)       /*!< IERRF (Bit 22)                                        */
#define GTIMx_ICR_IERRF_Msk (0x400000UL) /*!< IERRF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_DIRF_Pos (21UL)        /*!< DIRF (Bit 21)                                         */
#define GTIMx_ICR_DIRF_Msk (0x200000UL)  /*!< DIRF (Bitfield-Mask: 0x01)                            */
#define GTIMx_ICR_IDXF_Pos (20UL)        /*!< IDXF (Bit 20)                                         */
#define GTIMx_ICR_IDXF_Msk (0x100000UL)  /*!< IDXF (Bitfield-Mask: 0x01)                            */
#define GTIMx_ICR_CC4OF_Pos (12UL)       /*!< CC4OF (Bit 12)                                        */
#define GTIMx_ICR_CC4OF_Msk (0x1000UL)   /*!< CC4OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_CC3OF_Pos (11UL)       /*!< CC3OF (Bit 11)                                        */
#define GTIMx_ICR_CC3OF_Msk (0x800UL)    /*!< CC3OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_CC2OF_Pos (10UL)       /*!< CC2OF (Bit 10)                                        */
#define GTIMx_ICR_CC2OF_Msk (0x400UL)    /*!< CC2OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_CC1OF_Pos (9UL)        /*!< CC1OF (Bit 9)                                         */
#define GTIMx_ICR_CC1OF_Msk (0x200UL)    /*!< CC1OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_TIF_Pos (6UL)          /*!< TIF (Bit 6)                                           */
#define GTIMx_ICR_TIF_Msk (0x40UL)       /*!< TIF (Bitfield-Mask: 0x01)                             */
#define GTIMx_ICR_CC4IF_Pos (4UL)        /*!< CC4IF (Bit 4)                                         */
#define GTIMx_ICR_CC4IF_Msk (0x10UL)     /*!< CC4IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_CC3IF_Pos (3UL)        /*!< CC3IF (Bit 3)                                         */
#define GTIMx_ICR_CC3IF_Msk (0x8UL)      /*!< CC3IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_CC2IF_Pos (2UL)        /*!< CC2IF (Bit 2)                                         */
#define GTIMx_ICR_CC2IF_Msk (0x4UL)      /*!< CC2IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_CC1IF_Pos (1UL)        /*!< CC1IF (Bit 1)                                         */
#define GTIMx_ICR_CC1IF_Msk (0x2UL)      /*!< CC1IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_UIF_Pos (0UL)          /*!< UIF (Bit 0)                                           */
#define GTIMx_ICR_UIF_Msk (0x1UL)        /*!< UIF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  EGR  ========================================================== */
#define GTIMx_EGR_TG_Pos (6UL)      /*!< TG (Bit 6)                                            */
#define GTIMx_EGR_TG_Msk (0x40UL)   /*!< TG (Bitfield-Mask: 0x01)                              */
#define GTIMx_EGR_CC4G_Pos (4UL)    /*!< CC4G (Bit 4)                                          */
#define GTIMx_EGR_CC4G_Msk (0x10UL) /*!< CC4G (Bitfield-Mask: 0x01)                            */
#define GTIMx_EGR_CC3G_Pos (3UL)    /*!< CC3G (Bit 3)                                          */
#define GTIMx_EGR_CC3G_Msk (0x8UL)  /*!< CC3G (Bitfield-Mask: 0x01)                            */
#define GTIMx_EGR_CC2G_Pos (2UL)    /*!< CC2G (Bit 2)                                          */
#define GTIMx_EGR_CC2G_Msk (0x4UL)  /*!< CC2G (Bitfield-Mask: 0x01)                            */
#define GTIMx_EGR_CC1G_Pos (1UL)    /*!< CC1G (Bit 1)                                          */
#define GTIMx_EGR_CC1G_Msk (0x2UL)  /*!< CC1G (Bitfield-Mask: 0x01)                            */
#define GTIMx_EGR_UG_Pos (0UL)      /*!< UG (Bit 0)                                            */
#define GTIMx_EGR_UG_Msk (0x1UL)    /*!< UG (Bitfield-Mask: 0x01)                              */
/* =======================================================  CCMR1CAP  ======================================================== */
#define GTIMx_CCMR1CAP_IC2F_Pos (12UL)      /*!< IC2F (Bit 12)                                         */
#define GTIMx_CCMR1CAP_IC2F_Msk (0xf000UL)  /*!< IC2F (Bitfield-Mask: 0x0f)                            */
#define GTIMx_CCMR1CAP_IC2PSC_Pos (10UL)    /*!< IC2PSC (Bit 10)                                       */
#define GTIMx_CCMR1CAP_IC2PSC_Msk (0xc00UL) /*!< IC2PSC (Bitfield-Mask: 0x03)                          */
#define GTIMx_CCMR1CAP_CC2S_Pos (8UL)       /*!< CC2S (Bit 8)                                          */
#define GTIMx_CCMR1CAP_CC2S_Msk (0x300UL)   /*!< CC2S (Bitfield-Mask: 0x03)                            */
#define GTIMx_CCMR1CAP_IC1F_Pos (4UL)       /*!< IC1F (Bit 4)                                          */
#define GTIMx_CCMR1CAP_IC1F_Msk (0xf0UL)    /*!< IC1F (Bitfield-Mask: 0x0f)                            */
#define GTIMx_CCMR1CAP_IC1PSC_Pos (2UL)     /*!< IC1PSC (Bit 2)                                        */
#define GTIMx_CCMR1CAP_IC1PSC_Msk (0xcUL)   /*!< IC1PSC (Bitfield-Mask: 0x03)                          */
#define GTIMx_CCMR1CAP_CC1S_Pos (0UL)       /*!< CC1S (Bit 0)                                          */
#define GTIMx_CCMR1CAP_CC1S_Msk (0x3UL)     /*!< CC1S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR1CMP  ======================================================== */
#define GTIMx_CCMR1CMP_OC2MH_Pos (24UL)        /*!< OC2MH (Bit 24)                                        */
#define GTIMx_CCMR1CMP_OC2MH_Msk (0x1000000UL) /*!< OC2MH (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_OC1MH_Pos (16UL)        /*!< OC1MH (Bit 16)                                        */
#define GTIMx_CCMR1CMP_OC1MH_Msk (0x10000UL)   /*!< OC1MH (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_OC2CE_Pos (15UL)        /*!< OC2CE (Bit 15)                                        */
#define GTIMx_CCMR1CMP_OC2CE_Msk (0x8000UL)    /*!< OC2CE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_OC2M_Pos (12UL)         /*!< OC2M (Bit 12)                                         */
#define GTIMx_CCMR1CMP_OC2M_Msk (0x7000UL)     /*!< OC2M (Bitfield-Mask: 0x07)                            */
#define GTIMx_CCMR1CMP_OC2PE_Pos (11UL)        /*!< OC2PE (Bit 11)                                        */
#define GTIMx_CCMR1CMP_OC2PE_Msk (0x800UL)     /*!< OC2PE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_OC2FE_Pos (10UL)        /*!< OC2FE (Bit 10)                                        */
#define GTIMx_CCMR1CMP_OC2FE_Msk (0x400UL)     /*!< OC2FE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_CC2S_Pos (8UL)          /*!< CC2S (Bit 8)                                          */
#define GTIMx_CCMR1CMP_CC2S_Msk (0x300UL)      /*!< CC2S (Bitfield-Mask: 0x03)                            */
#define GTIMx_CCMR1CMP_OC1CE_Pos (7UL)         /*!< OC1CE (Bit 7)                                         */
#define GTIMx_CCMR1CMP_OC1CE_Msk (0x80UL)      /*!< OC1CE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_OC1M_Pos (4UL)          /*!< OC1M (Bit 4)                                          */
#define GTIMx_CCMR1CMP_OC1M_Msk (0x70UL)       /*!< OC1M (Bitfield-Mask: 0x07)                            */
#define GTIMx_CCMR1CMP_OC1PE_Pos (3UL)         /*!< OC1PE (Bit 3)                                         */
#define GTIMx_CCMR1CMP_OC1PE_Msk (0x8UL)       /*!< OC1PE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_OC1FE_Pos (2UL)         /*!< OC1FE (Bit 2)                                         */
#define GTIMx_CCMR1CMP_OC1FE_Msk (0x4UL)       /*!< OC1FE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_CC1S_Pos (0UL)          /*!< CC1S (Bit 0)                                          */
#define GTIMx_CCMR1CMP_CC1S_Msk (0x3UL)        /*!< CC1S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR2CAP  ======================================================== */
#define GTIMx_CCMR2CAP_IC4F_Pos (12UL)      /*!< IC4F (Bit 12)                                         */
#define GTIMx_CCMR2CAP_IC4F_Msk (0xf000UL)  /*!< IC4F (Bitfield-Mask: 0x0f)                            */
#define GTIMx_CCMR2CAP_IC4PSC_Pos (10UL)    /*!< IC4PSC (Bit 10)                                       */
#define GTIMx_CCMR2CAP_IC4PSC_Msk (0xc00UL) /*!< IC4PSC (Bitfield-Mask: 0x03)                          */
#define GTIMx_CCMR2CAP_CC4S_Pos (8UL)       /*!< CC4S (Bit 8)                                          */
#define GTIMx_CCMR2CAP_CC4S_Msk (0x300UL)   /*!< CC4S (Bitfield-Mask: 0x03)                            */
#define GTIMx_CCMR2CAP_IC3F_Pos (4UL)       /*!< IC3F (Bit 4)                                          */
#define GTIMx_CCMR2CAP_IC3F_Msk (0xf0UL)    /*!< IC3F (Bitfield-Mask: 0x0f)                            */
#define GTIMx_CCMR2CAP_IC3PSC_Pos (2UL)     /*!< IC3PSC (Bit 2)                                        */
#define GTIMx_CCMR2CAP_IC3PSC_Msk (0xcUL)   /*!< IC3PSC (Bitfield-Mask: 0x03)                          */
#define GTIMx_CCMR2CAP_CC3S_Pos (0UL)       /*!< CC3S (Bit 0)                                          */
#define GTIMx_CCMR2CAP_CC3S_Msk (0x3UL)     /*!< CC3S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR2CMP  ======================================================== */
#define GTIMx_CCMR2CMP_OC4MH_Pos (24UL)        /*!< OC4MH (Bit 24)                                        */
#define GTIMx_CCMR2CMP_OC4MH_Msk (0x1000000UL) /*!< OC4MH (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC3MH_Pos (16UL)        /*!< OC3MH (Bit 16)                                        */
#define GTIMx_CCMR2CMP_OC3MH_Msk (0x10000UL)   /*!< OC3MH (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC4CE_Pos (15UL)        /*!< OC4CE (Bit 15)                                        */
#define GTIMx_CCMR2CMP_OC4CE_Msk (0x8000UL)    /*!< OC4CE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC4M_Pos (12UL)         /*!< OC4M (Bit 12)                                         */
#define GTIMx_CCMR2CMP_OC4M_Msk (0x7000UL)     /*!< OC4M (Bitfield-Mask: 0x07)                            */
#define GTIMx_CCMR2CMP_OC4PE_Pos (11UL)        /*!< OC4PE (Bit 11)                                        */
#define GTIMx_CCMR2CMP_OC4PE_Msk (0x800UL)     /*!< OC4PE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC4FE_Pos (10UL)        /*!< OC4FE (Bit 10)                                        */
#define GTIMx_CCMR2CMP_OC4FE_Msk (0x400UL)     /*!< OC4FE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_CC4S_Pos (8UL)          /*!< CC4S (Bit 8)                                          */
#define GTIMx_CCMR2CMP_CC4S_Msk (0x300UL)      /*!< CC4S (Bitfield-Mask: 0x03)                            */
#define GTIMx_CCMR2CMP_OC3CE_Pos (7UL)         /*!< OC3CE (Bit 7)                                         */
#define GTIMx_CCMR2CMP_OC3CE_Msk (0x80UL)      /*!< OC3CE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC3M_Pos (4UL)          /*!< OC3M (Bit 4)                                          */
#define GTIMx_CCMR2CMP_OC3M_Msk (0x70UL)       /*!< OC3M (Bitfield-Mask: 0x07)                            */
#define GTIMx_CCMR2CMP_OC3PE_Pos (3UL)         /*!< OC3PE (Bit 3)                                         */
#define GTIMx_CCMR2CMP_OC3PE_Msk (0x8UL)       /*!< OC3PE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC3FE_Pos (2UL)         /*!< OC3FE (Bit 2)                                         */
#define GTIMx_CCMR2CMP_OC3FE_Msk (0x4UL)       /*!< OC3FE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_CC3S_Pos (0UL)          /*!< CC3S (Bit 0)                                          */
#define GTIMx_CCMR2CMP_CC3S_Msk (0x3UL)        /*!< CC3S (Bitfield-Mask: 0x03)                            */
/* =========================================================  CCER  ========================================================== */
#define GTIMx_CCER_CC4NP_Pos (15UL)     /*!< CC4NP (Bit 15)                                        */
#define GTIMx_CCER_CC4NP_Msk (0x8000UL) /*!< CC4NP (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCER_CC4P_Pos (13UL)      /*!< CC4P (Bit 13)                                         */
#define GTIMx_CCER_CC4P_Msk (0x2000UL)  /*!< CC4P (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC4E_Pos (12UL)      /*!< CC4E (Bit 12)                                         */
#define GTIMx_CCER_CC4E_Msk (0x1000UL)  /*!< CC4E (Bitfield-Mask: 0x01)                            */
