zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
#define GTIMx_CCER_CC3NP_Pos (11UL)     /*!< CC3NP (Bit 11)                                        */
#define GTIMx_CCER_CC3NP_Msk (0x800UL)  /*!< CC3NP (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCER_CC3P_Pos (9UL)       /*!< CC3P (Bit 9)                                          */
#define GTIMx_CCER_CC3P_Msk (0x200UL)   /*!< CC3P (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC3E_Pos (8UL)       /*!< CC3E (Bit 8)                                          */
#define GTIMx_CCER_CC3E_Msk (0x100UL)   /*!< CC3E (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC2NP_Pos (7UL)      /*!< CC2NP (Bit 7)                                         */
#define GTIMx_CCER_CC2NP_Msk (0x80UL)   /*!< CC2NP (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCER_CC2P_Pos (5UL)       /*!< CC2P (Bit 5)                                          */
#define GTIMx_CCER_CC2P_Msk (0x20UL)    /*!< CC2P (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC2E_Pos (4UL)       /*!< CC2E (Bit 4)                                          */
#define GTIMx_CCER_CC2E_Msk (0x10UL)    /*!< CC2E (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC1NP_Pos (3UL)      /*!< CC1NP (Bit 3)                                         */
#define GTIMx_CCER_CC1NP_Msk (0x8UL)    /*!< CC1NP (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCER_CC1P_Pos (1UL)       /*!< CC1P (Bit 1)                                          */
#define GTIMx_CCER_CC1P_Msk (0x2UL)     /*!< CC1P (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC1E_Pos (0UL)       /*!< CC1E (Bit 0)                                          */
#define GTIMx_CCER_CC1E_Msk (0x1UL)     /*!< CC1E (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CNT  ========================================================== */
#define GTIMx_CNT_UIFCPY_Pos (31UL)         /*!< UIFCPY (Bit 31)                                       */
#define GTIMx_CNT_UIFCPY_Msk (0x80000000UL) /*!< UIFCPY (Bitfield-Mask: 0x01)                          */
#define GTIMx_CNT_CNT_Pos (0UL)             /*!< CNT (Bit 0)                                           */
#define GTIMx_CNT_CNT_Msk (0xffffUL)        /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define GTIMx_PSC_PSC_Pos (0UL)      /*!< PSC (Bit 0)                                           */
#define GTIMx_PSC_PSC_Msk (0xffffUL) /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  ARR  ========================================================== */
#define GTIMx_ARR_ARR_Pos (0UL)      /*!< ARR (Bit 0)                                           */
#define GTIMx_ARR_ARR_Msk (0xffffUL) /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* =========================================================  CCR1  ========================================================== */
#define GTIMx_CCR1_CCR1_Pos (0UL)      /*!< CCR1 (Bit 0)                                          */
#define GTIMx_CCR1_CCR1_Msk (0xffffUL) /*!< CCR1 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR2  ========================================================== */
#define GTIMx_CCR2_CCR2_Pos (0UL)      /*!< CCR2 (Bit 0)                                          */
#define GTIMx_CCR2_CCR2_Msk (0xffffUL) /*!< CCR2 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR3  ========================================================== */
#define GTIMx_CCR3_CCR3_Pos (0UL)      /*!< CCR3 (Bit 0)                                          */
#define GTIMx_CCR3_CCR3_Msk (0xffffUL) /*!< CCR3 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR4  ========================================================== */
#define GTIMx_CCR4_CCR4_Pos (0UL)      /*!< CCR4 (Bit 0)                                          */
#define GTIMx_CCR4_CCR4_Msk (0xffffUL) /*!< CCR4 (Bitfield-Mask: 0xffff)                          */
/* ==========================================================  ECR  ========================================================== */
#define GTIMx_ECR_IPOS_Pos (6UL)    /*!< IPOS (Bit 6)                                          */
#define GTIMx_ECR_IPOS_Msk (0xc0UL) /*!< IPOS (Bitfield-Mask: 0x03)                            */
#define GTIMx_ECR_FIDX_Pos (5UL)    /*!< FIDX (Bit 5)                                          */
#define GTIMx_ECR_FIDX_Msk (0x20UL) /*!< FIDX (Bitfield-Mask: 0x01)                            */
#define GTIMx_ECR_IDIR_Pos (1UL)    /*!< IDIR (Bit 1)                                          */
#define GTIMx_ECR_IDIR_Msk (0x6UL)  /*!< IDIR (Bitfield-Mask: 0x03)                            */
#define GTIMx_ECR_IE_Pos (0UL)      /*!< IE (Bit 0)                                            */
#define GTIMx_ECR_IE_Msk (0x1UL)    /*!< IE (Bitfield-Mask: 0x01)                              */
/* =========================================================  TISEL  ========================================================= */
#define GTIMx_TISEL_TI4SEL_Pos (24UL)        /*!< TI4SEL (Bit 24)                                       */
#define GTIMx_TISEL_TI4SEL_Msk (0xf000000UL) /*!< TI4SEL (Bitfield-Mask: 0x0f)                          */
#define GTIMx_TISEL_TI3SEL_Pos (16UL)        /*!< TI3SEL (Bit 16)                                       */
#define GTIMx_TISEL_TI3SEL_Msk (0xf0000UL)   /*!< TI3SEL (Bitfield-Mask: 0x0f)                          */
#define GTIMx_TISEL_TI2SEL_Pos (8UL)         /*!< TI2SEL (Bit 8)                                        */
#define GTIMx_TISEL_TI2SEL_Msk (0xf00UL)     /*!< TI2SEL (Bitfield-Mask: 0x0f)                          */
#define GTIMx_TISEL_TI1SEL_Pos (0UL)         /*!< TI1SEL (Bit 0)                                        */
#define GTIMx_TISEL_TI1SEL_Msk (0xfUL)       /*!< TI1SEL (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  AF1  ========================================================== */
#define GTIMx_AF1_ETRSEL_Pos (14UL)      /*!< ETRSEL (Bit 14)                                       */
#define GTIMx_AF1_ETRSEL_Msk (0x3c000UL) /*!< ETRSEL (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  AF2  ========================================================== */
#define GTIMx_AF2_OCRSEL_Pos (16UL)      /*!< OCRSEL (Bit 16)                                       */
#define GTIMx_AF2_OCRSEL_Msk (0x70000UL) /*!< OCRSEL (Bitfield-Mask: 0x07)                          */

/* =========================================================================================================================== */
/* ================                                            I2C                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  BRREN  ========================================================= */
#define I2C_BRREN_EN_Pos (0UL)   /*!< EN (Bit 0)                                            */
#define I2C_BRREN_EN_Msk (0x1UL) /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  BRR  ========================================================== */
#define I2C_BRR_BRR_Pos (0UL)    /*!< BRR (Bit 0)                                           */
#define I2C_BRR_BRR_Msk (0xffUL) /*!< BRR (Bitfield-Mask: 0xff)                             */
/* ==========================================================  CR  =========================================================== */
#define I2C_CR_SDAINSRC_Pos (11UL)     /*!< SDAINSRC (Bit 11)                                     */
#define I2C_CR_SDAINSRC_Msk (0x3800UL) /*!< SDAINSRC (Bitfield-Mask: 0x07)                        */
#define I2C_CR_SCLINSRC_Pos (8UL)      /*!< SCLINSRC (Bit 8)                                      */
#define I2C_CR_SCLINSRC_Msk (0x700UL)  /*!< SCLINSRC (Bitfield-Mask: 0x07)                        */
#define I2C_CR_EN_Pos (6UL)            /*!< EN (Bit 6)                                            */
#define I2C_CR_EN_Msk (0x40UL)         /*!< EN (Bitfield-Mask: 0x01)                              */
#define I2C_CR_STA_Pos (5UL)           /*!< STA (Bit 5)                                           */
#define I2C_CR_STA_Msk (0x20UL)        /*!< STA (Bitfield-Mask: 0x01)                             */
#define I2C_CR_STO_Pos (4UL)           /*!< STO (Bit 4)                                           */
#define I2C_CR_STO_Msk (0x10UL)        /*!< STO (Bitfield-Mask: 0x01)                             */
#define I2C_CR_SI_Pos (3UL)            /*!< SI (Bit 3)                                            */
#define I2C_CR_SI_Msk (0x8UL)          /*!< SI (Bitfield-Mask: 0x01)                              */
#define I2C_CR_AA_Pos (2UL)            /*!< AA (Bit 2)                                            */
#define I2C_CR_AA_Msk (0x4UL)          /*!< AA (Bitfield-Mask: 0x01)                              */
#define I2C_CR_FLT_Pos (0UL)           /*!< FLT (Bit 0)                                           */
#define I2C_CR_FLT_Msk (0x1UL)         /*!< FLT (Bitfield-Mask: 0x01)                             */
/* ==========================================================  DR  =========================================================== */
#define I2C_DR_DR_Pos (0UL)    /*!< DR (Bit 0)                                            */
#define I2C_DR_DR_Msk (0xffUL) /*!< DR (Bitfield-Mask: 0xff)                              */
/* =========================================================  ADDR0  ========================================================= */
#define I2C_ADDR0_ADDR0_Pos (1UL)    /*!< ADDR0 (Bit 1)                                         */
#define I2C_ADDR0_ADDR0_Msk (0xfeUL) /*!< ADDR0 (Bitfield-Mask: 0x7f)                           */
#define I2C_ADDR0_GC_Pos (0UL)       /*!< GC (Bit 0)                                            */
#define I2C_ADDR0_GC_Msk (0x1UL)     /*!< GC (Bitfield-Mask: 0x01)                              */
/* =========================================================  STAT  ========================================================== */
#define I2C_STAT_STAT_Pos (0UL)    /*!< STAT (Bit 0)                                          */
#define I2C_STAT_STAT_Msk (0xffUL) /*!< STAT (Bitfield-Mask: 0xff)                            */
/* =========================================================  ADDR1  ========================================================= */
#define I2C_ADDR1_ADDR1_Pos (1UL)    /*!< ADDR1 (Bit 1)                                         */
#define I2C_ADDR1_ADDR1_Msk (0xfeUL) /*!< ADDR1 (Bitfield-Mask: 0x7f)                           */
/* =========================================================  ADDR2  ========================================================= */
#define I2C_ADDR2_ADDR2_Pos (1UL)    /*!< ADDR2 (Bit 1)                                         */
#define I2C_ADDR2_ADDR2_Msk (0xfeUL) /*!< ADDR2 (Bitfield-Mask: 0x7f)                           */
/* =========================================================  MATCH  ========================================================= */
#define I2C_MATCH_ADDR2_Pos (2UL)   /*!< ADDR2 (Bit 2)                                         */
#define I2C_MATCH_ADDR2_Msk (0x4UL) /*!< ADDR2 (Bitfield-Mask: 0x01)                           */
#define I2C_MATCH_ADDR1_Pos (1UL)   /*!< ADDR1 (Bit 1)                                         */
#define I2C_MATCH_ADDR1_Msk (0x2UL) /*!< ADDR1 (Bitfield-Mask: 0x01)                           */
#define I2C_MATCH_ADDR0_Pos (0UL)   /*!< ADDR0 (Bit 0)                                         */
#define I2C_MATCH_ADDR0_Msk (0x1UL) /*!< ADDR0 (Bitfield-Mask: 0x01)                           */

/* =========================================================================================================================== */
/* ================                                           IRMOD                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define IRMOD_CR_INV_Pos (5UL)     /*!< INV (Bit 5)                                           */
#define IRMOD_CR_INV_Msk (0x20UL)  /*!< INV (Bitfield-Mask: 0x01)                             */
#define IRMOD_CR_IRSW_Pos (4UL)    /*!< IRSW (Bit 4)                                          */
#define IRMOD_CR_IRSW_Msk (0x10UL) /*!< IRSW (Bitfield-Mask: 0x01)                            */
#define IRMOD_CR_MOD_Pos (0UL)     /*!< MOD (Bit 0)                                           */
#define IRMOD_CR_MOD_Msk (0xfUL)   /*!< MOD (Bitfield-Mask: 0x0f)                             */

/* =========================================================================================================================== */
/* ================                                           IWDT                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  KR  =========================================================== */
#define IWDT_KR_KR_Pos (0UL)      /*!< KR (Bit 0)                                            */
#define IWDT_KR_KR_Msk (0xffffUL) /*!< KR (Bitfield-Mask: 0xffff)                            */
/* ==========================================================  CR  =========================================================== */
#define IWDT_CR_PAUSE_Pos (5UL)    /*!< PAUSE (Bit 5)                                         */
#define IWDT_CR_PAUSE_Msk (0x20UL) /*!< PAUSE (Bitfield-Mask: 0x01)                           */
#define IWDT_CR_IE_Pos (4UL)       /*!< IE (Bit 4)                                            */
#define IWDT_CR_IE_Msk (0x10UL)    /*!< IE (Bitfield-Mask: 0x01)                              */
#define IWDT_CR_ACTION_Pos (3UL)   /*!< ACTION (Bit 3)                                        */
#define IWDT_CR_ACTION_Msk (0x8UL) /*!< ACTION (Bitfield-Mask: 0x01)                          */
#define IWDT_CR_PRS_Pos (0UL)      /*!< PRS (Bit 0)                                           */
#define IWDT_CR_PRS_Msk (0x7UL)    /*!< PRS (Bitfield-Mask: 0x07)                             */
/* ==========================================================  ARR  ========================================================== */
#define IWDT_ARR_ARR_Pos (0UL)     /*!< ARR (Bit 0)                                           */
#define IWDT_ARR_ARR_Msk (0xfffUL) /*!< ARR (Bitfield-Mask: 0xfff)                            */
/* ==========================================================  SR  =========================================================== */
#define IWDT_SR_RELOAD_Pos (5UL)    /*!< RELOAD (Bit 5)                                        */
#define IWDT_SR_RELOAD_Msk (0x20UL) /*!< RELOAD (Bitfield-Mask: 0x01)                          */
#define IWDT_SR_RUN_Pos (4UL)       /*!< RUN (Bit 4)                                           */
#define IWDT_SR_RUN_Msk (0x10UL)    /*!< RUN (Bitfield-Mask: 0x01)                             */
#define IWDT_SR_OV_Pos (3UL)        /*!< OV (Bit 3)                                            */
#define IWDT_SR_OV_Msk (0x8UL)      /*!< OV (Bitfield-Mask: 0x01)                              */
#define IWDT_SR_WINRF_Pos (2UL)     /*!< WINRF (Bit 2)                                         */
#define IWDT_SR_WINRF_Msk (0x4UL)   /*!< WINRF (Bitfield-Mask: 0x01)                           */
#define IWDT_SR_ARRF_Pos (1UL)      /*!< ARRF (Bit 1)                                          */
#define IWDT_SR_ARRF_Msk (0x2UL)    /*!< ARRF (Bitfield-Mask: 0x01)                            */
#define IWDT_SR_CRF_Pos (0UL)       /*!< CRF (Bit 0)                                           */
#define IWDT_SR_CRF_Msk (0x1UL)     /*!< CRF (Bitfield-Mask: 0x01)                             */
/* =========================================================  WINR  ========================================================== */
#define IWDT_WINR_WINR_Pos (0UL)     /*!< WINR (Bit 0)                                          */
#define IWDT_WINR_WINR_Msk (0xfffUL) /*!< WINR (Bitfield-Mask: 0xfff)                           */
/* ==========================================================  CNT  ========================================================== */
#define IWDT_CNT_CNT_Pos (0UL)     /*!< CNT (Bit 0)                                           */
#define IWDT_CNT_CNT_Msk (0xfffUL) /*!< CNT (Bitfield-Mask: 0xfff)                            */

/* =========================================================================================================================== */
/* ================                                           LPTIM                                           ================ */
/* =========================================================================================================================== */

