zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
/* ==========================================================  IER  ========================================================== */
#define RAM_IER_PARITY_Pos (0UL)   /*!< PARITY (Bit 0)                                        */
#define RAM_IER_PARITY_Msk (0x1UL) /*!< PARITY (Bitfield-Mask: 0x01)                          */
/* =========================================================  ADDR  ========================================================== */
#define RAM_ADDR_ADDR_Pos (0UL)          /*!< ADDR (Bit 0)                                          */
#define RAM_ADDR_ADDR_Msk (0xffffffffUL) /*!< ADDR (Bitfield-Mask: 0xffffffff)                      */
/* ==========================================================  ISR  ========================================================== */
#define RAM_ISR_PARITY_Pos (0UL)   /*!< PARITY (Bit 0)                                        */
#define RAM_ISR_PARITY_Msk (0x1UL) /*!< PARITY (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ICR  ========================================================== */
#define RAM_ICR_PARITY_Pos (0UL)   /*!< PARITY (Bit 0)                                        */
#define RAM_ICR_PARITY_Msk (0x1UL) /*!< PARITY (Bitfield-Mask: 0x01)                          */

/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  KEY  ========================================================== */
#define RTC_KEY_KEY_Pos (0UL)    /*!< KEY (Bit 0)                                           */
#define RTC_KEY_KEY_Msk (0xffUL) /*!< KEY (Bitfield-Mask: 0xff)                             */
/* ==========================================================  CR0  ========================================================== */
#define RTC_CR0_START_Pos (7UL)      /*!< START (Bit 7)                                         */
#define RTC_CR0_START_Msk (0x80UL)   /*!< START (Bitfield-Mask: 0x01)                           */
#define RTC_CR0_RTC1HZ_Pos (5UL)     /*!< RTC1HZ (Bit 5)                                        */
#define RTC_CR0_RTC1HZ_Msk (0x60UL)  /*!< RTC1HZ (Bitfield-Mask: 0x03)                          */
#define RTC_CR0_H24_Pos (3UL)        /*!< H24 (Bit 3)                                           */
#define RTC_CR0_H24_Msk (0x8UL)      /*!< H24 (Bitfield-Mask: 0x01)                             */
#define RTC_CR0_INTERVAL_Pos (0UL)   /*!< INTERVAL (Bit 0)                                      */
#define RTC_CR0_INTERVAL_Msk (0x7UL) /*!< INTERVAL (Bitfield-Mask: 0x07)                        */
/* ==========================================================  CR1  ========================================================== */
#define RTC_CR1_SOURCE_Pos (8UL)     /*!< SOURCE (Bit 8)                                        */
#define RTC_CR1_SOURCE_Msk (0x700UL) /*!< SOURCE (Bitfield-Mask: 0x07)                          */
#define RTC_CR1_WAIT_Pos (2UL)       /*!< WAIT (Bit 2)                                          */
#define RTC_CR1_WAIT_Msk (0x4UL)     /*!< WAIT (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CR2  ========================================================== */
#define RTC_CR2_ALARMBEN_Pos (10UL)    /*!< ALARMBEN (Bit 10)                                     */
#define RTC_CR2_ALARMBEN_Msk (0x400UL) /*!< ALARMBEN (Bitfield-Mask: 0x01)                        */
#define RTC_CR2_ALARMAEN_Pos (9UL)     /*!< ALARMAEN (Bit 9)                                      */
#define RTC_CR2_ALARMAEN_Msk (0x200UL) /*!< ALARMAEN (Bitfield-Mask: 0x01)                        */
#define RTC_CR2_AWTEN_Pos (7UL)        /*!< AWTEN (Bit 7)                                         */
#define RTC_CR2_AWTEN_Msk (0x80UL)     /*!< AWTEN (Bitfield-Mask: 0x01)                           */
#define RTC_CR2_TAMPEN_Pos (6UL)       /*!< TAMPEN (Bit 6)                                        */
#define RTC_CR2_TAMPEN_Msk (0x40UL)    /*!< TAMPEN (Bitfield-Mask: 0x01)                          */
#define RTC_CR2_RTCOUT_Pos (4UL)       /*!< RTCOUT (Bit 4)                                        */
#define RTC_CR2_RTCOUT_Msk (0x30UL)    /*!< RTCOUT (Bitfield-Mask: 0x03)                          */
#define RTC_CR2_TAMPEDGE_Pos (3UL)     /*!< TAMPEDGE (Bit 3)                                      */
#define RTC_CR2_TAMPEDGE_Msk (0x8UL)   /*!< TAMPEDGE (Bitfield-Mask: 0x01)                        */
#define RTC_CR2_AWTSRC_Pos (2UL)       /*!< AWTSRC (Bit 2)                                        */
#define RTC_CR2_AWTSRC_Msk (0x4UL)     /*!< AWTSRC (Bitfield-Mask: 0x01)                          */
#define RTC_CR2_AWTPRS_Pos (0UL)       /*!< AWTPRS (Bit 0)                                        */
#define RTC_CR2_AWTPRS_Msk (0x3UL)     /*!< AWTPRS (Bitfield-Mask: 0x03)                          */
/* ==========================================================  PSC  ========================================================== */
#define RTC_PSC_PSC1_Pos (20UL)        /*!< PSC1 (Bit 20)                                         */
#define RTC_PSC_PSC1_Msk (0xff00000UL) /*!< PSC1 (Bitfield-Mask: 0xff)                            */
#define RTC_PSC_PSC2_Pos (0UL)         /*!< PSC2 (Bit 0)                                          */
#define RTC_PSC_PSC2_Msk (0xfffffUL)   /*!< PSC2 (Bitfield-Mask: 0xfffff)                         */
/* =========================================================  DATE  ========================================================== */
#define RTC_DATE_WEEK_Pos (24UL)        /*!< WEEK (Bit 24)                                         */
#define RTC_DATE_WEEK_Msk (0x7000000UL) /*!< WEEK (Bitfield-Mask: 0x07)                            */
#define RTC_DATE_YEAR_Pos (16UL)        /*!< YEAR (Bit 16)                                         */
#define RTC_DATE_YEAR_Msk (0xff0000UL)  /*!< YEAR (Bitfield-Mask: 0xff)                            */
#define RTC_DATE_MONTH_Pos (8UL)        /*!< MONTH (Bit 8)                                         */
#define RTC_DATE_MONTH_Msk (0xff00UL)   /*!< MONTH (Bitfield-Mask: 0xff)                           */
#define RTC_DATE_DAY_Pos (0UL)          /*!< DAY (Bit 0)                                           */
#define RTC_DATE_DAY_Msk (0xffUL)       /*!< DAY (Bitfield-Mask: 0xff)                             */
/* =========================================================  TIME  ========================================================== */
#define RTC_TIME_HOUR_Pos (16UL)       /*!< HOUR (Bit 16)                                         */
#define RTC_TIME_HOUR_Msk (0x3f0000UL) /*!< HOUR (Bitfield-Mask: 0x3f)                            */
#define RTC_TIME_MINUTE_Pos (8UL)      /*!< MINUTE (Bit 8)                                        */
#define RTC_TIME_MINUTE_Msk (0x7f00UL) /*!< MINUTE (Bitfield-Mask: 0x7f)                          */
#define RTC_TIME_SECOND_Pos (0UL)      /*!< SECOND (Bit 0)                                        */
#define RTC_TIME_SECOND_Msk (0x7fUL)   /*!< SECOND (Bitfield-Mask: 0x7f)                          */
/* =========================================================  SSCNT  ========================================================= */
#define RTC_SSCNT_SSCNT1_Pos (20UL)       /*!< SSCNT1 (Bit 20)                                       */
#define RTC_SSCNT_SSCNT1_Msk (0x100000UL) /*!< SSCNT1 (Bitfield-Mask: 0x01)                          */
#define RTC_SSCNT_SSCNT0_Pos (0UL)        /*!< SSCNT0 (Bit 0)                                        */
#define RTC_SSCNT_SSCNT0_Msk (0xfffffUL)  /*!< SSCNT0 (Bitfield-Mask: 0xfffff)                       */
/* ========================================================  ALARMA  ========================================================= */
#define RTC_ALARMA_WEEKMASK_Pos (24UL)         /*!< WEEKMASK (Bit 24)                                     */
#define RTC_ALARMA_WEEKMASK_Msk (0x7f000000UL) /*!< WEEKMASK (Bitfield-Mask: 0x7f)                        */
#define RTC_ALARMA_HOUREN_Pos (23UL)           /*!< HOUREN (Bit 23)                                       */
#define RTC_ALARMA_HOUREN_Msk (0x800000UL)     /*!< HOUREN (Bitfield-Mask: 0x01)                          */
#define RTC_ALARMA_HOUR_Pos (16UL)             /*!< HOUR (Bit 16)                                         */
#define RTC_ALARMA_HOUR_Msk (0x3f0000UL)       /*!< HOUR (Bitfield-Mask: 0x3f)                            */
#define RTC_ALARMA_MINUTEEN_Pos (15UL)         /*!< MINUTEEN (Bit 15)                                     */
#define RTC_ALARMA_MINUTEEN_Msk (0x8000UL)     /*!< MINUTEEN (Bitfield-Mask: 0x01)                        */
#define RTC_ALARMA_MINUTE_Pos (8UL)            /*!< MINUTE (Bit 8)                                        */
#define RTC_ALARMA_MINUTE_Msk (0x7f00UL)       /*!< MINUTE (Bitfield-Mask: 0x7f)                          */
#define RTC_ALARMA_SECONDEN_Pos (7UL)          /*!< SECONDEN (Bit 7)                                      */
#define RTC_ALARMA_SECONDEN_Msk (0x80UL)       /*!< SECONDEN (Bitfield-Mask: 0x01)                        */
#define RTC_ALARMA_SECOND_Pos (0UL)            /*!< SECOND (Bit 0)                                        */
#define RTC_ALARMA_SECOND_Msk (0x7fUL)         /*!< SECOND (Bitfield-Mask: 0x7f)                          */
/* ========================================================  ALARMB  ========================================================= */
#define RTC_ALARMB_WEEKMASK_Pos (24UL)         /*!< WEEKMASK (Bit 24)                                     */
#define RTC_ALARMB_WEEKMASK_Msk (0x7f000000UL) /*!< WEEKMASK (Bitfield-Mask: 0x7f)                        */
#define RTC_ALARMB_HOUREN_Pos (23UL)           /*!< HOUREN (Bit 23)                                       */
#define RTC_ALARMB_HOUREN_Msk (0x800000UL)     /*!< HOUREN (Bitfield-Mask: 0x01)                          */
#define RTC_ALARMB_HOUR_Pos (16UL)             /*!< HOUR (Bit 16)                                         */
#define RTC_ALARMB_HOUR_Msk (0x3f0000UL)       /*!< HOUR (Bitfield-Mask: 0x3f)                            */
#define RTC_ALARMB_MINUTEEN_Pos (15UL)         /*!< MINUTEEN (Bit 15)                                     */
#define RTC_ALARMB_MINUTEEN_Msk (0x8000UL)     /*!< MINUTEEN (Bitfield-Mask: 0x01)                        */
#define RTC_ALARMB_MINUTE_Pos (8UL)            /*!< MINUTE (Bit 8)                                        */
#define RTC_ALARMB_MINUTE_Msk (0x7f00UL)       /*!< MINUTE (Bitfield-Mask: 0x7f)                          */
#define RTC_ALARMB_SECONDEN_Pos (7UL)          /*!< SECONDEN (Bit 7)                                      */
#define RTC_ALARMB_SECONDEN_Msk (0x80UL)       /*!< SECONDEN (Bitfield-Mask: 0x01)                        */
#define RTC_ALARMB_SECOND_Pos (0UL)            /*!< SECOND (Bit 0)                                        */
#define RTC_ALARMB_SECOND_Msk (0x7fUL)         /*!< SECOND (Bitfield-Mask: 0x7f)                          */
/* =======================================================  TAMPDATE  ======================================================== */
#define RTC_TAMPDATE_WEEK_Pos (13UL)      /*!< WEEK (Bit 13)                                         */
#define RTC_TAMPDATE_WEEK_Msk (0xe000UL)  /*!< WEEK (Bitfield-Mask: 0x07)                            */
#define RTC_TAMPDATE_MONTH_Pos (8UL)      /*!< MONTH (Bit 8)                                         */
#define RTC_TAMPDATE_MONTH_Msk (0x1f00UL) /*!< MONTH (Bitfield-Mask: 0x1f)                           */
#define RTC_TAMPDATE_DAY_Pos (0UL)        /*!< DAY (Bit 0)                                           */
#define RTC_TAMPDATE_DAY_Msk (0x3fUL)     /*!< DAY (Bitfield-Mask: 0x3f)                             */
/* =======================================================  TAMPTIME  ======================================================== */
#define RTC_TAMPTIME_HOUR_Pos (16UL)       /*!< HOUR (Bit 16)                                         */
#define RTC_TAMPTIME_HOUR_Msk (0x3f0000UL) /*!< HOUR (Bitfield-Mask: 0x3f)                            */
#define RTC_TAMPTIME_MINUTE_Pos (8UL)      /*!< MINUTE (Bit 8)                                        */
#define RTC_TAMPTIME_MINUTE_Msk (0x7f00UL) /*!< MINUTE (Bitfield-Mask: 0x7f)                          */
#define RTC_TAMPTIME_SECOND_Pos (0UL)      /*!< SECOND (Bit 0)                                        */
#define RTC_TAMPTIME_SECOND_Msk (0x7fUL)   /*!< SECOND (Bitfield-Mask: 0x7f)                          */
/* ==========================================================  IER  ========================================================== */
#define RTC_IER_INTERVAL_Pos (6UL)    /*!< INTERVAL (Bit 6)                                      */
#define RTC_IER_INTERVAL_Msk (0x40UL) /*!< INTERVAL (Bitfield-Mask: 0x01)                        */
#define RTC_IER_TAMPOV_Pos (4UL)      /*!< TAMPOV (Bit 4)                                        */
#define RTC_IER_TAMPOV_Msk (0x10UL)   /*!< TAMPOV (Bitfield-Mask: 0x01)                          */
#define RTC_IER_TAMP_Pos (3UL)        /*!< TAMP (Bit 3)                                          */
#define RTC_IER_TAMP_Msk (0x8UL)      /*!< TAMP (Bitfield-Mask: 0x01)                            */
#define RTC_IER_AWTIMER_Pos (2UL)     /*!< AWTIMER (Bit 2)                                       */
#define RTC_IER_AWTIMER_Msk (0x4UL)   /*!< AWTIMER (Bitfield-Mask: 0x01)                         */
#define RTC_IER_ALARMB_Pos (1UL)      /*!< ALARMB (Bit 1)                                        */
#define RTC_IER_ALARMB_Msk (0x2UL)    /*!< ALARMB (Bitfield-Mask: 0x01)                          */
#define RTC_IER_ALARMA_Pos (0UL)      /*!< ALARMA (Bit 0)                                        */
#define RTC_IER_ALARMA_Msk (0x1UL)    /*!< ALARMA (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ISR  ========================================================== */
#define RTC_ISR_INTERVAL_Pos (6UL)    /*!< INTERVAL (Bit 6)                                      */
#define RTC_ISR_INTERVAL_Msk (0x40UL) /*!< INTERVAL (Bitfield-Mask: 0x01)                        */
#define RTC_ISR_TAMPOV_Pos (4UL)      /*!< TAMPOV (Bit 4)                                        */
#define RTC_ISR_TAMPOV_Msk (0x10UL)   /*!< TAMPOV (Bitfield-Mask: 0x01)                          */
#define RTC_ISR_TAMP_Pos (3UL)        /*!< TAMP (Bit 3)                                          */
#define RTC_ISR_TAMP_Msk (0x8UL)      /*!< TAMP (Bitfield-Mask: 0x01)                            */
#define RTC_ISR_AWTIMER_Pos (2UL)     /*!< AWTIMER (Bit 2)                                       */
#define RTC_ISR_AWTIMER_Msk (0x4UL)   /*!< AWTIMER (Bitfield-Mask: 0x01)                         */
#define RTC_ISR_ALARMB_Pos (1UL)      /*!< ALARMB (Bit 1)                                        */
#define RTC_ISR_ALARMB_Msk (0x2UL)    /*!< ALARMB (Bitfield-Mask: 0x01)                          */
#define RTC_ISR_ALARMA_Pos (0UL)      /*!< ALARMA (Bit 0)                                        */
#define RTC_ISR_ALARMA_Msk (0x1UL)    /*!< ALARMA (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ICR  ========================================================== */
#define RTC_ICR_INTERVAL_Pos (6UL)    /*!< INTERVAL (Bit 6)                                      */
#define RTC_ICR_INTERVAL_Msk (0x40UL) /*!< INTERVAL (Bitfield-Mask: 0x01)                        */
#define RTC_ICR_TAMPOV_Pos (4UL)      /*!< TAMPOV (Bit 4)                                        */
#define RTC_ICR_TAMPOV_Msk (0x10UL)   /*!< TAMPOV (Bitfield-Mask: 0x01)                          */
#define RTC_ICR_TAMP_Pos (3UL)        /*!< TAMP (Bit 3)                                          */
#define RTC_ICR_TAMP_Msk (0x8UL)      /*!< TAMP (Bitfield-Mask: 0x01)                            */
#define RTC_ICR_AWTIMER_Pos (2UL)     /*!< AWTIMER (Bit 2)                                       */
#define RTC_ICR_AWTIMER_Msk (0x4UL)   /*!< AWTIMER (Bitfield-Mask: 0x01)                         */
#define RTC_ICR_ALARMB_Pos (1UL)      /*!< ALARMB (Bit 1)                                        */
#define RTC_ICR_ALARMB_Msk (0x2UL)    /*!< ALARMB (Bitfield-Mask: 0x01)                          */
#define RTC_ICR_ALARMA_Pos (0UL)      /*!< ALARMA (Bit 0)                                        */
#define RTC_ICR_ALARMA_Msk (0x1UL)    /*!< ALARMA (Bitfield-Mask: 0x01)                          */
/* ========================================================  AWTARR  ========================================================= */
#define RTC_AWTARR_ARR_Pos (0UL)      /*!< ARR (Bit 0)                                           */
#define RTC_AWTARR_ARR_Msk (0xffffUL) /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* ========================================================  AWTCNT  ========================================================= */
#define RTC_AWTCNT_CNT_Pos (0UL)      /*!< CNT (Bit 0)                                           */
#define RTC_AWTCNT_CNT_Msk (0xffffUL) /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  COMPCFR1  ======================================================== */
#define RTC_COMPCFR1_EN_Pos (15UL)         /*!< EN (Bit 15)                                           */
#define RTC_COMPCFR1_EN_Msk (0x8000UL)     /*!< EN (Bitfield-Mask: 0x01)                              */
#define RTC_COMPCFR1_SIGN_Pos (14UL)       /*!< SIGN (Bit 14)                                         */
#define RTC_COMPCFR1_SIGN_Msk (0x4000UL)   /*!< SIGN (Bitfield-Mask: 0x01)                            */
#define RTC_COMPCFR1_PERIOD_Pos (12UL)     /*!< PERIOD (Bit 12)                                       */
#define RTC_COMPCFR1_PERIOD_Msk (0x3000UL) /*!< PERIOD (Bitfield-Mask: 0x03)                          */
#define RTC_COMPCFR1_COMP_Pos (0UL)        /*!< COMP (Bit 0)                                          */
#define RTC_COMPCFR1_COMP_Msk (0xfffUL)    /*!< COMP (Bitfield-Mask: 0xfff)                           */

/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */

