zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011.h
/* ==========================================================  CR0  ========================================================== */
#define SYSCTRL_CR0_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define SYSCTRL_CR0_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_CR0_HCLKPRS_Pos (5UL)      /*!< HCLKPRS (Bit 5)                                       */
#define SYSCTRL_CR0_HCLKPRS_Msk (0xe0UL)   /*!< HCLKPRS (Bitfield-Mask: 0x07)                         */
#define SYSCTRL_CR0_PCLKPRS_Pos (3UL)      /*!< PCLKPRS (Bit 3)                                       */
#define SYSCTRL_CR0_PCLKPRS_Msk (0x18UL)   /*!< PCLKPRS (Bitfield-Mask: 0x03)                         */
#define SYSCTRL_CR0_SYSCLK_Pos (0UL)       /*!< SYSCLK (Bit 0)                                        */
#define SYSCTRL_CR0_SYSCLK_Msk (0x7UL)     /*!< SYSCLK (Bitfield-Mask: 0x07)                          */
/* ==========================================================  CR1  ========================================================== */
#define SYSCTRL_CR1_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define SYSCTRL_CR1_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_CR1_CLKCCS_Pos (8UL)       /*!< CLKCCS (Bit 8)                                        */
#define SYSCTRL_CR1_CLKCCS_Msk (0x100UL)   /*!< CLKCCS (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_CR1_HSECCS_Pos (7UL)       /*!< HSECCS (Bit 7)                                        */
#define SYSCTRL_CR1_HSECCS_Msk (0x80UL)    /*!< HSECCS (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_CR1_LSECCS_Pos (6UL)       /*!< LSECCS (Bit 6)                                        */
#define SYSCTRL_CR1_LSECCS_Msk (0x40UL)    /*!< LSECCS (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_CR1_LSELOCK_Pos (5UL)      /*!< LSELOCK (Bit 5)                                       */
#define SYSCTRL_CR1_LSELOCK_Msk (0x20UL)   /*!< LSELOCK (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_CR1_LSEEN_Pos (4UL)        /*!< LSEEN (Bit 4)                                         */
#define SYSCTRL_CR1_LSEEN_Msk (0x10UL)     /*!< LSEEN (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_CR1_LSIEN_Pos (3UL)        /*!< LSIEN (Bit 3)                                         */
#define SYSCTRL_CR1_LSIEN_Msk (0x8UL)      /*!< LSIEN (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_CR1_HSEEN_Pos (1UL)        /*!< HSEEN (Bit 1)                                         */
#define SYSCTRL_CR1_HSEEN_Msk (0x2UL)      /*!< HSEEN (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_CR1_HSIEN_Pos (0UL)        /*!< HSIEN (Bit 0)                                         */
#define SYSCTRL_CR1_HSIEN_Msk (0x1UL)      /*!< HSIEN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CR2  ========================================================== */
#define SYSCTRL_CR2_KEY_Pos (16UL)          /*!< KEY (Bit 16)                                          */
#define SYSCTRL_CR2_KEY_Msk (0xffff0000UL)  /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_CR2_RAMBRKEN_Pos (15UL)     /*!< RAMBRKEN (Bit 15)                                     */
#define SYSCTRL_CR2_RAMBRKEN_Msk (0x8000UL) /*!< RAMBRKEN (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_CR2_LVDBRKEN_Pos (14UL)     /*!< LVDBRKEN (Bit 14)                                     */
#define SYSCTRL_CR2_LVDBRKEN_Msk (0x4000UL) /*!< LVDBRKEN (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_CR2_DSBRKEN_Pos (13UL)      /*!< DSBRKEN (Bit 13)                                      */
#define SYSCTRL_CR2_DSBRKEN_Msk (0x2000UL)  /*!< DSBRKEN (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_CR2_CLLBRKEN_Pos (12UL)     /*!< CLLBRKEN (Bit 12)                                     */
#define SYSCTRL_CR2_CLLBRKEN_Msk (0x1000UL) /*!< CLLBRKEN (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_CR2_LSEBRKEN_Pos (11UL)     /*!< LSEBRKEN (Bit 11)                                     */
#define SYSCTRL_CR2_LSEBRKEN_Msk (0x800UL)  /*!< LSEBRKEN (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_CR2_HSEBRKEN_Pos (10UL)     /*!< HSEBRKEN (Bit 10)                                     */
#define SYSCTRL_CR2_HSEBRKEN_Msk (0x400UL)  /*!< HSEBRKEN (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_CR2_RTCLPM_Pos (7UL)        /*!< RTCLPM (Bit 7)                                        */
#define SYSCTRL_CR2_RTCLPM_Msk (0x80UL)     /*!< RTCLPM (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_CR2_FLASHWAIT_Pos (4UL)     /*!< FLASHWAIT (Bit 4)                                     */
#define SYSCTRL_CR2_FLASHWAIT_Msk (0x70UL)  /*!< FLASHWAIT (Bitfield-Mask: 0x07)                       */
#define SYSCTRL_CR2_WAKEUPCLK_Pos (3UL)     /*!< WAKEUPCLK (Bit 3)                                     */
#define SYSCTRL_CR2_WAKEUPCLK_Msk (0x8UL)   /*!< WAKEUPCLK (Bitfield-Mask: 0x01)                       */
#define SYSCTRL_CR2_LOCKUP_Pos (2UL)        /*!< LOCKUP (Bit 2)                                        */
#define SYSCTRL_CR2_LOCKUP_Msk (0x4UL)      /*!< LOCKUP (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_CR2_SWDIO_Pos (1UL)         /*!< SWDIO (Bit 1)                                         */
#define SYSCTRL_CR2_SWDIO_Msk (0x2UL)       /*!< SWDIO (Bitfield-Mask: 0x01)                           */
/* ==========================================================  IER  ========================================================== */
#define SYSCTRL_IER_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define SYSCTRL_IER_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_IER_HSEFAULT_Pos (8UL)     /*!< HSEFAULT (Bit 8)                                      */
#define SYSCTRL_IER_HSEFAULT_Msk (0x100UL) /*!< HSEFAULT (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_IER_LSEFAULT_Pos (7UL)     /*!< LSEFAULT (Bit 7)                                      */
#define SYSCTRL_IER_LSEFAULT_Msk (0x80UL)  /*!< LSEFAULT (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_IER_HSEFAIL_Pos (6UL)      /*!< HSEFAIL (Bit 6)                                       */
#define SYSCTRL_IER_HSEFAIL_Msk (0x40UL)   /*!< HSEFAIL (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_IER_LSEFAIL_Pos (5UL)      /*!< LSEFAIL (Bit 5)                                       */
#define SYSCTRL_IER_LSEFAIL_Msk (0x20UL)   /*!< LSEFAIL (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_IER_LSERDY_Pos (4UL)       /*!< LSERDY (Bit 4)                                        */
#define SYSCTRL_IER_LSERDY_Msk (0x10UL)    /*!< LSERDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_IER_LSIRDY_Pos (3UL)       /*!< LSIRDY (Bit 3)                                        */
#define SYSCTRL_IER_LSIRDY_Msk (0x8UL)     /*!< LSIRDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_IER_HSERDY_Pos (1UL)       /*!< HSERDY (Bit 1)                                        */
#define SYSCTRL_IER_HSERDY_Msk (0x2UL)     /*!< HSERDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_IER_HSIRDY_Pos (0UL)       /*!< HSIRDY (Bit 0)                                        */
#define SYSCTRL_IER_HSIRDY_Msk (0x1UL)     /*!< HSIRDY (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ISR  ========================================================== */
#define SYSCTRL_ISR_LSESTABLE_Pos (15UL)     /*!< LSESTABLE (Bit 15)                                    */
#define SYSCTRL_ISR_LSESTABLE_Msk (0x8000UL) /*!< LSESTABLE (Bitfield-Mask: 0x01)                       */
#define SYSCTRL_ISR_LSISTABLE_Pos (14UL)     /*!< LSISTABLE (Bit 14)                                    */
#define SYSCTRL_ISR_LSISTABLE_Msk (0x4000UL) /*!< LSISTABLE (Bitfield-Mask: 0x01)                       */
#define SYSCTRL_ISR_HSESTABLE_Pos (12UL)     /*!< HSESTABLE (Bit 12)                                    */
#define SYSCTRL_ISR_HSESTABLE_Msk (0x1000UL) /*!< HSESTABLE (Bitfield-Mask: 0x01)                       */
#define SYSCTRL_ISR_HSISTABLE_Pos (11UL)     /*!< HSISTABLE (Bit 11)                                    */
#define SYSCTRL_ISR_HSISTABLE_Msk (0x800UL)  /*!< HSISTABLE (Bitfield-Mask: 0x01)                       */
#define SYSCTRL_ISR_HSEFAULT_Pos (8UL)       /*!< HSEFAULT (Bit 8)                                      */
#define SYSCTRL_ISR_HSEFAULT_Msk (0x100UL)   /*!< HSEFAULT (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_ISR_LSEFAULT_Pos (7UL)       /*!< LSEFAULT (Bit 7)                                      */
#define SYSCTRL_ISR_LSEFAULT_Msk (0x80UL)    /*!< LSEFAULT (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_ISR_HSEFAIL_Pos (6UL)        /*!< HSEFAIL (Bit 6)                                       */
#define SYSCTRL_ISR_HSEFAIL_Msk (0x40UL)     /*!< HSEFAIL (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_ISR_LSEFAIL_Pos (5UL)        /*!< LSEFAIL (Bit 5)                                       */
#define SYSCTRL_ISR_LSEFAIL_Msk (0x20UL)     /*!< LSEFAIL (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_ISR_LSERDY_Pos (4UL)         /*!< LSERDY (Bit 4)                                        */
#define SYSCTRL_ISR_LSERDY_Msk (0x10UL)      /*!< LSERDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_ISR_LSIRDY_Pos (3UL)         /*!< LSIRDY (Bit 3)                                        */
#define SYSCTRL_ISR_LSIRDY_Msk (0x8UL)       /*!< LSIRDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_ISR_HSERDY_Pos (1UL)         /*!< HSERDY (Bit 1)                                        */
#define SYSCTRL_ISR_HSERDY_Msk (0x2UL)       /*!< HSERDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_ISR_HSIRDY_Pos (0UL)         /*!< HSIRDY (Bit 0)                                        */
#define SYSCTRL_ISR_HSIRDY_Msk (0x1UL)       /*!< HSIRDY (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ICR  ========================================================== */
#define SYSCTRL_ICR_HSEFAULT_Pos (8UL)     /*!< HSEFAULT (Bit 8)                                      */
#define SYSCTRL_ICR_HSEFAULT_Msk (0x100UL) /*!< HSEFAULT (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_ICR_LSEFAULT_Pos (7UL)     /*!< LSEFAULT (Bit 7)                                      */
#define SYSCTRL_ICR_LSEFAULT_Msk (0x80UL)  /*!< LSEFAULT (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_ICR_HSEFAIL_Pos (6UL)      /*!< HSEFAIL (Bit 6)                                       */
#define SYSCTRL_ICR_HSEFAIL_Msk (0x40UL)   /*!< HSEFAIL (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_ICR_LSEFAIL_Pos (5UL)      /*!< LSEFAIL (Bit 5)                                       */
#define SYSCTRL_ICR_LSEFAIL_Msk (0x20UL)   /*!< LSEFAIL (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_ICR_LSERDY_Pos (4UL)       /*!< LSERDY (Bit 4)                                        */
#define SYSCTRL_ICR_LSERDY_Msk (0x10UL)    /*!< LSERDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_ICR_LSIRDY_Pos (3UL)       /*!< LSIRDY (Bit 3)                                        */
#define SYSCTRL_ICR_LSIRDY_Msk (0x8UL)     /*!< LSIRDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_ICR_HSERDY_Pos (1UL)       /*!< HSERDY (Bit 1)                                        */
#define SYSCTRL_ICR_HSERDY_Msk (0x2UL)     /*!< HSERDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_ICR_HSIRDY_Pos (0UL)       /*!< HSIRDY (Bit 0)                                        */
#define SYSCTRL_ICR_HSIRDY_Msk (0x1UL)     /*!< HSIRDY (Bitfield-Mask: 0x01)                          */
/* ==========================================================  HSI  ========================================================== */
#define SYSCTRL_HSI_STABLE_Pos (15UL)     /*!< STABLE (Bit 15)                                       */
#define SYSCTRL_HSI_STABLE_Msk (0x8000UL) /*!< STABLE (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_HSI_DIV_Pos (11UL)        /*!< DIV (Bit 11)                                          */
#define SYSCTRL_HSI_DIV_Msk (0x7800UL)    /*!< DIV (Bitfield-Mask: 0x0f)                             */
#define SYSCTRL_HSI_TRIM_Pos (0UL)        /*!< TRIM (Bit 0)                                          */
#define SYSCTRL_HSI_TRIM_Msk (0x7ffUL)    /*!< TRIM (Bitfield-Mask: 0x7ff)                           */
/* ==========================================================  HSE  ========================================================== */
#define SYSCTRL_HSE_DIGFLT_Pos (24UL)        /*!< DIGFLT (Bit 24)                                       */
#define SYSCTRL_HSE_DIGFLT_Msk (0x1000000UL) /*!< DIGFLT (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_HSE_PDRIVER_Pos (20UL)       /*!< PDRIVER (Bit 20)                                      */
#define SYSCTRL_HSE_PDRIVER_Msk (0xf00000UL) /*!< PDRIVER (Bitfield-Mask: 0x0f)                         */
#define SYSCTRL_HSE_STABLE_Pos (19UL)        /*!< STABLE (Bit 19)                                       */
#define SYSCTRL_HSE_STABLE_Msk (0x80000UL)   /*!< STABLE (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_HSE_DETCNT_Pos (8UL)         /*!< DETCNT (Bit 8)                                        */
#define SYSCTRL_HSE_DETCNT_Msk (0x7ff00UL)   /*!< DETCNT (Bitfield-Mask: 0x7ff)                         */
#define SYSCTRL_HSE_HEXENPOL_Pos (7UL)       /*!< HEXENPOL (Bit 7)                                      */
#define SYSCTRL_HSE_HEXENPOL_Msk (0x80UL)    /*!< HEXENPOL (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_HSE_MODE_Pos (6UL)           /*!< MODE (Bit 6)                                          */
#define SYSCTRL_HSE_MODE_Msk (0x40UL)        /*!< MODE (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_HSE_WAITCYCLE_Pos (4UL)      /*!< WAITCYCLE (Bit 4)                                     */
#define SYSCTRL_HSE_WAITCYCLE_Msk (0x30UL)   /*!< WAITCYCLE (Bitfield-Mask: 0x03)                       */
#define SYSCTRL_HSE_DRIVER_Pos (0UL)         /*!< DRIVER (Bit 0)                                        */
#define SYSCTRL_HSE_DRIVER_Msk (0xfUL)       /*!< DRIVER (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  LSI  ========================================================== */
#define SYSCTRL_LSI_STABLE_Pos (15UL)       /*!< STABLE (Bit 15)                                       */
#define SYSCTRL_LSI_STABLE_Msk (0x8000UL)   /*!< STABLE (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_LSI_WAITCYCLE_Pos (10UL)    /*!< WAITCYCLE (Bit 10)                                    */
#define SYSCTRL_LSI_WAITCYCLE_Msk (0xc00UL) /*!< WAITCYCLE (Bitfield-Mask: 0x03)                       */
#define SYSCTRL_LSI_TRIM_Pos (0UL)          /*!< TRIM (Bit 0)                                          */
#define SYSCTRL_LSI_TRIM_Msk (0x3ffUL)      /*!< TRIM (Bitfield-Mask: 0x3ff)                           */
/* ==========================================================  LSE  ========================================================== */
#define SYSCTRL_LSE_STABLE_Pos (18UL)       /*!< STABLE (Bit 18)                                       */
#define SYSCTRL_LSE_STABLE_Msk (0x40000UL)  /*!< STABLE (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_LSE_PINLOCK_Pos (17UL)      /*!< PINLOCK (Bit 17)                                      */
#define SYSCTRL_LSE_PINLOCK_Msk (0x20000UL) /*!< PINLOCK (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_LSE_PDRIVER_Pos (8UL)       /*!< PDRIVER (Bit 8)                                       */
#define SYSCTRL_LSE_PDRIVER_Msk (0xf00UL)   /*!< PDRIVER (Bitfield-Mask: 0x0f)                         */
#define SYSCTRL_LSE_MODE_Pos (6UL)          /*!< MODE (Bit 6)                                          */
#define SYSCTRL_LSE_MODE_Msk (0x40UL)       /*!< MODE (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_LSE_WAITCYCLE_Pos (4UL)     /*!< WAITCYCLE (Bit 4)                                     */
#define SYSCTRL_LSE_WAITCYCLE_Msk (0x30UL)  /*!< WAITCYCLE (Bitfield-Mask: 0x03)                       */
#define SYSCTRL_LSE_DRIVER_Pos (0UL)        /*!< DRIVER (Bit 0)                                        */
#define SYSCTRL_LSE_DRIVER_Msk (0xfUL)      /*!< DRIVER (Bitfield-Mask: 0x0f)                          */
/* =========================================================  DEBUG  ========================================================= */
#define SYSCTRL_DEBUG_IWDT_Pos (9UL)       /*!< IWDT (Bit 9)                                          */
#define SYSCTRL_DEBUG_IWDT_Msk (0x200UL)   /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_DEBUG_RTC_Pos (8UL)        /*!< RTC (Bit 8)                                           */
#define SYSCTRL_DEBUG_RTC_Msk (0x100UL)    /*!< RTC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_DEBUG_LPTIM_Pos (6UL)      /*!< LPTIM (Bit 6)                                         */
#define SYSCTRL_DEBUG_LPTIM_Msk (0x40UL)   /*!< LPTIM (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_BTIM123_Pos (5UL)    /*!< BTIM123 (Bit 5)                                       */
#define SYSCTRL_DEBUG_BTIM123_Msk (0x20UL) /*!< BTIM123 (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_DEBUG_GTIM2_Pos (2UL)      /*!< GTIM2 (Bit 2)                                         */
#define SYSCTRL_DEBUG_GTIM2_Msk (0x4UL)    /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_GTIM1_Pos (1UL)      /*!< GTIM1 (Bit 1)                                         */
#define SYSCTRL_DEBUG_GTIM1_Msk (0x2UL)    /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_ATIM_Pos (0UL)       /*!< ATIM (Bit 0)                                          */
#define SYSCTRL_DEBUG_ATIM_Msk (0x1UL)     /*!< ATIM (Bitfield-Mask: 0x01)                            */
/* =========================================================  AHBEN  ========================================================= */
#define SYSCTRL_AHBEN_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define SYSCTRL_AHBEN_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_AHBEN_GPIOC_Pos (6UL)        /*!< GPIOC (Bit 6)                                         */
#define SYSCTRL_AHBEN_GPIOC_Msk (0x40UL)     /*!< GPIOC (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBEN_GPIOB_Pos (5UL)        /*!< GPIOB (Bit 5)                                         */
#define SYSCTRL_AHBEN_GPIOB_Msk (0x20UL)     /*!< GPIOB (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBEN_GPIOA_Pos (4UL)        /*!< GPIOA (Bit 4)                                         */
#define SYSCTRL_AHBEN_GPIOA_Msk (0x10UL)     /*!< GPIOA (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBEN_CRC_Pos (2UL)          /*!< CRC (Bit 2)                                           */
#define SYSCTRL_AHBEN_CRC_Msk (0x4UL)        /*!< CRC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_AHBEN_FLASH_Pos (1UL)        /*!< FLASH (Bit 1)                                         */
#define SYSCTRL_AHBEN_FLASH_Msk (0x2UL)      /*!< FLASH (Bitfield-Mask: 0x01)                           */
/* ========================================================  APBEN2  ========================================================= */
#define SYSCTRL_APBEN2_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define SYSCTRL_APBEN2_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_APBEN2_LPTIM_Pos (7UL)        /*!< LPTIM (Bit 7)                                         */
#define SYSCTRL_APBEN2_LPTIM_Msk (0x80UL)     /*!< LPTIM (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN2_I2C_Pos (6UL)          /*!< I2C (Bit 6)                                          */
#define SYSCTRL_APBEN2_I2C_Msk (0x40UL)       /*!< I2C (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_IWDT_Pos (4UL)         /*!< IWDT (Bit 4)                                          */
#define SYSCTRL_APBEN2_IWDT_Msk (0x10UL)      /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_BTIM123_Pos (2UL)      /*!< BTIM123 (Bit 2)                                       */
#define SYSCTRL_APBEN2_BTIM123_Msk (0x4UL)    /*!< BTIM123 (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_APBEN2_RTC_Pos (1UL)          /*!< RTC (Bit 1)                                           */
#define SYSCTRL_APBEN2_RTC_Msk (0x2UL)        /*!< RTC (Bitfield-Mask: 0x01)                             */
/* ========================================================  APBEN1  ========================================================= */
#define SYSCTRL_APBEN1_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define SYSCTRL_APBEN1_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_APBEN1_UART3_Pos (8UL)        /*!< UART3 (Bit 8)                                         */
#define SYSCTRL_APBEN1_UART3_Msk (0x100UL)    /*!< UART3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_GTIM2_Pos (7UL)        /*!< GTIM2 (Bit 7)                                         */
#define SYSCTRL_APBEN1_GTIM2_Msk (0x80UL)     /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_GTIM1_Pos (6UL)        /*!< GTIM1 (Bit 6)                                         */
#define SYSCTRL_APBEN1_GTIM1_Msk (0x40UL)     /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_ATIM_Pos (5UL)         /*!< ATIM (Bit 5)                                          */
#define SYSCTRL_APBEN1_ATIM_Msk (0x20UL)      /*!< ATIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_UART2_Pos (4UL)        /*!< UART2 (Bit 4)                                         */
#define SYSCTRL_APBEN1_UART2_Msk (0x10UL)     /*!< UART2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_UART1_Pos (3UL)        /*!< UART1 (Bit 3)                                         */
#define SYSCTRL_APBEN1_UART1_Msk (0x8UL)      /*!< UART1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_SPI1_Pos (2UL)         /*!< SPI1 (Bit 2)                                          */
#define SYSCTRL_APBEN1_SPI1_Msk (0x4UL)       /*!< SPI1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_VC_Pos (1UL)           /*!< VC (Bit 1)                                            */
#define SYSCTRL_APBEN1_VC_Msk (0x2UL)         /*!< VC (Bitfield-Mask: 0x01)                              */
#define SYSCTRL_APBEN1_ADC_Pos (0UL)          /*!< ADC (Bit 0)                                           */
#define SYSCTRL_APBEN1_ADC_Msk (0x1UL)        /*!< ADC (Bitfield-Mask: 0x01)                             */
/* ========================================================  AHBRST  ========================================================= */
#define SYSCTRL_AHBRST_GPIOC_Pos (6UL)    /*!< GPIOC (Bit 6)                                         */
